AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t PWDSTAT    : 1;            /*!< Indicates the power-status of the ADC.                                    */
            uint32_t            : 31;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t SWT;                         /*!< This register enables initiating an ADC scan through software.            */

    struct {
      __IOM uint32_t SWT        : 8;            /*!< Writing 0x37 to this register generates a software trigger.               */
            uint32_t            : 24;
    } SWT_b;
  } ;

  union {
    __IOM uint32_t SL0CFG;                      /*!< Slot 0 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN0      : 1;            /*!< This bit enables slot 0 for ADC conversions.                              */
      __IOM uint32_t WCEN0      : 1;            /*!< This bit enables the window compare function for slot 0.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL0     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE0    : 2;            /*!< Set the Precision Mode For Slot 0.                                        */
      __IOM uint32_t TRKCYC0    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 63 specifies 68 cycles.)                                     */
      __IOM uint32_t ADSEL0     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL0CFG_b;
  } ;

  union {
    __IOM uint32_t SL1CFG;                      /*!< Slot 1 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN1      : 1;            /*!< This bit enables slot 1 for ADC conversions.                              */
      __IOM uint32_t WCEN1      : 1;            /*!< This bit enables the window compare function for slot 1.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL1     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE1    : 2;            /*!< Set the Precision Mode For Slot 1.                                        */
      __IOM uint32_t TRKCYC1    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 63 specifies 68 cycles.)                                     */
      __IOM uint32_t ADSEL1     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL1CFG_b;
  } ;

  union {
    __IOM uint32_t SL2CFG;                      /*!< Slot 2 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN2      : 1;            /*!< This bit enables slot 2 for ADC conversions.                              */
      __IOM uint32_t WCEN2      : 1;            /*!< This bit enables the window compare function for slot 2.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL2     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE2    : 2;            /*!< Set the Precision Mode For Slot 2.                                        */
      __IOM uint32_t TRKCYC2    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 63 specifies 68 cycles.)                                     */
      __IOM uint32_t ADSEL2     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL2CFG_b;
  } ;

  union {
    __IOM uint32_t SL3CFG;                      /*!< Slot 3 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN3      : 1;            /*!< This bit enables slot 3 for ADC conversions.                              */
      __IOM uint32_t WCEN3      : 1;            /*!< This bit enables the window compare function for slot 3.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL3     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE3    : 2;            /*!< Set the Precision Mode For Slot 3.                                        */
      __IOM uint32_t TRKCYC3    : 6;            /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 63 specifies 68 cycles.)                                     */
      __IOM uint32_t ADSEL3     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
            uint32_t            : 5;
    } SL3CFG_b;
  } ;

  union {
    __IOM uint32_t SL4CFG;                      /*!< Slot 4 Configuration                                                      */

