AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t METALOPR   : 4;            /*!< Meta data about this sample which represents the lower 4 bits
                                                     of the PGA gain code                                                      */
      __IOM uint32_t LGDATAPR   : 12;           /*!< Low-gain PGA sample data                                                  */
      __IOM uint32_t METAHIPR   : 3;            /*!< Meta data about this sample which represents the upper 3 bits
                                                     of the PGA gain code                                                      */
      __IOM uint32_t MICPR      : 1;            /*!< Which audio channel this data is from encoded as int(slot number/2).
                                                     In other words, this is 1 if data is from slots 2 or 3,
                                                     or 0 if from slots 0 or 1.                                                */
      __IOM uint32_t HGDATAPR   : 12;           /*!< High-gain PGA sample data                                                 */
    } FIFOPR_b;
  } ;

  union {
    __IOM uint32_t INTTRIGTIMER;                /*!< Configures the clock, maximum count, and enables the ADC internal
                                                     repeating trigger timer.                                                  */

    struct {
      __IOM uint32_t TIMERMAX   : 10;           /*!< Trigger counter count max, used as initial condition to trigger.
                                                     Also used repeatedly each time counter reaches it to restart
                                                     trigger timer at zero. To update this value, first disable
                                                     the INTTRIGTIMER by setting TIMEREN to DIS, change TIMERMAX,
                                                     and then reenable it INTTRIGTIMER by setting TIMEREN to
                                                     EN again.                                                                 */
            uint32_t            : 6;
      __IOM uint32_t CLKDIV     : 3;            /*!< Configure number of divide-by-2 of clock source as input to
                                                     the trigger counter up to divide-by-32. To update this
                                                     value, first disable the INTTRIGTIMER by setting TIMEREN
                                                     to DIS, change CLKDIV, and then reenable itthe INTTRIGTIMER
                                                     by setting TIMEREN to EN again.                                           */
            uint32_t            : 12;
      __IOM uint32_t TIMEREN    : 1;            /*!< ADC-internal trigger timer enable.                                        */
    } INTTRIGTIMER_b;
  } ;

  union {
    __IOM uint32_t FIFOSTAT;                    /*!< This register contains status of the data FIFO.                           */

    struct {
      __IOM uint32_t FIFOCNT    : 8;            /*!< Number of valid entries in the ADC FIFO.                                  */
            uint32_t            : 24;
    } FIFOSTAT_b;
  } ;

  union {
    __IOM uint32_t DATAOFFSET;                  /*!< Sample offset value                                                       */

    struct {
      __IOM uint32_t OFFSET     : 13;           /*!< Add this signed offset to data before being written to the FIFO.
                                                     This enables the user to convert unsigned samples to signed
                                                     or remove a DC offset on the samples. Note that this does
                                                     NOT affect the comparator limits, which still operate on
                                                     original unsigned samples.                                                */
            uint32_t            : 19;
    } DATAOFFSET_b;
  } ;
  __IM  uint32_t  RESERVED[5];

  union {
    __IOM uint32_t ZXCFG;                       /*!< Configures the zero crossing comparator                                   */

    struct {
      __IOM uint32_t ZXEN       : 1;            /*!< Enable the ZX comparator                                                  */
            uint32_t            : 3;
      __IOM uint32_t ZXCHANSEL  : 1;            /*!< Select which slots to use for zero crossing measurement. 0 enables
                                                     zero crossing detection on slots 0 and 2. 1 enables zero
                                                     crossing detection on slots 1 and 3.                                      */
            uint32_t            : 27;
    } ZXCFG_b;
  } ;

  union {
    __IOM uint32_t ZXLIM;                       /*!< Configures the zero crossing comparator limits                            */

    struct {
      __IOM uint32_t LZXC       : 12;           /*!< Sets the lower integer sample limit for the ZX comparator. Note
                                                     that these values are raw ADC values whose bounds are specified
                                                     by PRMODE but not maniupulated by accumulate/divide logic.
                                                     Therefore, there is no oversampling and no binary point
                                                     in this value. Samples must enter the range between UZXC
                                                     and LZXC in order for a zero crossing to be recognized.                   */
            uint32_t            : 4;
      __IOM uint32_t UZXC       : 12;           /*!< Sets the upper integer sample limit for the ZX comparator. Note
                                                     that these values are raw ADC values whose bounds are specified
                                                     by PRMODE but not maniupulated by accumulate/divide logic.
                                                     Therefore, there is no oversampling and no binary point
                                                     in this value. Samples must enter the range between UZXC
                                                     and LZXC in order for a zero crossing to be recognized.                   */
            uint32_t            : 4;
    } ZXLIM_b;
  } ;

  union {
    __IOM uint32_t GAINCFG;                     /*!< Configures the PGA gain                                                   */

