AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t DFIFO75    : 1;            /*!< Trigger DMA upon FIFO 75 percent Full                                     */
      __IOM uint32_t DFIFOFULL  : 1;            /*!< Trigger DMA upon FIFO 100 percent Full                                    */
            uint32_t            : 30;
    } DMATRIGEN_b;
  } ;

  union {
    __IOM uint32_t DMATRIGSTAT;                 /*!< Reports the ADC DMA trigger status                                        */

    struct {
      __IOM uint32_t D75STAT    : 1;            /*!< Triggered DMA from FIFO 75 percent Full                                   */
      __IOM uint32_t DFULLSTAT  : 1;            /*!< Triggered DMA from FIFO 100 percent Full                                  */
            uint32_t            : 30;
    } DMATRIGSTAT_b;
  } ;
  __IM  uint32_t  RESERVED4[14];

  union {
    __IOM uint32_t DMACFG;                      /*!< Configure/enable ADC DMA                                                  */

    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< DMA Enable                                                                */
            uint32_t            : 1;
      __IOM uint32_t DMADIR     : 1;            /*!< Direction                                                                 */
            uint32_t            : 5;
      __IOM uint32_t DMAPRI     : 1;            /*!< Sets the Priority of the DMA request                                      */
      __IOM uint32_t DMADYNPRI  : 1;            /*!< Enables dynamic priority based on FIFO fullness. When FIFO is
                                                     full, priority is automatically set to HIGH. Otherwise,
                                                     DMAPRI is used.                                                           */
            uint32_t            : 8;
      __IOM uint32_t DPWROFF    : 1;            /*!< Power Off the ADC System upon DMACPL.                                     */
      __IOM uint32_t NEXTDMAEN  : 1;            /*!< Next DMA Request Feature Enable. When set, SW shall not program
                                                     TOTCOUNT and TARGADDR. Instead, SW shall program TOTCOUNTNEXT
                                                     and TARGADDRNEXT, and load them into HW DMA request pipeline
                                                     using DMAENNEXT bit.                                                      */
            uint32_t            : 12;
    } DMACFG_b;
  } ;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t DMATOTCOUNT;                 /*!< DMA total transfer count control and status                               */

    struct {
            uint32_t            : 2;
      __IOM uint32_t TOTCOUNT   : 16;           /*!< Total Transfer Count                                                      */
            uint32_t            : 14;
    } DMATOTCOUNT_b;
  } ;

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< Configures the DMA target address                                         */

    struct {
      __IOM uint32_t LTARGADDR  : 32;           /*!< Sets the DMA Target Address                                               */
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMASTAT;                     /*!< Reports current DMA status                                                */

    struct {
      __IOM uint32_t DMATIP     : 1;            /*!< DMA Transfer In Progress                                                  */
      __IOM uint32_t DMACPL     : 1;            /*!< DMA Transfer Complete                                                     */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error                                                                 */
            uint32_t            : 29;
    } DMASTAT_b;
  } ;

  union {
    __IOM uint32_t DMATARGADDRNEXT;             /*!< Sets the next DMA target address                                          */

    struct {
      __IOM uint32_t TARGADDRNEXT : 32;         /*!< Next DMA Target Address. This register is not updated with the
                                                     current address of the DMA, but will remain static with
                                                     the original address during the DMA transfer.                             */
    } DMATARGADDRNEXT_b;
  } ;

  union {
    __IOM uint32_t DMATOTCOUNTNEXT;             /*!< Sets the next DMA total count                                             */

    struct {
            uint32_t            : 2;
      __IOM uint32_t TOTCOUNTNEXT : 16;         /*!< Next Total Transfer Count.                                                */
            uint32_t            : 14;
    } DMATOTCOUNTNEXT_b;
  } ;

  union {
    __IOM uint32_t DMAENNEXTCTRL;               /*!< Enable the next DMA transaction                                           */

    struct {
      __IOM uint32_t DMAENNEXT  : 1;            /*!< SW set this bit after setting up TOTCOUNTNEXT and TARGADDRNEXT
                                                     register fields. HW will then auto-load TOTCOUNTNEXT and
                                                     TARGADDRNEXT values when its current DMA job completes,
                                                     and auto-clear this DMAENNEXT bit. SW can then reload a
                                                     new DMA job with new TOTCOUNTNEXT and TARGADDRNEXT values.                */
            uint32_t            : 31;
    } DMAENNEXTCTRL_b;
  } ;
} AUDADC_Type;                                  /*!< Size = 672 (0x2a0)                                                        */



/* =========================================================================================================================== */
/* ================                                          CLKGEN                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Clock Generator (CLKGEN)
  */

typedef struct {                                /*!< CLKGEN Structure                                                          */
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t OCTRL;                       /*!< This register includes controls for autocalibration in addition
                                                     to the RTC oscillator controls.                                           */

