AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
            uint32_t            : 7;
      __IOM uint32_t OSEL       : 1;            /*!< Selects the RTC oscillator (1=LFRC, 0=XT)This selection bit
                                                     and clocking the RTC with the external crystal (XT) are
                                                     inoperable in silicon revisions A and B0.                                 */
            uint32_t            : 24;
    } OCTRL_b;
  } ;

  union {
    __IOM uint32_t CLKOUT;                      /*!< This register enables the CLKOUT to the GPIOs, and selects the
                                                     clock source to that.                                                     */

    struct {
      __IOM uint32_t CKSEL      : 6;            /*!< Select the clock signal that will be observed on CLKOUT. For
                                                     the Apollo510 family, the clock frequencies being observed
                                                     are LFRC=900Hz, XT=32KHz, HFRC=48MHz, HFRC2=250MHz.                       */
            uint32_t            : 1;
      __IOM uint32_t CKEN       : 1;            /*!< Enable the CLKOUT signal                                                  */
            uint32_t            : 24;
    } CLKOUT_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t HFADJ;                       /*!< This register controls the HFRC adjustment. The HFRC clock can
                                                     change with temperature and process corners, and this register
                                                     controls the HFRC adjustment logic which reduces the fluctuations
                                                     to the clock.                                                             */

    struct {
      __IOM uint32_t HFADJEN    : 1;            /*!< HFRC adjustment control                                                   */
      __IOM uint32_t HFADJCK    : 3;            /*!< Repeat period for HFRC adjustment                                         */
            uint32_t            : 4;
      __IOM uint32_t HFXTADJ    : 12;           /*!< Target HFRC adjustment value.                                             */
      __IOM uint32_t HFWARMUP   : 1;            /*!< XT warmup period for HFRC adjustment                                      */
      __IOM uint32_t HFADJGAIN  : 3;            /*!< Gain control for HFRC adjustment                                          */
      __IOM uint32_t HFADJMAXDELTA : 5;         /*!< Maximum delta for HF Adjustments. 0=Disabled, 1-31=maximum delta
                                                     step                                                                      */
            uint32_t            : 3;
    } HFADJ_b;
  } ;
  __IM  uint32_t  RESERVED2[3];

  union {
    __IOM uint32_t CLOCKENSTAT;                 /*!< This register provides the enable status to all the peripheral
                                                     clocks.                                                                   */

    struct {
            uint32_t            : 24;
      __IOM uint32_t HFRC2READY : 1;            /*!< HFRC2 clock is ready (goes high approx 5us after HFRC2 is powered
                                                     up)                                                                       */
      __IOM uint32_t PXTALCLKEN : 1;            /*!< At least one peripheral clock relying on XTAL is on                       */
      __IOM uint32_t PHFRCCLKEN : 1;            /*!< At least one peripheral clock relying on HFRC is on                       */
      __IOM uint32_t HFADJEN    : 1;            /*!< HFADJ circuit is enabled                                                  */
      __IOM uint32_t OSEL       : 1;            /*!< RTC uses XT or LFRC                                                       */
      __IOM uint32_t XTALCLKOUTEN : 1;          /*!< XTAL output clock is on                                                   */
      __IOM uint32_t HFRCCLKEN  : 1;            /*!< HFRC oscillator clock is on                                               */
      __IOM uint32_t HFRC2CLKEN : 1;            /*!< HFRC2 oscillator clock is on                                              */
    } CLOCKENSTAT_b;
  } ;

  union {
    __IOM uint32_t CLOCKEN2STAT;                /*!< This is a continuation of the clock enable status.                        */

    struct {
      __IOM uint32_t TRACECLKEN : 1;            /*!< Trace clock is on                                                         */
      __IOM uint32_t ADCCLKEN   : 1;            /*!< ADC clock is on                                                           */
      __IOM uint32_t APBACTIVITYCLKEN : 1;      /*!< APB clock is on in the Activity power domain                              */
      __IOM uint32_t APBAOHCLKEN : 1;           /*!< APB clock is on in the AOH power domain                                   */
      __IOM uint32_t APBAOLCLKEN : 1;           /*!< APB clock is on in the AOL power domain                                   */
      __IOM uint32_t APBAPBCLKEN : 1;           /*!< APB clock is on in the APB power domain                                   */
      __IOM uint32_t APBAUDCLKEN : 1;           /*!< APB clock is on in the AUD power domain                                   */
      __IOM uint32_t APBCRYPTOCLKEN : 1;        /*!< APB clock is on in the Crypto power domain                                */
      __IOM uint32_t APBDISPCLKEN : 1;          /*!< APB clock is on in the DISP power domain                                  */
      __IOM uint32_t APBDISPPHYCLKEN : 1;       /*!< APB clock is on in the DISP PHY power domain                              */
      __IOM uint32_t APBGFXCLKEN : 1;           /*!< APB clock is on in the GFX power domain                                   */
      __IOM uint32_t APBHCPACLKEN : 1;          /*!< APB clock is on in the HCP A power domain                                 */
      __IOM uint32_t APBHCPBCLKEN : 1;          /*!< APB clock is on in the HCP B power domain                                 */
      __IOM uint32_t APBHCPCCLKEN : 1;          /*!< APB clock is on in the HCP C power domain                                 */
      __IOM uint32_t APBIOSCLKEN : 1;           /*!< APB clock is on in the IOS power domain                                   */
      __IOM uint32_t APBMSPI0CLKEN : 1;         /*!< APB clock is on in the MSPI0 power domain                                 */
      __IOM uint32_t APBMSPI1CLKEN : 1;         /*!< APB clock is on in the MSPI1 power domain                                 */
      __IOM uint32_t APBMSPI2CLKEN : 1;         /*!< APB clock is on in the MSPI2 power domain                                 */
      __IOM uint32_t APBMSPI3CLKEN : 1;         /*!< APB clock is on in the MSPI3 power domain                                 */
      __IOM uint32_t APBSDIO0CLKEN : 1;         /*!< APB clock is on in the SDOI0 power domain                                 */
      __IOM uint32_t APBSDIO1CLKEN : 1;         /*!< APB clock is on in the SDIO1 power domain                                 */
      __IOM uint32_t APBUSBCLKEN : 1;           /*!< APB clock is on in the USB power domain                                   */
      __IOM uint32_t AUDADCCLKEN : 1;           /*!< AUD ADC clock is on                                                       */
      __IOM uint32_t DISPCLKEN  : 1;            /*!< DISP clock is on                                                          */
      __IOM uint32_t DPHYPLLCLKEN : 1;          /*!< DPHY PLL clock is on                                                      */
      __IOM uint32_t DSPI2S0CLKEN : 1;          /*!< DISP I2S0 clock is on                                                     */
      __IOM uint32_t DSPI2S0REFCLKEN : 1;       /*!< DISP I2S0 reference clock is on                                           */
      __IOM uint32_t DSPI2S1CLKEN : 1;          /*!< DSP I2S1 clock is on                                                      */
      __IOM uint32_t DSPI2S1REFCLKEN : 1;       /*!< DSP I2S1 reference clock is on                                            */
      __IOM uint32_t DSPPDMCLKEN : 1;           /*!< DSP PDM clock is on                                                       */
      __IOM uint32_t GFXCLKEN   : 1;            /*!< GFX core clock is on                                                      */
      __IOM uint32_t IOM0CLKEN  : 1;            /*!< IOM 0 clock is on                                                         */
    } CLOCKEN2STAT_b;
  } ;

  union {
    __IOM uint32_t CLOCKEN3STAT;                /*!< This is a continuation of the clock enable status.                        */

