AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t HF2ADJEN   : 1;            /*!< HF2ADJ control                                                            */
      __IOM uint32_t HF2ADJFASTSTREN : 1;       /*!< Fast_start_delay control                                                  */
      __IOM uint32_t HF2ADJFASTSTRDLY : 13;     /*!< Fast_start_delay value setting                                            */
      __IOM uint32_t HF2ADJCNTINOFFSET : 14;    /*!< Counter input offset                                                      */
      __IOM uint32_t HF2ADJXTHSMUXSEL : 1;      /*!< Clock select for HF2ADJ: 0=XTHS 1=EXTREF                                  */
      __IOM uint32_t XTHSMUXSEL : 1;            /*!< Clock select for the high speed XTAL/EXTREF mux                           */
            uint32_t            : 1;
    } HF2ADJ0_b;
  } ;

  union {
    __IOM uint32_t HF2ADJ1;                     /*!< This register controls hf2adj trimming enable and trimming offset.        */

    struct {
      __IOM uint32_t HF2ADJTRIMEN : 3;          /*!< HF2ADJ output selection                                                   */
      __IOM uint32_t HF2ADJTRIMOFFSET : 11;     /*!< HF2ADJ trimming offset. (signed number)                                   */
            uint32_t            : 18;
    } HF2ADJ1_b;
  } ;

  union {
    __IOM uint32_t HF2ADJ2;                     /*!< This register controls xtal32m divider ratio and HF2ADJ ration
                                                     setting.                                                                  */

    struct {
      __IOM uint32_t HF2ADJXTALDIVRATIO : 2;    /*!< XTAL32MHz divider ratio for HF2ADJ.                                       */
      __IOM uint32_t HF2ADJRATIO : 29;          /*!< HF2ADJ ratio setting.                                                     */
            uint32_t            : 1;
    } HF2ADJ2_b;
  } ;

  union {
    __IOM uint32_t HF2VAL;                      /*!< This register provides the read back of the HF2TUNE                       */

    struct {
      __IOM uint32_t HF2ADJTRIMOUT : 11;        /*!< HF2ADJ trimming output                                                    */
            uint32_t            : 21;
    } HF2VAL_b;
  } ;
  __IM  uint32_t  RESERVED4[8];

  union {
    __IOM uint32_t LFRCCTRL;                    /*!< LFRC control                                                              */

    struct {
      __IOM uint32_t LFRCOUT    : 1;            /*!< Disable LFRC output                                                       */
      __IOM uint32_t LFRCPWD    : 1;            /*!< Power down LFRC                                                           */
            uint32_t            : 30;
    } LFRCCTRL_b;
  } ;
  __IM  uint32_t  RESERVED5[2];

  union {
    __IOM uint32_t DISPCLKCTRL;                 /*!< Provides ability to select the PLL reference clock, and derivative
                                                     of the display clock                                                      */

    struct {
      __IOM uint32_t PLLCLKSEL  : 4;            /*!< Selection for PLL reference clock.                                        */
      __IOM uint32_t PLLCLKEN   : 1;            /*!< Enable for the PLL clock through clkgen                                   */
      __IOM uint32_t DISPCLKSEL : 3;            /*!< Selection for PLL reference clock.                                        */
      __IOM uint32_t DCCLKEN    : 1;            /*!< Enable for the PLL clock through clkgen                                   */
      __IOM uint32_t DBICLKSEL  : 2;            /*!< selection for DBI_CLK                                                     */
      __IOM uint32_t DBICLKDIV2EN : 1;          /*!< Enable for DBI CLK divider, 0x1: DBICLK/2, 0x0: bypass                    */
            uint32_t            : 20;
    } DISPCLKCTRL_b;
  } ;

  union {
    __IOM uint32_t CLKGENSPARES;                /*!< CLKGEN Spare Regs                                                         */

    struct {
      __IOM uint32_t CLKGENSPARES : 32;         /*!< Placeholer spare registes that can be used as needed for future
                                                     use                                                                       */
    } CLKGENSPARES_b;
  } ;

  union {
    __IOM uint32_t HFRCIDLECOUNTERS;            /*!< Provides SW controlled # idle cycles before powering down HFRC,
                                                     HFRC2., core clock enable(s)                                              */

    struct {
      __IOM uint32_t HFRCPWRDOWNDELAY : 6;      /*!< Idle counter for HFRC POWER DOWN DELAY                                    */
            uint32_t            : 2;
      __IOM uint32_t HFRCCLKREQDELAY : 6;       /*!< Idle counter for HFRC CLK REQ DELAY                                       */
            uint32_t            : 2;
      __IOM uint32_t HFRC2PWRDOWNDELAY : 6;     /*!< Idle counter for HFRC2 POWER DOWN DELAY                                   */
            uint32_t            : 2;
      __IOM uint32_t HFRC2CLKREQDELAY : 6;      /*!< Enable for the PLL clock through clkgen                                   */
            uint32_t            : 1;
      __IOM uint32_t UPDATEENABLE : 1;          /*!< usage : Clear UPDATEENABLE or 1'b0; Update other bits fields
                                                     of this register. Set this register to 1'b1 for HW to update.             */
    } HFRCIDLECOUNTERS_b;
  } ;
  __IM  uint32_t  RESERVED6[32];

  union {
    __IOM uint32_t MSPIIOCLKCTRL;               /*!< Provides ability to select the MSPI clock, and derivative of
                                                     the MSPI clock                                                            */

    struct {
      __IOM uint32_t MSPI0IOCLKEN : 1;          /*!< Enable for the MSPI0 io clock through clkgen                              */
      __IOM uint32_t MSPI0IOCLKSEL : 4;         /*!< selection for MSPI0 io clock                                              */
      __IOM uint32_t MSPI1IOCLKEN : 1;          /*!< Enable for the MSPI1 io clock through clkgen                              */
      __IOM uint32_t MSPI1IOCLKSEL : 4;         /*!< selection for MSPI1 io clock                                              */
      __IOM uint32_t MSPI2IOCLKEN : 1;          /*!< Enable for the MSPI2 io clock through clkgen                              */
      __IOM uint32_t MSPI2IOCLKSEL : 4;         /*!< selection for MSPI2 io clock                                              */
      __IOM uint32_t MSPI3IOCLKEN : 1;          /*!< Enable for the MSPI3 io clock through clkgen                              */
      __IOM uint32_t MSPI3IOCLKSEL : 4;         /*!< selection for MSPI3 io clock                                              */
            uint32_t            : 12;
    } MSPIIOCLKCTRL_b;
  } ;
  __IM  uint32_t  RESERVED7[3];

  union {
    __IOM uint32_t CLKCTRL;                     /*!< Provides ability to select and enable/force the GFX and MCU
                                                     clocks                                                                    */

