AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t GFXCORECLKEN : 1;          /*!< Enable for the GFX CORE clock through clkgen                              */
      __IOM uint32_t GFXCORECLKSEL : 2;         /*!< selection for GFX CORE clock                                              */
      __IOM uint32_t STCLKFORCEON : 1;          /*!< Force the ST clock to be always on                                        */
      __IOM uint32_t PMUCLKFORCEON : 1;         /*!< Force the PMU clock to be always on (unused)                              */
      __IOM uint32_t DBGCLKFORCEON : 1;         /*!< Force the DBG clock to be always on (unused)                              */
      __IOM uint32_t IWICCLKFORCEON : 1;        /*!< Force the IWIC clock to be always on (unused)                             */
      __IOM uint32_t MCUCLKFORCEON : 1;         /*!< Force the MCU clock to be always on (unused)                              */
      __IOM uint32_t DISPCTRLCLKEN : 1;         /*!< Enable the 96MHz display controller clock                                 */
            uint32_t            : 23;
    } CLKCTRL_b;
  } ;
} CLKGEN_Type;                                  /*!< Size = 292 (0x124)                                                        */



/* =========================================================================================================================== */
/* ================                                          CRYPTO                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Embedded security and cryptographic services (CRYPTO)
  */

typedef struct {                                /*!< CRYPTO Structure                                                          */

  union {
    __IOM uint32_t MEMORYMAP0;                  /*!< This register maps the virtual register R0 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP0 : 10;         /*!< Contains the physical address in memory to map the R0 register.           */
            uint32_t            : 21;
    } MEMORYMAP0_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP1;                  /*!< This register maps the virtual register R1 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP1 : 10;         /*!< Contains the physical address in memory to map the R1 register.           */
            uint32_t            : 21;
    } MEMORYMAP1_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP2;                  /*!< This register maps the virtual register R2 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP2 : 10;         /*!< Contains the physical address in memory to map the R2 register.           */
            uint32_t            : 21;
    } MEMORYMAP2_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP3;                  /*!< This register maps the virtual register R3 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP3 : 10;         /*!< Contains the physical address in memory to map the R3 register.           */
            uint32_t            : 21;
    } MEMORYMAP3_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP4;                  /*!< This register maps the virtual register R4 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP4 : 10;         /*!< Contains the physical address in memory to map the R4 register.           */
            uint32_t            : 21;
    } MEMORYMAP4_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP5;                  /*!< This register maps the virtual register R5 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP5 : 10;         /*!< Contains the physical address in memory to map the R5 register.           */
            uint32_t            : 21;
    } MEMORYMAP5_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP6;                  /*!< This register maps the virtual register R6 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP6 : 10;         /*!< Contains the physical address in memory to map the R6 register.           */
            uint32_t            : 21;
    } MEMORYMAP6_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP7;                  /*!< This register maps the virtual register R7 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP7 : 10;         /*!< Contains the physical address in memory to map the R7 register.           */
            uint32_t            : 21;
    } MEMORYMAP7_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP8;                  /*!< This register maps the virtual register R8 to a physical address
                                                     in memory.                                                                */

