AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t RNDSRCSEL  : 2;            /*!< Defines the length of the oscillator ring (= the number of inverters)
                                                     out of four possible selections.                                          */
      __IOM uint32_t SOPSEL     : 1;            /*!< Secure Output Port selection:                                             */
            uint32_t            : 29;
    } TRNGCONFIG_b;
  } ;

  union {
    __IOM uint32_t TRNGVALID;                   /*!< This register indicates that the TRNG data is valid.                      */

    struct {
      __IOM uint32_t EHRVALID   : 1;            /*!< 0x1 indicates that collection of bits in the TRNG is completed,
                                                     and data can be read from the EHR_DATA register.                          */
            uint32_t            : 31;
    } TRNGVALID_b;
  } ;

  union {
    __IOM uint32_t EHRDATA0;                    /*!< This register contains the data collected in the TRNG[31_0].
                                                     Note: can only be set while in debug mode (rng_debug_enable
                                                     input is set).                                                            */

    struct {
      __IOM uint32_t EHRDATA    : 32;           /*!< Contains the data collected in the TRNG[31_0]. Note: can only
                                                     be set while in debug mode (rng_debug_enable input is set).               */
    } EHRDATA0_b;
  } ;

  union {
    __IOM uint32_t EHRDATA1;                    /*!< This register contains the data collected in the TRNG[63_32].
                                                     Note: can only be set while in debug mode (rng_debug_enable
                                                     input is set).                                                            */

    struct {
      __IOM uint32_t EHRDATA    : 32;           /*!< Contains the data collected in the TRNG[63_32]. Note: can only
                                                     be set while in debug mode (rng_debug_enable input is set).               */
    } EHRDATA1_b;
  } ;

  union {
    __IOM uint32_t EHRDATA2;                    /*!< This register contains the data collected in the TRNG[95_64].
                                                     Note: can only be set while in debug mode (rng_debug_enable
                                                     input is set).                                                            */

    struct {
      __IOM uint32_t EHRDATA    : 32;           /*!< Contains the data collected in the TRNG[95_64]. Note: can only
                                                     be set while in debug mode (rng_debug_enable input is set).               */
    } EHRDATA2_b;
  } ;

  union {
    __IOM uint32_t EHRDATA3;                    /*!< This register contains the data collected in the TRNG[127_96].
                                                     Note: can only be set while in debug mode (rng_debug_enable
                                                     input is set).                                                            */

    struct {
      __IOM uint32_t EHRDATA    : 32;           /*!< Contains the data collected in the TRNG[127_96]. Note: can only
                                                     be set while in debug mode (rng_debug_enable input is set).               */
    } EHRDATA3_b;
  } ;

  union {
    __IOM uint32_t EHRDATA4;                    /*!< This register contains the data collected in the TRNG[159_128].
                                                     Note: can only be set while in debug mode (rng_debug_enable
                                                     input is set).                                                            */

    struct {
      __IOM uint32_t EHRDATA    : 32;           /*!< Contains the data collected in the TRNG[159_128]. Note: can
                                                     only be set while in debug mode (rng_debug_enable input
                                                     is set).                                                                  */
    } EHRDATA4_b;
  } ;

  union {
    __IOM uint32_t EHRDATA5;                    /*!< This register contains the data collected in the TRNG[191_160].
                                                     Note: can only be set while in debug mode (rng_debug_enable
                                                     input is set).                                                            */

    struct {
      __IOM uint32_t EHRDATA    : 32;           /*!< Contains the data collected in the TRNG[191_160]. Note: can
                                                     only be set while in debug mode (rng_debug_enable input
                                                     is set).                                                                  */
    } EHRDATA5_b;
  } ;

  union {
    __IOM uint32_t RNDSOURCEENABLE;             /*!< This register holds the enable signal for the random source.              */

    struct {
      __IOM uint32_t RNDSRCEN   : 1;            /*!< Enable signal for the random source.                                      */
            uint32_t            : 31;
    } RNDSOURCEENABLE_b;
  } ;

  union {
    __IOM uint32_t SAMPLECNT1;                  /*!< Counts clocks between sampling of random bit.                             */

    struct {
      __IOM uint32_t SAMPLECNTR1 : 32;          /*!< Sets the number of rng_clk cycles between two consecutive ring
                                                     oscillator samples. Note: If the Von-Neumann is bypassed,
                                                     the minimum value for sample counter must not be less than
                                                     decimal seventeen.                                                        */
    } SAMPLECNT1_b;
  } ;

  union {
    __IOM uint32_t AUTOCORRSTATISTIC;           /*!< Statistics about autocorrelation test activations.                        */

