AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
            uint32_t            : 2;
      __IOM uint32_t DOPAD      : 1;            /*!< Enable Padding generation. must be reset upon completion of
                                                     padding.                                                                  */
            uint32_t            : 29;
    } HASHPADCFG_b;
  } ;

  union {
    __IOM uint32_t HASHCURLEN0;                 /*!< This register holds the length of current hash operation bit
                                                     31:0.                                                                     */

    struct {
      __IOM uint32_t Length     : 32;           /*!< Represent the current length of valid bits where digest need
                                                     to be computed In Bytes.                                                  */
    } HASHCURLEN0_b;
  } ;

  union {
    __IOM uint32_t HASHCURLEN1;                 /*!< This register holds the length of current hash operation bit
                                                     63:32.                                                                    */

    struct {
      __IOM uint32_t Length     : 32;           /*!< Represent the current length of valid bits where digest need
                                                     to be computed In Bytes.                                                  */
    } HASHCURLEN1_b;
  } ;
  __IM  uint32_t  RESERVED24[2];

  union {
    __IOM uint32_t HASHPARAM;                   /*!< HASH_PARAM Register.                                                      */

    struct {
      __IOM uint32_t CW         : 4;            /*!< Indicates the number of concurrent words the hash is using to
                                                     compute signature. 1 - One concurrent w(t). 2 - Two concurrent
                                                     w(t).                                                                     */
      __IOM uint32_t CH         : 4;            /*!< Indicate if Hi adders are present for each Hi value or 1 adder
                                                     is shared for all Hi. 0 - One Hi value is updated at a
                                                     time 1 - All Hi values are updated at the same time.                      */
      __IOM uint32_t DW         : 4;            /*!< Determine the granularity of word size. 0 - 32 bit word data.
                                                     1 - 64 bit word data.                                                     */
      __IOM uint32_t SHA512EXISTS : 1;          /*!< Indicate if SHA-512 is present in the design. By default SHA-1
                                                     and SHA-256 are present. 0 - SHA-1 and SHA-256 are present
                                                     only 1 - SHA-1 and all SHA-2 are present (SHA-256 SHA-512).               */
      __IOM uint32_t PADEXISTS  : 1;            /*!< Indicate if pad block is present in the design. 0 - pad function
                                                     is not supported by hardware. 1 - pad function is supported
                                                     by hardware.                                                              */
      __IOM uint32_t MD5EXISTS  : 1;            /*!< Indicate if MD5 is present in HW                                          */
      __IOM uint32_t HMACEXISTS : 1;            /*!< Indicate if HMAC logic is present in the design                           */
      __IOM uint32_t SHA256EXISTS : 1;          /*!< Indicate if SHA-256 is present in the design                              */
      __IOM uint32_t HASHCOMPAREEXISTS : 1;     /*!< Indicate if COMPARE digest logic is present in the design                 */
      __IOM uint32_t DUMPHASHTODOUTEXISTS : 1;  /*!< Indicate if HASH to dout is present in the design                         */
            uint32_t            : 13;
    } HASHPARAM_b;
  } ;
  __IM  uint32_t  RESERVED25;

  union {
    __IOM uint32_t HASHAESSWRESET;              /*!< Software reset of the AES.                                                */

    struct {
      __IOM uint32_t HASHAESSWRESET : 1;        /*!< Hash receive reset internally.                                            */
            uint32_t            : 31;
    } HASHAESSWRESET_b;
  } ;

  union {
    __IOM uint32_t HASHENDIANESS;               /*!< This register holds the HASH_ENDIANESS configuration.                     */

    struct {
      __IOM uint32_t ENDIAN     : 1;            /*!< The default value is little-endian. The data and generation
                                                     of padding can be swapped to be big-endian.                               */
            uint32_t            : 31;
    } HASHENDIANESS_b;
  } ;
  __IM  uint32_t  RESERVED26[9];

  union {
    __IOM uint32_t AESCLKENABLE;                /*!< This is a special register, affected by internal logic. Test
                                                     result of this register is NA.                                            */

    struct {
      __IOM uint32_t EN         : 1;            /*!< Enable the AES clock.                                                     */
            uint32_t            : 31;
    } AESCLKENABLE_b;
  } ;
  __IM  uint32_t  RESERVED27;

  union {
    __IOM uint32_t HASHCLKENABLE;               /*!< The HASH clock enable register. Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t EN         : 1;            /*!< Enable the hash clock.                                                    */
            uint32_t            : 31;
    } HASHCLKENABLE_b;
  } ;

  union {
    __IOM uint32_t PKACLKENABLE;                /*!< The PKA clock enable register. Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

