AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t PART0      : 8;            /*!< Identification register part number, bits[7:0]                            */
            uint32_t            : 24;
    } PERIPHERALID0_b;
  } ;

  union {
    __IOM uint32_t PERIPHERALID1;               /*!< Peripheral ID 1 (PID1).                                                   */

    struct {
      __IOM uint32_t PART1      : 4;            /*!< Identification register part number, bits[11:8]                           */
      __IOM uint32_t DES0JEP106 : 4;            /*!< for ARM products.                                                         */
            uint32_t            : 24;
    } PERIPHERALID1_b;
  } ;

  union {
    __IOM uint32_t PERIPHERALID2;               /*!< Peripheral ID 2 (PID2).                                                   */

    struct {
      __IOM uint32_t DES1JEP106 : 3;            /*!< for ARM products.                                                         */
      __IOM uint32_t JEDEC      : 1;            /*!< constant 0x1. Indicates that a JEDEC assigned value is used.              */
      __IOM uint32_t REVISION   : 4;            /*!< starts at zero and increments for every new IP release.                   */
            uint32_t            : 24;
    } PERIPHERALID2_b;
  } ;

  union {
    __IOM uint32_t PERIPHERALID3;               /*!< Peripheral ID 3 (PID3).                                                   */

    struct {
      __IOM uint32_t CMOD       : 4;            /*!< Customer Modified, normally zero, but if a partner applies any
                                                     changes themselves, they must change this value.                          */
      __IOM uint32_t REVAND     : 4;            /*!< starts at zero for every Revision, and increments if metal fixes
                                                     are applied between 2 IP releases.                                        */
            uint32_t            : 24;
    } PERIPHERALID3_b;
  } ;

  union {
    __IOM uint32_t COMPONENTID0;                /*!< Component ID0.                                                            */

    struct {
      __IOM uint32_t PRMBL0     : 8;            /*!< constant 0xD                                                              */
            uint32_t            : 24;
    } COMPONENTID0_b;
  } ;

  union {
    __IOM uint32_t COMPONENTID1;                /*!< Component ID1.                                                            */

    struct {
      __IOM uint32_t PRMBL1     : 4;            /*!< constant 0x0                                                              */
      __IOM uint32_t CLASS      : 4;            /*!< component type 0 0xF for Cryptocell                                       */
            uint32_t            : 24;
    } COMPONENTID1_b;
  } ;

  union {
    __IOM uint32_t COMPONENTID2;                /*!< Component ID2.                                                            */

    struct {
      __IOM uint32_t PRMBL2     : 8;            /*!< constant 0x5                                                              */
            uint32_t            : 24;
    } COMPONENTID2_b;
  } ;

  union {
    __IOM uint32_t COMPONENTID3;                /*!< Component ID3.                                                            */

    struct {
      __IOM uint32_t PRMBL3     : 8;            /*!< constant 0xB1                                                             */
            uint32_t            : 24;
    } COMPONENTID3_b;
  } ;
  __IM  uint32_t  RESERVED52[896];

  union {
    __IOM uint32_t HOSTDCUEN0;                  /*!< The DCU [31:0] enable register. Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t HOSTDCUEN0 : 32;           /*!< Debug Control Unit (DCU) Enable bits.                                     */
    } HOSTDCUEN0_b;
  } ;

  union {
    __IOM uint32_t HOSTDCUEN1;                  /*!< The DCU [63:32] enable register. Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t HOSTDCUEN1 : 32;           /*!< Debug Control Unit (DCU) Enable bits.                                     */
    } HOSTDCUEN1_b;
  } ;

  union {
    __IOM uint32_t HOSTDCUEN2;                  /*!< The DCU [95:64] enable register. Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t HOSTDCUEN2 : 32;           /*!< Debug Control Unit (DCU) Enable bits.                                     */
    } HOSTDCUEN2_b;
  } ;

  union {
    __IOM uint32_t HOSTDCUEN3;                  /*!< The DCU [1271:96] enable register. Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t HOSTDCUEN3 : 32;           /*!< Debug Control Unit (DCU) Enable bits.                                     */
    } HOSTDCUEN3_b;
  } ;

  union {
    __IOM uint32_t HOSTDCULOCK0;                /*!< The DCU lock register. Note: This is a special register, affected
                                                     by internal logic. Test result of this register is NA.                    */

