AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t HOSTDCULOCK0 : 32;         /*!< DCU_lock [31:0] register (a dedicated lock register per DCU
                                                     bit).                                                                     */
    } HOSTDCULOCK0_b;
  } ;

  union {
    __IOM uint32_t HOSTDCULOCK1;                /*!< The DCU lock register. Note: This is a special register, affected
                                                     by internal logic. Test result of this register is NA.                    */

    struct {
      __IOM uint32_t HOSTDCULOCK1 : 32;         /*!< DCU_lock [63:32] register (a dedicated lock register per DCU
                                                     bit).                                                                     */
    } HOSTDCULOCK1_b;
  } ;

  union {
    __IOM uint32_t HOSTDCULOCK2;                /*!< The DCU lock register. Note: This is a special register, affected
                                                     by internal logic. Test result of this register is NA.                    */

    struct {
      __IOM uint32_t HOSTDCULOCK2 : 32;         /*!< DCU_lock [95:64] register (a dedicated lock register per DCU
                                                     bit).                                                                     */
    } HOSTDCULOCK2_b;
  } ;

  union {
    __IOM uint32_t HOSTDCULOCK3;                /*!< The DCU lock register. Note: This is a special register, affected
                                                     by internal logic. Test result of this register is NA.                    */

    struct {
      __IOM uint32_t HOSTDCULOCK3 : 32;         /*!< DCU_lock [127:96] register (a dedicated lock register per DCU
                                                     bit).                                                                     */
    } HOSTDCULOCK3_b;
  } ;

  union {
    __IOM uint32_t AOICVDCURESTRICTIONMASK0;    /*!< The DCU lock register.                                                    */

    struct {
      __IOM uint32_t AOICVDCURESTRICTIONMASK0 : 32;/*!< AO_ICV_DCU_RESTRICTION_MASK [31:0] parameter, that will be a
                                                     customer modifiable.                                                      */
    } AOICVDCURESTRICTIONMASK0_b;
  } ;

  union {
    __IOM uint32_t AOICVDCURESTRICTIONMASK1;    /*!< The 'ICV_DCU_restriction_mask' parameter is read by FW during
                                                     the secure debug verification to prevent OEM from setting
                                                     specific DCUs that protect ICV secrets                                    */

    struct {
      __IOM uint32_t AOICVDCURESTRICTIONMASK1 : 32;/*!< AO_ICV_DCU_RESTRICTION_MASK [63:32] parameter, that will be
                                                     a customer modifiable.                                                    */
    } AOICVDCURESTRICTIONMASK1_b;
  } ;

  union {
    __IOM uint32_t AOICVDCURESTRICTIONMASK2;    /*!< The 'ICV_DCU_restriction_mask' parameter is read by FW during
                                                     the secure debug verification to prevent OEM from setting
                                                     specific DCUs that protect ICV secrets                                    */

    struct {
      __IOM uint32_t AOICVDCURESTRICTIONMASK2 : 32;/*!< AO_ICV_DCU_RESTRICTION_MASK [95:64] parameter, that will be
                                                     a customer modifiable.                                                    */
    } AOICVDCURESTRICTIONMASK2_b;
  } ;

  union {
    __IOM uint32_t AOICVDCURESTRICTIONMASK3;    /*!< The 'ICV_DCU_restriction_mask' parameter is read by FW during
                                                     the secure debug verification to prevent OEM from setting
                                                     specific DCUs that protect ICV secrets                                    */

    struct {
      __IOM uint32_t AOICVDCURESTRICTIONMASK3 : 32;/*!< AO_ICV_DCU_RESTRICTION_MASK [127:96] parameter, that will be
                                                     a customer modifiable.                                                    */
    } AOICVDCURESTRICTIONMASK3_b;
  } ;

  union {
    __IOM uint32_t AOCCSECDEBUGRESET;           /*!< The reset-upon-debug indication                                           */

    struct {
      __IOM uint32_t AOCCSECDEBUGRESET : 1;     /*!< For resets Cerberus, and prevents loading the HW keys after
                                                     that reset                                                                */
            uint32_t            : 31;
    } AOCCSECDEBUGRESET_b;
  } ;

  union {
    __IOM uint32_t HOSTAOLOCKBITS;              /*!< These masks will define, per LCS, which DCU bits will be tied
                                                     to zero, even if the Host tries to set them. Note: This
                                                     is a special register, affected by internal logic. Test
                                                     result of this register is NA.                                            */

    struct {
      __IOM uint32_t HOSTFATALERR : 1;          /*!< When the 'FATAL_ERROR' register is asserted - HW keys will not
                                                     be copied from OTP                                                        */
      __IOM uint32_t HOSTKPICVLOCK : 1;         /*!< When this FW controlled register is set, the Kpicv HW key is
                                                     masked (to zero).                                                         */
      __IOM uint32_t HOSTKCEICVLOCK : 1;        /*!< When this FW controlled register is set, the Kceicv HW key is
                                                     masked (to zero).                                                         */
      __IOM uint32_t HOSTKCPLOCK : 1;           /*!< When this FW controlled register is set, the Kcp HW key is masked
                                                     (to zero).                                                                */
      __IOM uint32_t HOSTKCELOCK : 1;           /*!< When this FW controlled register is set, the Kce HW key is masked
                                                     (to zero).                                                                */
      __IOM uint32_t HOSTICVRMALOCK : 1;        /*!< The ICV_RMA_LOCK register is set-once (per POR).                          */
      __IOM uint32_t RESETUPONDEBUGDISABLE : 1; /*!< The RESET_UPON_DEBUG_DISABLE register is set-once (per POR).              */
      __IOM uint32_t HOSTFORCEDFAENABLE : 1;    /*!< When this FW controlled register is set, the AES DFA countermeasures
                                                     are enabled_disabled (regardless of the AES_DFA_IS_ON register
                                                     value).                                                                   */
      __IOM uint32_t HOSTDFAENABLELOCK : 1;     /*!< When this FW control is set, the DFA_ENABLE register cant be
                                                     written until the next POR. The DFA_ENABLE_LOCK register
                                                     is set-once (per POR).                                                    */
            uint32_t            : 23;
    } HOSTAOLOCKBITS_b;
  } ;

  union {
    __IOM uint32_t AOAPBFILTERING;              /*!< This register holds the AO_APB_FILTERING data. Note: This is
                                                     a special register, affected by internal logic. Test result
                                                     of this register is NA.                                                   */

