AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t ONLYSECACCESSALLOW : 1;    /*!< when this FW controlled register is set, the APB slave accepts
                                                     only secure accesses                                                      */
      __IOM uint32_t ONLYSECACCESSALLOWLOCK : 1;/*!< when this FW controlled register is set, the ONLY_SEC_ACCESS_ALLOWED
                                                     register cant be modified (until the next POR).                           */
      __IOM uint32_t ONLYPRIVACCESSALLOW : 1;   /*!< when this FW controlled register is set, the APB slave accepts
                                                     only privileged accesses                                                  */
      __IOM uint32_t ONLYPRIVACCESSALLOWLOCK : 1;/*!< when this FW controlled register is set, the APBC_ONLY_PRIV_ACCESS_ALLOWED
                                                     register cant be modified (until the next POR)                            */
      __IOM uint32_t APBCONLYSECACCESSALLOW : 1;/*!< when this FW controlled register is set, the APB-C slave accepts
                                                     only secure accesses                                                      */
      __IOM uint32_t APBCONLYSECACCESSALLOWLOCK : 1;/*!< when this FW controlled register is set, the APBC_ONLY_SEC_ACCESS_ALLOWED
                                                     register cant be modified (until the next POR).                           */
      __IOM uint32_t APBCONLYPRIVACCESSALLOW : 1;/*!< when this FW controlled register is set, the APB-C slave accepts
                                                     only privileged accesses                                                  */
      __IOM uint32_t APBCONLYPRIVACCESSALLOWLOCK : 1;/*!< when this FW controlled register is set, the APBC_ONLY_PRIV_ACCESS_ALLOWED
                                                     register cant be modified (until the next POR)                            */
      __IOM uint32_t APBCONLYINSTACCESSALLOW : 1;/*!< when this FW controlled register is set, the APB-C slave accepts
                                                     only instruction accesses                                                 */
      __IOM uint32_t APBCONLYINSTACCESSALLOWLOCK : 1;/*!< when this FW controlled register is set, the APBC_ONLY_INST_ACCESS_ALLOWED
                                                     register cant be modified (until the next POR)                            */
            uint32_t            : 22;
    } AOAPBFILTERING_b;
  } ;

  union {
    __IOM uint32_t AOCCGPPC;                    /*!< holds the AO_CC_GPPC value from AONote: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
      __IOM uint32_t AOCCGPPC   : 8;            /*!< The AO_CC_GPPC value                                                      */
            uint32_t            : 24;
    } AOCCGPPC_b;
  } ;

  union {
    __IOM uint32_t HOSTRGFCCSWRST;              /*!< Writing to this register generates a general reset to CryptoCell.
                                                     This reset takes about 4 core clock cycles.Note: This is
                                                     a special register, affected by internal logic. Test result
                                                     of this register is NA.                                                   */

    struct {
      __IOM uint32_t HOSTRGFCCSWRST : 1;        /*!< Writing 1 to this field generates a general reset to CryptoCell.          */
            uint32_t            : 31;
    } HOSTRGFCCSWRST_b;
  } ;
  __IM  uint32_t  RESERVED53[48];

  union {
    __IOM uint32_t AIBFUSEPROGCOMPLETED;        /*!< This register reflects the fuse_aib_prog_completed input, which
                                                     indicates that the fuse programming was completed.Note:
                                                     This is a special register, affected by internal logic.
                                                     Test result of this register is NA.                                       */

    struct {
      __IOM uint32_t AIBFUSEPROGCOMPLETED : 1;  /*!< Indicates if the fuse programming operation has been completed.           */
            uint32_t            : 31;
    } AIBFUSEPROGCOMPLETED_b;
  } ;

  union {
    __IOM uint32_t NVMDEBUGSTATUS;              /*!< AIB debug status register. Note: This is a special register,
                                                     affected by internal logic. Test result of this register
                                                     is NA.                                                                    */

    struct {
            uint32_t            : 1;
      __IOM uint32_t NVMSM      : 3;            /*!< Main nvm fsm                                                              */
            uint32_t            : 28;
    } NVMDEBUGSTATUS_b;
  } ;

  union {
    __IOM uint32_t LCSISVALID;                  /*!< Indicates that the LCS register holds a valid value.Note: This
                                                     is a special register, affected by internal logic. Test
                                                     result of this register is NA.                                            */

    struct {
      __IOM uint32_t LCSISVALIDREG : 1;         /*!< Indicates whether LCS is valid.                                           */
            uint32_t            : 31;
    } LCSISVALID_b;
  } ;

  union {
    __IOM uint32_t NVMISIDLE;                   /*!< Indicates that the LCS register holds a valid value.Note: This
                                                     is a special register, affected by internal logic. Test
                                                     result of this register is NA.                                            */

