AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t OTPADDRWIDTHDEF : 4;       /*!< Holds the OTP_ADDR_WIDTH_DEF value.                                       */
            uint32_t            : 28;
    } OTPADDRWIDTHDEF_b;
  } ;
} CRYPTO_Type;                                  /*!< Size = 7984 (0x1f30)                                                      */



/* =========================================================================================================================== */
/* ================                                            DC                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief Display Controller (DC)
  */

typedef struct {                                /*!< DC Structure                                                              */

  union {
    __IOM uint32_t MODE;                        /*!< General control register that activates the NEMAp|dc400 controller
                                                     and various parameters, sets the timing signals' polarity,
                                                     activates the global look-up table for gamma correction
                                                     and chooses the output display formats to meet LCD color
                                                     specifications.                                                           */

    struct {
      __IOM uint32_t TSTMODEN   : 1;            /*!< When set to 1, test mode is enabled                                       */
      __IOM uint32_t DBLHORSCANEN : 1;          /*!< When set to 1, double horizontal scan is enabled                          */
      __IOM uint32_t RSVD02     : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t YUYVEN     : 1;            /*!< When set to 0, the following output color formats are enabled
                                                     : Byte-3 beat Interface enabled, Byte-4 beat (RGBX) Interface
                                                     enabled, Two phase serial 12-bit enabled, YUYV (16-bit
                                                     mode) enabled, BT.656 enabled, JDI MIP enabled                            */
      __IOM uint32_t RSVD04     : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t DISPFMT    : 4;            /*!< Display data format                                                       */
      __IOM uint32_t COLFMT     : 1;            /*!< Output color format:                                                      */
      __IOM uint32_t RSVD10     : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t DPICLKSET  : 1;            /*!< When set to 1, DPI_PCLK is equal to format_clk                            */
      __IOM uint32_t RGBCFG     : 3;            /*!< RGB format configuration                                                  */
      __IOM uint32_t RSVD15     : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t SNGFRAME   : 1;            /*!< When set to 1, single frame update is enabled                             */
      __IOM uint32_t UNDERRUNEN : 1;            /*!< when set to 1, underrun prevention is enabled for interfaces
                                                     that support this                                                         */
      __IOM uint32_t BLANKFRC   : 1;            /*!< When set to 1, forces output to blank                                     */
      __IOM uint32_t GAMARAMPEN : 1;            /*!< When set to 1, global gamma correction is enabled                         */
      __IOM uint32_t RSVD21     : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t SNGVSYNC   : 1;            /*!< When set to 1, VSYNC for a single cycle per line is enabled               */
      __IOM uint32_t DITHEREN   : 2;            /*!< Defines the dithering mode                                                */
      __IOM uint32_t DEPOL      : 1;            /*!< Defines DE polarity                                                       */
      __IOM uint32_t HSYNCPOL   : 1;            /*!< Defines HSYNC polarity                                                    */
      __IOM uint32_t VSYNCPOL   : 1;            /*!< Defines VSYNC polarity                                                    */
      __IOM uint32_t RSVD029    : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t PRGCUREN   : 1;            /*!< When set to 1, programmable cursor is enabled                             */
      __IOM uint32_t ENABLE     : 1;            /*!< When set to 1, the dc400 controller is activated                          */
    } MODE_b;
  } ;

  union {
    __IOM uint32_t CLKCTRL;                     /*!< Setup proper timing with divisor control bits and specify the
                                                     number of lines to be prefetched before the start of frame.               */

    struct {
      __IOM uint32_t DIVIDEVALUE : 6;           /*!< Value of first clock divider                                              */
      __IOM uint32_t RSVD06     : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t LINENUM    : 6;            /*!< Number of lines to be prefetched before starting the frame through
                                                     DMA. Maximum value is 32                                                  */
      __IOM uint32_t RSVD14     : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t PLL        : 8;            /*!< Select PLL Clock                                                          */
      __IOM uint32_t RSVD024    : 3;            /*!< This field is reserved.                                                   */
      __IOM uint32_t SECCLKDIV  : 5;            /*!< Value of secondary clock divider                                          */
    } CLKCTRL_b;
  } ;

  union {
    __IOM uint32_t BGCOLOR;                     /*!< Specifies the main background color.                                      */

