AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t COCLORDECSTARTX : 16;      /*!< Specify the pixel offset of the starting X dimension of colordec
                                                     in layer0                                                                 */
      __IOM uint32_t COCLORDECSTARTY : 16;      /*!< Specify the pixel offset of the starting Y dimension of colordec
                                                     in layer0                                                                 */
    } LAYER0COLORDECSTARTXY_b;
  } ;
  __IM  uint32_t  RESERVED4[31];

  union {
    __IOM uint32_t CRC;                         /*!< if cyclic redundancy errors occur, they are written in the CRC
                                                     register.                                                                 */

    struct {
      __IOM uint32_t CRCREG     : 32;           /*!< CRC value if CRC error exists                                             */
    } CRC_b;
  } ;
  __IM  uint32_t  RESERVED5[158];

  union {
    __IOM uint32_t GLLUT;                       /*!< R[0]G[0]B[0] thru R[255]G[255]B[255] Global palette, gamma correction
                                                     memory region where x starts at 0 thru 255.Access to all
                                                     256 registers is best accomplished by passing an index
                                                     via a macro. e.g. pseudocode #define DC_L0LUT(n) (*((volatile
                                                     uint32_t*)(&L0LUT + (4*n))))                                              */

    struct {
      __IOM uint32_t GLLUT0GAMRAMPB : 8;        /*!< Gamma ramp blue bits                                                      */
      __IOM uint32_t GLLUT0GAMRAMPG : 8;        /*!< Gamma ramp green bits                                                     */
      __IOM uint32_t GLLUT0GAMRAMPR : 8;        /*!< Gamma ramp red bits                                                       */
      __IOM uint32_t RSVD2408   : 8;            /*!< This field is reserved.                                                   */
    } GLLUT_b;
  } ;
  __IM  uint32_t  RESERVED6[767];

  union {
    __IOM uint32_t L0LUT;                       /*!< A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255]. Layer 0 palette,gamma
                                                     correction memory region where x starts at 0 thru 255.                    */

    struct {
      __IOM uint32_t L0LUT0GAMRAMPB : 8;        /*!< Gamma ramp blue bits                                                      */
      __IOM uint32_t L0LUT0GAMRAMPG : 8;        /*!< Gamma ramp green bits                                                     */
      __IOM uint32_t L0LUT0GAMRAMPR : 8;        /*!< Gamma ramp red bits                                                       */
      __IOM uint32_t L0LUT0GAMRAMPA : 8;        /*!< Gamma ramp alpha bits                                                     */
    } L0LUT_b;
  } ;
  __IM  uint32_t  RESERVED7[255];

  union {
    __IOM uint32_t L1LUT;                       /*!< A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255] Layer 1 palette,gamma
                                                     correction memory region where x starts at 0 thru 255.Access
                                                     to all 256 registers is best accomplished by passing an
                                                     index via a macro. e.g. pseudocode #define DC_L1LUT(n)
                                                     (*((volatile uint32_t*)(&L1LUT + (4*n))))                                 */

    struct {
      __IOM uint32_t L1LUT0GAMRAMPB : 8;        /*!< Gamma ramp blue bits                                                      */
      __IOM uint32_t L1LUT0GAMRAMPG : 8;        /*!< Gamma ramp green bits                                                     */
      __IOM uint32_t L1LUT0GAMRAMPR : 8;        /*!< Gamma ramp red bits                                                       */
      __IOM uint32_t L1LUT0GAMRAMPA : 8;        /*!< Gamma ramp alpha bits                                                     */
    } L1LUT_b;
  } ;
  __IM  uint32_t  RESERVED8[255];

  union {
    __IOM uint32_t L2LUT0;                      /*!< A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255] Layer 2 palette,gamma
                                                     correction memory region where x starts at 0 thru 255.Access
                                                     to all 256 registers is best accomplished by passing an
                                                     index via a macro. e.g. pseudocode #define DC_L2LUT(n)
                                                     (*((volatile uint32_t*)(&L2LUT + (4*n))))                                 */

    struct {
      __IOM uint32_t L2LUT0GAMRAMPB : 8;        /*!< Gamma ramp blue bits                                                      */
      __IOM uint32_t L2LUT0GAMRAMPG : 8;        /*!< Gamma ramp green bits                                                     */
      __IOM uint32_t L2LUT0GAMRAMPR : 8;        /*!< Gamma ramp red bits                                                       */
      __IOM uint32_t L2LUT0GAMRAMPA : 8;        /*!< Gamma ramp alpha bits                                                     */
    } L2LUT0_b;
  } ;
  __IM  uint32_t  RESERVED9[255];

  union {
    __IOM uint32_t L3LUT;                       /*!< A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255] Layer 3 palette,gamma
                                                     correction memory region where x starts at 0 thru 255.Access
                                                     to all 256 registers is best accomplished by passing an
                                                     index via a macro. e.g. pseudocode #define DC_L3LUT(n)
                                                     (*((volatile uint32_t*)(&L3LUT + (4*n))))                                 */

