AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< This field provides the reset (enable) to the DFE.                        */
            uint32_t            : 31;
    } RSTENBDFE_b;
  } ;

  union {
    __IOM uint32_t AFETRIM0;                    /*!< Afe Trim reg0                                                             */

    struct {
      __IOM uint32_t AFETRIM0   : 32;           /*!< Afe Trim reg0.                                                            */
    } AFETRIM0_b;
  } ;

  union {
    __IOM uint32_t AFETRIM1;                    /*!< Afe Trim reg1                                                             */

    struct {
      __IOM uint32_t AFETRIM1   : 32;           /*!< Afe Trim reg1.                                                            */
    } AFETRIM1_b;
  } ;

  union {
    __IOM uint32_t AFETRIM2;                    /*!< Afe Trim reg2                                                             */

    struct {
      __IOM uint32_t AFETRIM2   : 32;           /*!< Afe Trim reg2.                                                            */
    } AFETRIM2_b;
  } ;

  union {
    __IOM uint32_t AFETRIM3;                    /*!< Afe Trim reg3                                                             */

    struct {
      __IOM uint32_t AFETRIM3   : 32;           /*!< Afe Trim reg3.                                                            */
    } AFETRIM3_b;
  } ;
  __IM  uint32_t  RESERVED1[4];

  union {
    __IOM uint32_t ERRORAUTORCOV;               /*!< Errir ayti recivert register                                              */

    struct {
      __IOM uint32_t ECCMULERRCLR : 1;          /*!< if this bit is set to 1, Ecc_mul_err_clr error recovery action
                                                     is taken immediately by DSI TX                                            */
      __IOM uint32_t INVLDDTCLR : 1;            /*!< If this bit is set to 1, Invld_dt_clr error recovery action
                                                     is taken immediately by DSI TX                                            */
      __IOM uint32_t HICONTCLR  : 1;            /*!< If this bit is set to 1, Hi_cont_clr error recover action is
                                                     taken immediately by DSI TX                                               */
      __IOM uint32_t LOCONTCLR  : 1;            /*!< If this bit is set to 1, lo_cont_clr error recovery action is
                                                     taken immediately by DSI TX                                               */
      __IOM uint32_t HSRXTIMEOUTCLR : 1;        /*!< If this bit is set to 1, Hs_rx_timeout_clr error recovery action
                                                     is taken immediately by DSI TX                                            */
      __IOM uint32_t LPRXTIMEOUTCLR : 1;        /*!< If this bit is set to 1, lp_rx_timeout_clr error recovery action
                                                     is taken immediately by DSI TX                                            */
            uint32_t            : 26;
    } ERRORAUTORCOV_b;
  } ;

  union {
    __IOM uint32_t MIPIDIRDPIDIFF;              /*!< Mipi direction DPI difference                                             */

    struct {
      __IOM uint32_t MIPIDIR    : 1;            /*!< This field provides the direction of MIPI bus;                            */
      __IOM uint32_t RSVD       : 14;           /*!< This field is reserved                                                    */
      __IOM uint32_t DPIHIGH    : 1;            /*!< This field provides information to check DPI line time is greater
                                                     or DSI line time is greater                                               */
      __IOM uint32_t DPIDIFF    : 16;           /*!< This field provides the difference in one line time between
                                                     DPI and DSI                                                               */
    } MIPIDIRDPIDIFF_b;
  } ;

  union {
    __IOM uint32_t DATALANEPOLSWAP;             /*!< Data lane polarity swap register                                          */

    struct {
      __IOM uint32_t DATALNPOLSWAP : 4;         /*!< Data lane Polarity sw                                                     */
            uint32_t            : 28;
    } DATALANEPOLSWAP_b;
  } ;
} DSI_Type;                                     /*!< Size = 164 (0xa4)                                                         */



/* =========================================================================================================================== */
/* ================                                           FPIO                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Fast PIO access (FPIO)
  */

typedef struct {                                /*!< FPIO Structure                                                            */

  union {
    __IOM uint32_t RD0;                         /*!< GPIO Input 0 (31-0)                                                       */

    struct {
      __IOM uint32_t RD0        : 32;           /*!< GPIO31-0 Reads pin state - read only. Returns the pad pin state
                                                     for pins 31-0 if the PINCFG's input enable (INPEN) is active
                                                     and RDZERO is inactive.                                                   */
    } RD0_b;
  } ;

  union {
    __IOM uint32_t RD1;                         /*!< GPIO Input 1 (63-32)                                                      */

    struct {
      __IOM uint32_t RD1        : 32;           /*!< GPIO63-32 Reads pin state - read only. Returns the pad pin state
                                                     for pins 63-32 if the PINCFG's input enable (INPEN) is
                                                     active and RDZERO is inactive.                                            */
    } RD1_b;
  } ;

  union {
    __IOM uint32_t RD2;                         /*!< GPIO Input 2 (95-64)                                                      */

