AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL12   : 4;            /*!< Function select for GPIO pin 12                                           */
      __IOM uint32_t INPEN12    : 1;            /*!< Input enable for GPIO 12                                                  */
      __IOM uint32_t RDZERO12   : 1;            /*!< Return 0 for read data on GPIO 12                                         */
      __IOM uint32_t IRPTEN12   : 2;            /*!< Interrupt enable for GPIO 12                                              */
      __IOM uint32_t OUTCFG12   : 2;            /*!< Pin IO mode selection for GPIO pin 12                                     */
      __IOM uint32_t DS12       : 2;            /*!< Drive strength selection for GPIO 12                                      */
      __IOM uint32_t SR12       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG12  : 3;            /*!< Pullup/Pulldown configuration for GPIO 12                                 */
      __IOM uint32_t NCESRC12   : 6;            /*!< IOMSTR/MSPI N Chip Select 12, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL12   : 1;            /*!< Polarity select for NCE for GPIO 12                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN12     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN12     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG12_b;
  } ;

  union {
    __IOM uint32_t PINCFG13;                    /*!< Controls the operation of GPIO pin 13.                                    */

    struct {
      __IOM uint32_t FNCSEL13   : 4;            /*!< Function select for GPIO pin 13                                           */
      __IOM uint32_t INPEN13    : 1;            /*!< Input enable for GPIO 13                                                  */
      __IOM uint32_t RDZERO13   : 1;            /*!< Return 0 for read data on GPIO 13                                         */
      __IOM uint32_t IRPTEN13   : 2;            /*!< Interrupt enable for GPIO 13                                              */
      __IOM uint32_t OUTCFG13   : 2;            /*!< Pin IO mode selection for GPIO pin 13                                     */
      __IOM uint32_t DS13       : 2;            /*!< Drive strength selection for GPIO 13                                      */
      __IOM uint32_t SR13       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG13  : 3;            /*!< Pullup/Pulldown configuration for GPIO 13                                 */
      __IOM uint32_t NCESRC13   : 6;            /*!< IOMSTR/MSPI N Chip Select 13, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL13   : 1;            /*!< Polarity select for NCE for GPIO 13                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN13     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN13     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG13_b;
  } ;

  union {
    __IOM uint32_t PINCFG14;                    /*!< Controls the operation of GPIO pin 14.                                    */

    struct {
      __IOM uint32_t FNCSEL14   : 4;            /*!< Function select for GPIO pin 14                                           */
      __IOM uint32_t INPEN14    : 1;            /*!< Input enable for GPIO 14                                                  */
      __IOM uint32_t RDZERO14   : 1;            /*!< Return 0 for read data on GPIO 14                                         */
      __IOM uint32_t IRPTEN14   : 2;            /*!< Interrupt enable for GPIO 14                                              */
      __IOM uint32_t OUTCFG14   : 2;            /*!< Pin IO mode selection for GPIO pin 14                                     */
      __IOM uint32_t DS14       : 2;            /*!< Drive strength selection for GPIO 14                                      */
      __IOM uint32_t SR14       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG14  : 3;            /*!< Pullup/Pulldown configuration for GPIO 14                                 */
      __IOM uint32_t NCESRC14   : 6;            /*!< IOMSTR/MSPI N Chip Select 14, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL14   : 1;            /*!< Polarity select for NCE for GPIO 14                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN14     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN14     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG14_b;
  } ;

  union {
    __IOM uint32_t PINCFG15;                    /*!< Controls the operation of GPIO pin 15.                                    */

