AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL51   : 4;            /*!< Function select for GPIO pin 51                                           */
      __IOM uint32_t INPEN51    : 1;            /*!< Input enable for GPIO 51                                                  */
      __IOM uint32_t RDZERO51   : 1;            /*!< Return 0 for read data on GPIO 51                                         */
      __IOM uint32_t IRPTEN51   : 2;            /*!< Interrupt enable for GPIO 51                                              */
      __IOM uint32_t OUTCFG51   : 2;            /*!< Pin IO mode selection for GPIO pin 51                                     */
      __IOM uint32_t DS51       : 2;            /*!< Drive strength selection for GPIO 51                                      */
      __IOM uint32_t SR51       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG51  : 3;            /*!< Pullup/Pulldown configuration for GPIO 51                                 */
      __IOM uint32_t NCESRC51   : 6;            /*!< IOMSTR/MSPI N Chip Select 51, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL51   : 1;            /*!< Polarity select for NCE for GPIO 51                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN51     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN51     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG51_b;
  } ;

  union {
    __IOM uint32_t PINCFG52;                    /*!< Controls the operation of GPIO pin 52.                                    */

    struct {
      __IOM uint32_t FNCSEL52   : 4;            /*!< Function select for GPIO pin 52                                           */
      __IOM uint32_t INPEN52    : 1;            /*!< Input enable for GPIO 52                                                  */
      __IOM uint32_t RDZERO52   : 1;            /*!< Return 0 for read data on GPIO 52                                         */
      __IOM uint32_t IRPTEN52   : 2;            /*!< Interrupt enable for GPIO 52                                              */
      __IOM uint32_t OUTCFG52   : 2;            /*!< Pin IO mode selection for GPIO pin 52                                     */
      __IOM uint32_t DS52       : 2;            /*!< Drive strength selection for GPIO 52                                      */
      __IOM uint32_t SR52       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG52  : 3;            /*!< Pullup/Pulldown configuration for GPIO 52                                 */
      __IOM uint32_t NCESRC52   : 6;            /*!< IOMSTR/MSPI N Chip Select 52, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL52   : 1;            /*!< Polarity select for NCE for GPIO 52                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN52     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN52     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG52_b;
  } ;

  union {
    __IOM uint32_t PINCFG53;                    /*!< Controls the operation of GPIO pin 53.                                    */

    struct {
      __IOM uint32_t FNCSEL53   : 4;            /*!< Function select for GPIO pin 53                                           */
      __IOM uint32_t INPEN53    : 1;            /*!< Input enable for GPIO 53                                                  */
      __IOM uint32_t RDZERO53   : 1;            /*!< Return 0 for read data on GPIO 53                                         */
      __IOM uint32_t IRPTEN53   : 2;            /*!< Interrupt enable for GPIO 53                                              */
      __IOM uint32_t OUTCFG53   : 2;            /*!< Pin IO mode selection for GPIO pin 53                                     */
      __IOM uint32_t DS53       : 2;            /*!< Drive strength selection for GPIO 53                                      */
      __IOM uint32_t SR53       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG53  : 3;            /*!< Pullup/Pulldown configuration for GPIO 53                                 */
      __IOM uint32_t NCESRC53   : 6;            /*!< IOMSTR/MSPI N Chip Select 53, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL53   : 1;            /*!< Polarity select for NCE for GPIO 53                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN53     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN53     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG53_b;
  } ;

  union {
    __IOM uint32_t PINCFG54;                    /*!< Controls the operation of GPIO pin 54.                                    */

