AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL54   : 4;            /*!< Function select for GPIO pin 54                                           */
      __IOM uint32_t INPEN54    : 1;            /*!< Input enable for GPIO 54                                                  */
      __IOM uint32_t RDZERO54   : 1;            /*!< Return 0 for read data on GPIO 54                                         */
      __IOM uint32_t IRPTEN54   : 2;            /*!< Interrupt enable for GPIO 54                                              */
      __IOM uint32_t OUTCFG54   : 2;            /*!< Pin IO mode selection for GPIO pin 54                                     */
      __IOM uint32_t DS54       : 2;            /*!< Drive strength selection for GPIO 54                                      */
      __IOM uint32_t SR54       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG54  : 3;            /*!< Pullup/Pulldown configuration for GPIO 54                                 */
      __IOM uint32_t NCESRC54   : 6;            /*!< IOMSTR/MSPI N Chip Select 54, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL54   : 1;            /*!< Polarity select for NCE for GPIO 54                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN54     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN54     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG54_b;
  } ;

  union {
    __IOM uint32_t PINCFG55;                    /*!< Controls the operation of GPIO pin 55.                                    */

    struct {
      __IOM uint32_t FNCSEL55   : 4;            /*!< Function select for GPIO pin 55                                           */
      __IOM uint32_t INPEN55    : 1;            /*!< Input enable for GPIO 55                                                  */
      __IOM uint32_t RDZERO55   : 1;            /*!< Return 0 for read data on GPIO 55                                         */
      __IOM uint32_t IRPTEN55   : 2;            /*!< Interrupt enable for GPIO 55                                              */
      __IOM uint32_t OUTCFG55   : 2;            /*!< Pin IO mode selection for GPIO pin 55                                     */
      __IOM uint32_t DS55       : 2;            /*!< Drive strength selection for GPIO 55                                      */
      __IOM uint32_t SR55       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG55  : 3;            /*!< Pullup/Pulldown configuration for GPIO 55                                 */
      __IOM uint32_t NCESRC55   : 6;            /*!< IOMSTR/MSPI N Chip Select 55, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL55   : 1;            /*!< Polarity select for NCE for GPIO 55                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN55     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN55     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG55_b;
  } ;

  union {
    __IOM uint32_t PINCFG56;                    /*!< Controls the operation of GPIO pin 56.                                    */

    struct {
      __IOM uint32_t FNCSEL56   : 4;            /*!< Function select for GPIO pin 56                                           */
      __IOM uint32_t INPEN56    : 1;            /*!< Input enable for GPIO 56                                                  */
      __IOM uint32_t RDZERO56   : 1;            /*!< Return 0 for read data on GPIO 56                                         */
      __IOM uint32_t IRPTEN56   : 2;            /*!< Interrupt enable for GPIO 56                                              */
      __IOM uint32_t OUTCFG56   : 2;            /*!< Pin IO mode selection for GPIO pin 56                                     */
      __IOM uint32_t DS56       : 2;            /*!< Drive strength selection for GPIO 56                                      */
      __IOM uint32_t SR56       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG56  : 3;            /*!< Pullup/Pulldown configuration for GPIO 56                                 */
      __IOM uint32_t NCESRC56   : 6;            /*!< IOMSTR/MSPI N Chip Select 56, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL56   : 1;            /*!< Polarity select for NCE for GPIO 56                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN56     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN56     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG56_b;
  } ;

  union {
    __IOM uint32_t PINCFG57;                    /*!< Controls the operation of GPIO pin 57.                                    */

