AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL57   : 4;            /*!< Function select for GPIO pin 57                                           */
      __IOM uint32_t INPEN57    : 1;            /*!< Input enable for GPIO 57                                                  */
      __IOM uint32_t RDZERO57   : 1;            /*!< Return 0 for read data on GPIO 57                                         */
      __IOM uint32_t IRPTEN57   : 2;            /*!< Interrupt enable for GPIO 57                                              */
      __IOM uint32_t OUTCFG57   : 2;            /*!< Pin IO mode selection for GPIO pin 57                                     */
      __IOM uint32_t DS57       : 2;            /*!< Drive strength selection for GPIO 57                                      */
      __IOM uint32_t SR57       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG57  : 3;            /*!< Pullup/Pulldown configuration for GPIO 57                                 */
      __IOM uint32_t NCESRC57   : 6;            /*!< IOMSTR/MSPI N Chip Select 57, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL57   : 1;            /*!< Polarity select for NCE for GPIO 57                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN57     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN57     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG57_b;
  } ;

  union {
    __IOM uint32_t PINCFG58;                    /*!< Controls the operation of GPIO pin 58.                                    */

    struct {
      __IOM uint32_t FNCSEL58   : 4;            /*!< Function select for GPIO pin 58                                           */
      __IOM uint32_t INPEN58    : 1;            /*!< Input enable for GPIO 58                                                  */
      __IOM uint32_t RDZERO58   : 1;            /*!< Return 0 for read data on GPIO 58                                         */
      __IOM uint32_t IRPTEN58   : 2;            /*!< Interrupt enable for GPIO 58                                              */
      __IOM uint32_t OUTCFG58   : 2;            /*!< Pin IO mode selection for GPIO pin 58                                     */
      __IOM uint32_t DS58       : 2;            /*!< Drive strength selection for GPIO 58                                      */
      __IOM uint32_t SR58       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG58  : 3;            /*!< Pullup/Pulldown configuration for GPIO 58                                 */
      __IOM uint32_t NCESRC58   : 6;            /*!< IOMSTR/MSPI N Chip Select 58, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL58   : 1;            /*!< Polarity select for NCE for GPIO 58                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN58     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN58     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG58_b;
  } ;

  union {
    __IOM uint32_t PINCFG59;                    /*!< Controls the operation of GPIO pin 59.                                    */

    struct {
      __IOM uint32_t FNCSEL59   : 4;            /*!< Function select for GPIO pin 59                                           */
      __IOM uint32_t INPEN59    : 1;            /*!< Input enable for GPIO 59                                                  */
      __IOM uint32_t RDZERO59   : 1;            /*!< Return 0 for read data on GPIO 59                                         */
      __IOM uint32_t IRPTEN59   : 2;            /*!< Interrupt enable for GPIO 59                                              */
      __IOM uint32_t OUTCFG59   : 2;            /*!< Pin IO mode selection for GPIO pin 59                                     */
      __IOM uint32_t DS59       : 2;            /*!< Drive strength selection for GPIO 59                                      */
      __IOM uint32_t SR59       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG59  : 3;            /*!< Pullup/Pulldown configuration for GPIO 59                                 */
      __IOM uint32_t NCESRC59   : 6;            /*!< IOMSTR/MSPI N Chip Select 59, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL59   : 1;            /*!< Polarity select for NCE for GPIO 59                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN59     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN59     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG59_b;
  } ;

  union {
    __IOM uint32_t PINCFG60;                    /*!< Controls the operation of GPIO pin 60.                                    */

