AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL69   : 4;            /*!< Function select for GPIO pin 69                                           */
      __IOM uint32_t INPEN69    : 1;            /*!< Input enable for GPIO 69                                                  */
      __IOM uint32_t RDZERO69   : 1;            /*!< Return 0 for read data on GPIO 69                                         */
      __IOM uint32_t IRPTEN69   : 2;            /*!< Interrupt enable for GPIO 69                                              */
      __IOM uint32_t OUTCFG69   : 2;            /*!< Pin IO mode selection for GPIO pin 69                                     */
      __IOM uint32_t DS69       : 2;            /*!< Drive strength selection for High Speed GPIO 69                           */
      __IOM uint32_t SR69       : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG69  : 3;            /*!< Pullup/Pulldown configuration for GPIO 69                                 */
      __IOM uint32_t NCESRC69   : 6;            /*!< IOMSTR/MSPI N Chip Select 69, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL69   : 1;            /*!< Polarity select for NCE for GPIO 69                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN69     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN69     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG69_b;
  } ;

  union {
    __IOM uint32_t PINCFG70;                    /*!< Controls the operation of GPIO pin 70.                                    */

    struct {
      __IOM uint32_t FNCSEL70   : 4;            /*!< Function select for GPIO pin 70                                           */
      __IOM uint32_t INPEN70    : 1;            /*!< Input enable for GPIO 70                                                  */
      __IOM uint32_t RDZERO70   : 1;            /*!< Return 0 for read data on GPIO 70                                         */
      __IOM uint32_t IRPTEN70   : 2;            /*!< Interrupt enable for GPIO 70                                              */
      __IOM uint32_t OUTCFG70   : 2;            /*!< Pin IO mode selection for GPIO pin 70                                     */
      __IOM uint32_t DS70       : 2;            /*!< Drive strength selection for High Speed GPIO 70                           */
      __IOM uint32_t SR70       : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG70  : 3;            /*!< Pullup/Pulldown configuration for GPIO 70                                 */
      __IOM uint32_t NCESRC70   : 6;            /*!< IOMSTR/MSPI N Chip Select 70, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL70   : 1;            /*!< Polarity select for NCE for GPIO 70                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN70     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN70     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG70_b;
  } ;

  union {
    __IOM uint32_t PINCFG71;                    /*!< Controls the operation of GPIO pin 71.                                    */

    struct {
      __IOM uint32_t FNCSEL71   : 4;            /*!< Function select for GPIO pin 71                                           */
      __IOM uint32_t INPEN71    : 1;            /*!< Input enable for GPIO 71                                                  */
      __IOM uint32_t RDZERO71   : 1;            /*!< Return 0 for read data on GPIO 71                                         */
      __IOM uint32_t IRPTEN71   : 2;            /*!< Interrupt enable for GPIO 71                                              */
      __IOM uint32_t OUTCFG71   : 2;            /*!< Pin IO mode selection for GPIO pin 71                                     */
      __IOM uint32_t DS71       : 2;            /*!< Drive strength selection for High Speed GPIO 71                           */
      __IOM uint32_t SR71       : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG71  : 3;            /*!< Pullup/Pulldown configuration for GPIO 71                                 */
      __IOM uint32_t NCESRC71   : 6;            /*!< IOMSTR/MSPI N Chip Select 71, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL71   : 1;            /*!< Polarity select for NCE for GPIO 71                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN71     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN71     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG71_b;
  } ;

  union {
    __IOM uint32_t PINCFG72;                    /*!< Controls the operation of GPIO pin 72.                                    */

