AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL78   : 4;            /*!< Function select for GPIO pin 78                                           */
      __IOM uint32_t INPEN78    : 1;            /*!< Input enable for GPIO 78                                                  */
      __IOM uint32_t RDZERO78   : 1;            /*!< Return 0 for read data on GPIO 78                                         */
      __IOM uint32_t IRPTEN78   : 2;            /*!< Interrupt enable for GPIO 78                                              */
      __IOM uint32_t OUTCFG78   : 2;            /*!< Pin IO mode selection for GPIO pin 78                                     */
      __IOM uint32_t DS78       : 2;            /*!< Drive strength selection for GPIO 78                                      */
      __IOM uint32_t SR78       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG78  : 3;            /*!< Pullup/Pulldown configuration for GPIO 78                                 */
      __IOM uint32_t NCESRC78   : 6;            /*!< IOMSTR/MSPI N Chip Select 78, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL78   : 1;            /*!< Polarity select for NCE for GPIO 78                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN78     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN78     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG78_b;
  } ;

  union {
    __IOM uint32_t PINCFG79;                    /*!< Controls the operation of GPIO pin 79.                                    */

    struct {
      __IOM uint32_t FNCSEL79   : 4;            /*!< Function select for GPIO pin 79                                           */
      __IOM uint32_t INPEN79    : 1;            /*!< Input enable for GPIO 79                                                  */
      __IOM uint32_t RDZERO79   : 1;            /*!< Return 0 for read data on GPIO 79                                         */
      __IOM uint32_t IRPTEN79   : 2;            /*!< Interrupt enable for GPIO 79                                              */
      __IOM uint32_t OUTCFG79   : 2;            /*!< Pin IO mode selection for GPIO pin 79                                     */
      __IOM uint32_t DS79       : 2;            /*!< Drive strength selection for GPIO 79                                      */
      __IOM uint32_t SR79       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG79  : 3;            /*!< Pullup/Pulldown configuration for GPIO 79                                 */
      __IOM uint32_t NCESRC79   : 6;            /*!< IOMSTR/MSPI N Chip Select 79, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL79   : 1;            /*!< Polarity select for NCE for GPIO 79                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN79     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN79     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG79_b;
  } ;

  union {
    __IOM uint32_t PINCFG80;                    /*!< Controls the operation of GPIO pin 80.                                    */

    struct {
      __IOM uint32_t FNCSEL80   : 4;            /*!< Function select for GPIO pin 80                                           */
      __IOM uint32_t INPEN80    : 1;            /*!< Input enable for GPIO 80                                                  */
      __IOM uint32_t RDZERO80   : 1;            /*!< Return 0 for read data on GPIO 80                                         */
      __IOM uint32_t IRPTEN80   : 2;            /*!< Interrupt enable for GPIO 80                                              */
      __IOM uint32_t OUTCFG80   : 2;            /*!< Pin IO mode selection for GPIO pin 80                                     */
      __IOM uint32_t DS80       : 2;            /*!< Drive strength selection for GPIO 80                                      */
      __IOM uint32_t SR80       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG80  : 3;            /*!< Pullup/Pulldown configuration for GPIO 80                                 */
      __IOM uint32_t NCESRC80   : 6;            /*!< IOMSTR/MSPI N Chip Select 80, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL80   : 1;            /*!< Polarity select for NCE for GPIO 80                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN80     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN80     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG80_b;
  } ;

  union {
    __IOM uint32_t PINCFG81;                    /*!< Controls the operation of GPIO pin 81.                                    */

