AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL90   : 4;            /*!< Function select for GPIO pin 90                                           */
      __IOM uint32_t INPEN90    : 1;            /*!< Input enable for GPIO 90                                                  */
      __IOM uint32_t RDZERO90   : 1;            /*!< Return 0 for read data on GPIO 90                                         */
      __IOM uint32_t IRPTEN90   : 2;            /*!< Interrupt enable for GPIO 90                                              */
      __IOM uint32_t OUTCFG90   : 2;            /*!< Pin IO mode selection for GPIO pin 90                                     */
      __IOM uint32_t DS90       : 2;            /*!< Drive strength selection for GPIO 90                                      */
      __IOM uint32_t SR90       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG90  : 3;            /*!< Pullup/Pulldown configuration for GPIO 90                                 */
      __IOM uint32_t NCESRC90   : 6;            /*!< IOMSTR/MSPI N Chip Select 90, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL90   : 1;            /*!< Polarity select for NCE for GPIO 90                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN90     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN90     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG90_b;
  } ;

  union {
    __IOM uint32_t PINCFG91;                    /*!< Controls the operation of GPIO pin 91.                                    */

    struct {
      __IOM uint32_t FNCSEL91   : 4;            /*!< Function select for GPIO pin 91                                           */
      __IOM uint32_t INPEN91    : 1;            /*!< Input enable for GPIO 91                                                  */
      __IOM uint32_t RDZERO91   : 1;            /*!< Return 0 for read data on GPIO 91                                         */
      __IOM uint32_t IRPTEN91   : 2;            /*!< Interrupt enable for GPIO 91                                              */
      __IOM uint32_t OUTCFG91   : 2;            /*!< Pin IO mode selection for GPIO pin 91                                     */
      __IOM uint32_t DS91       : 2;            /*!< Drive strength selection for GPIO 91                                      */
      __IOM uint32_t SR91       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG91  : 3;            /*!< Pullup/Pulldown configuration for GPIO 91                                 */
      __IOM uint32_t NCESRC91   : 6;            /*!< IOMSTR/MSPI N Chip Select 91, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL91   : 1;            /*!< Polarity select for NCE for GPIO 91                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN91     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN91     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG91_b;
  } ;

  union {
    __IOM uint32_t PINCFG92;                    /*!< Controls the operation of GPIO pin 92.                                    */

    struct {
      __IOM uint32_t FNCSEL92   : 4;            /*!< Function select for GPIO pin 92                                           */
      __IOM uint32_t INPEN92    : 1;            /*!< Input enable for GPIO 92                                                  */
      __IOM uint32_t RDZERO92   : 1;            /*!< Return 0 for read data on GPIO 92                                         */
      __IOM uint32_t IRPTEN92   : 2;            /*!< Interrupt enable for GPIO 92                                              */
      __IOM uint32_t OUTCFG92   : 2;            /*!< Pin IO mode selection for GPIO pin 92                                     */
      __IOM uint32_t DS92       : 2;            /*!< Drive strength selection for GPIO 92                                      */
      __IOM uint32_t SR92       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG92  : 3;            /*!< Pullup/Pulldown configuration for GPIO 92                                 */
      __IOM uint32_t NCESRC92   : 6;            /*!< IOMSTR/MSPI N Chip Select 92, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL92   : 1;            /*!< Polarity select for NCE for GPIO 92                                       */
            uint32_t            : 3;
      __IOM uint32_t FIEN92     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN92     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG92_b;
  } ;

  union {
    __IOM uint32_t PINCFG93;                    /*!< Controls the operation of GPIO pin 93.                                    */

