AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL102  : 4;            /*!< Function select for GPIO pin 102                                          */
      __IOM uint32_t INPEN102   : 1;            /*!< Input enable for GPIO 102                                                 */
      __IOM uint32_t RDZERO102  : 1;            /*!< Return 0 for read data on GPIO 102                                        */
      __IOM uint32_t IRPTEN102  : 2;            /*!< Interrupt enable for GPIO 102                                             */
      __IOM uint32_t OUTCFG102  : 2;            /*!< Pin IO mode selection for GPIO pin 102                                    */
      __IOM uint32_t DS102      : 2;            /*!< Drive strength selection for GPIO 102                                     */
      __IOM uint32_t SR102      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG102 : 3;            /*!< Pullup/Pulldown configuration for GPIO 102                                */
      __IOM uint32_t NCESRC102  : 6;            /*!< IOMSTR/MSPI N Chip Select 102, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL102  : 1;            /*!< Polarity select for NCE for GPIO 102                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN102    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN102    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG102_b;
  } ;

  union {
    __IOM uint32_t PINCFG103;                   /*!< Controls the operation of GPIO pin 103.                                   */

    struct {
      __IOM uint32_t FNCSEL103  : 4;            /*!< Function select for GPIO pin 103                                          */
      __IOM uint32_t INPEN103   : 1;            /*!< Input enable for GPIO 103                                                 */
      __IOM uint32_t RDZERO103  : 1;            /*!< Return 0 for read data on GPIO 103                                        */
      __IOM uint32_t IRPTEN103  : 2;            /*!< Interrupt enable for GPIO 103                                             */
      __IOM uint32_t OUTCFG103  : 2;            /*!< Pin IO mode selection for GPIO pin 103                                    */
      __IOM uint32_t DS103      : 2;            /*!< Drive strength selection for GPIO 103                                     */
      __IOM uint32_t SR103      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG103 : 3;            /*!< Pullup/Pulldown configuration for GPIO 103                                */
      __IOM uint32_t NCESRC103  : 6;            /*!< IOMSTR/MSPI N Chip Select 103, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL103  : 1;            /*!< Polarity select for NCE for GPIO 103                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN103    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN103    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG103_b;
  } ;

  union {
    __IOM uint32_t PINCFG104;                   /*!< Controls the operation of GPIO pin 104.                                   */

    struct {
      __IOM uint32_t FNCSEL104  : 4;            /*!< Function select for GPIO pin 104                                          */
      __IOM uint32_t INPEN104   : 1;            /*!< Input enable for GPIO 104                                                 */
      __IOM uint32_t RDZERO104  : 1;            /*!< Return 0 for read data on GPIO 104                                        */
      __IOM uint32_t IRPTEN104  : 2;            /*!< Interrupt enable for GPIO 104                                             */
      __IOM uint32_t OUTCFG104  : 2;            /*!< Pin IO mode selection for GPIO pin 104                                    */
      __IOM uint32_t DS104      : 2;            /*!< Drive strength selection for GPIO 104                                     */
      __IOM uint32_t SR104      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG104 : 3;            /*!< Pullup/Pulldown configuration for GPIO 104                                */
      __IOM uint32_t NCESRC104  : 6;            /*!< IOMSTR/MSPI N Chip Select 104, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL104  : 1;            /*!< Polarity select for NCE for GPIO 104                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN104    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN104    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG104_b;
  } ;

  union {
    __IOM uint32_t PINCFG105;                   /*!< Controls the operation of GPIO pin 105.                                   */

