AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL105  : 4;            /*!< Function select for GPIO pin 105                                          */
      __IOM uint32_t INPEN105   : 1;            /*!< Input enable for GPIO 105                                                 */
      __IOM uint32_t RDZERO105  : 1;            /*!< Return 0 for read data on GPIO 105                                        */
      __IOM uint32_t IRPTEN105  : 2;            /*!< Interrupt enable for GPIO 105                                             */
      __IOM uint32_t OUTCFG105  : 2;            /*!< Pin IO mode selection for GPIO pin 105                                    */
      __IOM uint32_t DS105      : 2;            /*!< Drive strength selection for High Speed GPIO 105                          */
      __IOM uint32_t SR105      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG105 : 3;            /*!< Pullup/Pulldown configuration for GPIO 105                                */
      __IOM uint32_t NCESRC105  : 6;            /*!< IOMSTR/MSPI N Chip Select 105, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL105  : 1;            /*!< Polarity select for NCE for GPIO 105                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN105    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN105    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG105_b;
  } ;

  union {
    __IOM uint32_t PINCFG106;                   /*!< Controls the operation of GPIO pin 106.                                   */

    struct {
      __IOM uint32_t FNCSEL106  : 4;            /*!< Function select for GPIO pin 106                                          */
      __IOM uint32_t INPEN106   : 1;            /*!< Input enable for GPIO 106                                                 */
      __IOM uint32_t RDZERO106  : 1;            /*!< Return 0 for read data on GPIO 106                                        */
      __IOM uint32_t IRPTEN106  : 2;            /*!< Interrupt enable for GPIO 106                                             */
      __IOM uint32_t OUTCFG106  : 2;            /*!< Pin IO mode selection for GPIO pin 106                                    */
      __IOM uint32_t DS106      : 2;            /*!< Drive strength selection for High Speed GPIO 106                          */
      __IOM uint32_t SR106      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG106 : 3;            /*!< Pullup/Pulldown configuration for GPIO 106                                */
      __IOM uint32_t NCESRC106  : 6;            /*!< IOMSTR/MSPI N Chip Select 106, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL106  : 1;            /*!< Polarity select for NCE for GPIO 106                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN106    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN106    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG106_b;
  } ;

  union {
    __IOM uint32_t PINCFG107;                   /*!< Controls the operation of GPIO pin 107.                                   */

    struct {
      __IOM uint32_t FNCSEL107  : 4;            /*!< Function select for GPIO pin 107                                          */
      __IOM uint32_t INPEN107   : 1;            /*!< Input enable for GPIO 107                                                 */
      __IOM uint32_t RDZERO107  : 1;            /*!< Return 0 for read data on GPIO 107                                        */
      __IOM uint32_t IRPTEN107  : 2;            /*!< Interrupt enable for GPIO 107                                             */
      __IOM uint32_t OUTCFG107  : 2;            /*!< Pin IO mode selection for GPIO pin 107                                    */
      __IOM uint32_t DS107      : 2;            /*!< Drive strength selection for High Speed GPIO 107                          */
      __IOM uint32_t SR107      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG107 : 3;            /*!< Pullup/Pulldown configuration for GPIO 107                                */
      __IOM uint32_t NCESRC107  : 6;            /*!< IOMSTR/MSPI N Chip Select 107, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL107  : 1;            /*!< Polarity select for NCE for GPIO 107                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN107    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN107    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG107_b;
  } ;

  union {
    __IOM uint32_t PINCFG108;                   /*!< Controls the operation of GPIO pin 108.                                   */

