AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL108  : 4;            /*!< Function select for GPIO pin 108                                          */
      __IOM uint32_t INPEN108   : 1;            /*!< Input enable for GPIO 108                                                 */
      __IOM uint32_t RDZERO108  : 1;            /*!< Return 0 for read data on GPIO 108                                        */
      __IOM uint32_t IRPTEN108  : 2;            /*!< Interrupt enable for GPIO 108                                             */
      __IOM uint32_t OUTCFG108  : 2;            /*!< Pin IO mode selection for GPIO pin 108                                    */
      __IOM uint32_t DS108      : 2;            /*!< Drive strength selection for High Speed GPIO 108                          */
      __IOM uint32_t SR108      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG108 : 3;            /*!< Pullup/Pulldown configuration for GPIO 108                                */
      __IOM uint32_t NCESRC108  : 6;            /*!< IOMSTR/MSPI N Chip Select 108, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL108  : 1;            /*!< Polarity select for NCE for GPIO 108                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN108    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN108    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG108_b;
  } ;

  union {
    __IOM uint32_t PINCFG109;                   /*!< Controls the operation of GPIO pin 109.                                   */

    struct {
      __IOM uint32_t FNCSEL109  : 4;            /*!< Function select for GPIO pin 109                                          */
      __IOM uint32_t INPEN109   : 1;            /*!< Input enable for GPIO 109                                                 */
      __IOM uint32_t RDZERO109  : 1;            /*!< Return 0 for read data on GPIO 109                                        */
      __IOM uint32_t IRPTEN109  : 2;            /*!< Interrupt enable for GPIO 109                                             */
      __IOM uint32_t OUTCFG109  : 2;            /*!< Pin IO mode selection for GPIO pin 109                                    */
      __IOM uint32_t DS109      : 2;            /*!< Drive strength selection for High Speed GPIO 109                          */
      __IOM uint32_t SR109      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG109 : 3;            /*!< Pullup/Pulldown configuration for GPIO 109                                */
      __IOM uint32_t NCESRC109  : 6;            /*!< IOMSTR/MSPI N Chip Select 109, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL109  : 1;            /*!< Polarity select for NCE for GPIO 109                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN109    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN109    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG109_b;
  } ;

  union {
    __IOM uint32_t PINCFG110;                   /*!< Controls the operation of GPIO pin 110.                                   */

    struct {
      __IOM uint32_t FNCSEL110  : 4;            /*!< Function select for GPIO pin 110                                          */
      __IOM uint32_t INPEN110   : 1;            /*!< Input enable for GPIO 110                                                 */
      __IOM uint32_t RDZERO110  : 1;            /*!< Return 0 for read data on GPIO 110                                        */
      __IOM uint32_t IRPTEN110  : 2;            /*!< Interrupt enable for GPIO 110                                             */
      __IOM uint32_t OUTCFG110  : 2;            /*!< Pin IO mode selection for GPIO pin 110                                    */
      __IOM uint32_t DS110      : 2;            /*!< Drive strength selection for High Speed GPIO 110                          */
      __IOM uint32_t SR110      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG110 : 3;            /*!< Pullup/Pulldown configuration for GPIO 110                                */
      __IOM uint32_t NCESRC110  : 6;            /*!< IOMSTR/MSPI N Chip Select 110, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL110  : 1;            /*!< Polarity select for NCE for GPIO 110                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN110    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN110    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG110_b;
  } ;

  union {
    __IOM uint32_t PINCFG111;                   /*!< Controls the operation of GPIO pin 111.                                   */

