AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL114  : 4;            /*!< Function select for GPIO pin 114                                          */
      __IOM uint32_t INPEN114   : 1;            /*!< Input enable for GPIO 114                                                 */
      __IOM uint32_t RDZERO114  : 1;            /*!< Return 0 for read data on GPIO 114                                        */
      __IOM uint32_t IRPTEN114  : 2;            /*!< Interrupt enable for GPIO 114                                             */
      __IOM uint32_t OUTCFG114  : 2;            /*!< Pin IO mode selection for GPIO pin 114                                    */
      __IOM uint32_t DS114      : 2;            /*!< Drive strength selection for GPIO 114                                     */
      __IOM uint32_t SR114      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG114 : 3;            /*!< Pullup/Pulldown configuration for GPIO 114                                */
      __IOM uint32_t NCESRC114  : 6;            /*!< IOMSTR/MSPI N Chip Select 114, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL114  : 1;            /*!< Polarity select for NCE for GPIO 114                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN114    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN114    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG114_b;
  } ;

  union {
    __IOM uint32_t PINCFG115;                   /*!< Controls the operation of GPIO pin 115.                                   */

    struct {
      __IOM uint32_t FNCSEL115  : 4;            /*!< Function select for GPIO pin 115                                          */
      __IOM uint32_t INPEN115   : 1;            /*!< Input enable for GPIO 115                                                 */
      __IOM uint32_t RDZERO115  : 1;            /*!< Return 0 for read data on GPIO 115                                        */
      __IOM uint32_t IRPTEN115  : 2;            /*!< Interrupt enable for GPIO 115                                             */
      __IOM uint32_t OUTCFG115  : 2;            /*!< Pin IO mode selection for GPIO pin 115                                    */
      __IOM uint32_t DS115      : 2;            /*!< Drive strength selection for High Speed GPIO 115                          */
      __IOM uint32_t SR115      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG115 : 3;            /*!< Pullup/Pulldown configuration for GPIO 115                                */
      __IOM uint32_t NCESRC115  : 6;            /*!< IOMSTR/MSPI N Chip Select 115, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL115  : 1;            /*!< Polarity select for NCE for GPIO 115                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN115    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN115    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG115_b;
  } ;

  union {
    __IOM uint32_t PINCFG116;                   /*!< Controls the operation of GPIO pin 116.                                   */

    struct {
      __IOM uint32_t FNCSEL116  : 4;            /*!< Function select for GPIO pin 116                                          */
      __IOM uint32_t INPEN116   : 1;            /*!< Input enable for GPIO 116                                                 */
      __IOM uint32_t RDZERO116  : 1;            /*!< Return 0 for read data on GPIO 116                                        */
      __IOM uint32_t IRPTEN116  : 2;            /*!< Interrupt enable for GPIO 116                                             */
      __IOM uint32_t OUTCFG116  : 2;            /*!< Pin IO mode selection for GPIO pin 116                                    */
      __IOM uint32_t DS116      : 2;            /*!< Drive strength selection for High Speed GPIO 116                          */
      __IOM uint32_t SR116      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG116 : 3;            /*!< Pullup/Pulldown configuration for GPIO 116                                */
      __IOM uint32_t NCESRC116  : 6;            /*!< IOMSTR/MSPI N Chip Select 116, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL116  : 1;            /*!< Polarity select for NCE for GPIO 116                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN116    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN116    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG116_b;
  } ;

  union {
    __IOM uint32_t PINCFG117;                   /*!< Controls the operation of GPIO pin 117.                                   */

