AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL120  : 4;            /*!< Function select for GPIO pin 120                                          */
      __IOM uint32_t INPEN120   : 1;            /*!< Input enable for GPIO 120                                                 */
      __IOM uint32_t RDZERO120  : 1;            /*!< Return 0 for read data on GPIO 120                                        */
      __IOM uint32_t IRPTEN120  : 2;            /*!< Interrupt enable for GPIO 120                                             */
      __IOM uint32_t OUTCFG120  : 2;            /*!< Pin IO mode selection for GPIO pin 120                                    */
      __IOM uint32_t DS120      : 2;            /*!< Drive strength selection for High Speed GPIO 120                          */
      __IOM uint32_t SR120      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG120 : 3;            /*!< Pullup/Pulldown configuration for GPIO 120                                */
      __IOM uint32_t NCESRC120  : 6;            /*!< IOMSTR/MSPI N Chip Select 120, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL120  : 1;            /*!< Polarity select for NCE for GPIO 120                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN120    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN120    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG120_b;
  } ;

  union {
    __IOM uint32_t PINCFG121;                   /*!< Controls the operation of GPIO pin 121.                                   */

    struct {
      __IOM uint32_t FNCSEL121  : 4;            /*!< Function select for GPIO pin 121                                          */
      __IOM uint32_t INPEN121   : 1;            /*!< Input enable for GPIO 121                                                 */
      __IOM uint32_t RDZERO121  : 1;            /*!< Return 0 for read data on GPIO 121                                        */
      __IOM uint32_t IRPTEN121  : 2;            /*!< Interrupt enable for GPIO 121                                             */
      __IOM uint32_t OUTCFG121  : 2;            /*!< Pin IO mode selection for GPIO pin 121                                    */
      __IOM uint32_t DS121      : 2;            /*!< Drive strength selection for High Speed GPIO 121                          */
      __IOM uint32_t SR121      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG121 : 3;            /*!< Pullup/Pulldown configuration for GPIO 121                                */
      __IOM uint32_t NCESRC121  : 6;            /*!< IOMSTR/MSPI N Chip Select 121, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL121  : 1;            /*!< Polarity select for NCE for GPIO 121                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN121    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN121    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG121_b;
  } ;

  union {
    __IOM uint32_t PINCFG122;                   /*!< Controls the operation of GPIO pin 122.                                   */

    struct {
      __IOM uint32_t FNCSEL122  : 4;            /*!< Function select for GPIO pin 122                                          */
      __IOM uint32_t INPEN122   : 1;            /*!< Input enable for GPIO 122                                                 */
      __IOM uint32_t RDZERO122  : 1;            /*!< Return 0 for read data on GPIO 122                                        */
      __IOM uint32_t IRPTEN122  : 2;            /*!< Interrupt enable for GPIO 122                                             */
      __IOM uint32_t OUTCFG122  : 2;            /*!< Pin IO mode selection for GPIO pin 122                                    */
      __IOM uint32_t DS122      : 2;            /*!< Drive strength selection for High Speed GPIO 122                          */
      __IOM uint32_t SR122      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG122 : 3;            /*!< Pullup/Pulldown configuration for GPIO 122                                */
      __IOM uint32_t NCESRC122  : 6;            /*!< IOMSTR/MSPI N Chip Select 122, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL122  : 1;            /*!< Polarity select for NCE for GPIO 122                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN122    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN122    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG122_b;
  } ;

  union {
    __IOM uint32_t PINCFG123;                   /*!< Controls the operation of GPIO pin 123.                                   */

