AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL132  : 4;            /*!< Function select for GPIO pin 132                                          */
      __IOM uint32_t INPEN132   : 1;            /*!< Input enable for GPIO 132                                                 */
      __IOM uint32_t RDZERO132  : 1;            /*!< Return 0 for read data on GPIO 132                                        */
      __IOM uint32_t IRPTEN132  : 2;            /*!< Interrupt enable for GPIO 132                                             */
      __IOM uint32_t OUTCFG132  : 2;            /*!< Pin IO mode selection for GPIO pin 132                                    */
      __IOM uint32_t DS132      : 2;            /*!< Drive strength selection for GPIO 132                                     */
      __IOM uint32_t SR132      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG132 : 3;            /*!< Pullup/Pulldown configuration for GPIO 132                                */
      __IOM uint32_t NCESRC132  : 6;            /*!< IOMSTR/MSPI N Chip Select 132, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL132  : 1;            /*!< Polarity select for NCE for GPIO 132                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN132    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN132    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG132_b;
  } ;

  union {
    __IOM uint32_t PINCFG133;                   /*!< Controls the operation of GPIO pin 133.                                   */

    struct {
      __IOM uint32_t FNCSEL133  : 4;            /*!< Function select for GPIO pin 133                                          */
      __IOM uint32_t INPEN133   : 1;            /*!< Input enable for GPIO 133                                                 */
      __IOM uint32_t RDZERO133  : 1;            /*!< Return 0 for read data on GPIO 133                                        */
      __IOM uint32_t IRPTEN133  : 2;            /*!< Interrupt enable for GPIO 133                                             */
      __IOM uint32_t OUTCFG133  : 2;            /*!< Pin IO mode selection for GPIO pin 133                                    */
      __IOM uint32_t DS133      : 2;            /*!< Drive strength selection for GPIO 133                                     */
      __IOM uint32_t SR133      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG133 : 3;            /*!< Pullup/Pulldown configuration for GPIO 133                                */
      __IOM uint32_t NCESRC133  : 6;            /*!< IOMSTR/MSPI N Chip Select 133, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL133  : 1;            /*!< Polarity select for NCE for GPIO 133                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN133    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN133    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG133_b;
  } ;

  union {
    __IOM uint32_t PINCFG134;                   /*!< Controls the operation of GPIO pin 134.                                   */

    struct {
      __IOM uint32_t FNCSEL134  : 4;            /*!< Function select for GPIO pin 134                                          */
      __IOM uint32_t INPEN134   : 1;            /*!< Input enable for GPIO 134                                                 */
      __IOM uint32_t RDZERO134  : 1;            /*!< Return 0 for read data on GPIO 134                                        */
      __IOM uint32_t IRPTEN134  : 2;            /*!< Interrupt enable for GPIO 134                                             */
      __IOM uint32_t OUTCFG134  : 2;            /*!< Pin IO mode selection for GPIO pin 134                                    */
      __IOM uint32_t DS134      : 2;            /*!< Drive strength selection for GPIO 134                                     */
      __IOM uint32_t SR134      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG134 : 3;            /*!< Pullup/Pulldown configuration for GPIO 134                                */
      __IOM uint32_t NCESRC134  : 6;            /*!< IOMSTR/MSPI N Chip Select 134, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL134  : 1;            /*!< Polarity select for NCE for GPIO 134                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN134    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN134    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG134_b;
  } ;

  union {
    __IOM uint32_t PINCFG135;                   /*!< Controls the operation of GPIO pin 135.                                   */

