AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL144  : 4;            /*!< Function select for GPIO pin 144                                          */
      __IOM uint32_t INPEN144   : 1;            /*!< Input enable for GPIO 144                                                 */
      __IOM uint32_t RDZERO144  : 1;            /*!< Return 0 for read data on GPIO 144                                        */
      __IOM uint32_t IRPTEN144  : 2;            /*!< Interrupt enable for GPIO 144                                             */
      __IOM uint32_t OUTCFG144  : 2;            /*!< Pin IO mode selection for GPIO pin 144                                    */
      __IOM uint32_t DS144      : 2;            /*!< Drive strength selection for High Speed GPIO 144                          */
      __IOM uint32_t SR144      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG144 : 3;            /*!< Pullup/Pulldown configuration for GPIO 144                                */
      __IOM uint32_t NCESRC144  : 6;            /*!< IOMSTR/MSPI N Chip Select 144, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL144  : 1;            /*!< Polarity select for NCE for GPIO 144                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN144    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN144    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG144_b;
  } ;

  union {
    __IOM uint32_t PINCFG145;                   /*!< Controls the operation of GPIO pin 145.                                   */

    struct {
      __IOM uint32_t FNCSEL145  : 4;            /*!< Function select for GPIO pin 145                                          */
      __IOM uint32_t INPEN145   : 1;            /*!< Input enable for GPIO 145                                                 */
      __IOM uint32_t RDZERO145  : 1;            /*!< Return 0 for read data on GPIO 145                                        */
      __IOM uint32_t IRPTEN145  : 2;            /*!< Interrupt enable for GPIO 145                                             */
      __IOM uint32_t OUTCFG145  : 2;            /*!< Pin IO mode selection for GPIO pin 145                                    */
      __IOM uint32_t DS145      : 2;            /*!< Drive strength selection for High Speed GPIO 145                          */
      __IOM uint32_t SR145      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG145 : 3;            /*!< Pullup/Pulldown configuration for GPIO 145                                */
      __IOM uint32_t NCESRC145  : 6;            /*!< IOMSTR/MSPI N Chip Select 145, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL145  : 1;            /*!< Polarity select for NCE for GPIO 145                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN145    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN145    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG145_b;
  } ;

  union {
    __IOM uint32_t PINCFG146;                   /*!< Controls the operation of GPIO pin 146.                                   */

    struct {
      __IOM uint32_t FNCSEL146  : 4;            /*!< Function select for GPIO pin 146                                          */
      __IOM uint32_t INPEN146   : 1;            /*!< Input enable for GPIO 146                                                 */
      __IOM uint32_t RDZERO146  : 1;            /*!< Return 0 for read data on GPIO 146                                        */
      __IOM uint32_t IRPTEN146  : 2;            /*!< Interrupt enable for GPIO 146                                             */
      __IOM uint32_t OUTCFG146  : 2;            /*!< Pin IO mode selection for GPIO pin 146                                    */
      __IOM uint32_t DS146      : 2;            /*!< Drive strength selection for High Speed GPIO 146                          */
      __IOM uint32_t SR146      : 1;            /*!< Configure high or low drive strength                                      */
      __IOM uint32_t PULLCFG146 : 3;            /*!< Pullup/Pulldown configuration for GPIO 146                                */
      __IOM uint32_t NCESRC146  : 6;            /*!< IOMSTR/MSPI N Chip Select 146, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL146  : 1;            /*!< Polarity select for NCE for GPIO 146                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN146    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN146    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG146_b;
  } ;

  union {
    __IOM uint32_t PINCFG147;                   /*!< Controls the operation of GPIO pin 147.                                   */

