AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL147  : 4;            /*!< Function select for GPIO pin 147                                          */
      __IOM uint32_t INPEN147   : 1;            /*!< Input enable for GPIO 147                                                 */
      __IOM uint32_t RDZERO147  : 1;            /*!< Return 0 for read data on GPIO 147                                        */
      __IOM uint32_t IRPTEN147  : 2;            /*!< Interrupt enable for GPIO 147                                             */
      __IOM uint32_t OUTCFG147  : 2;            /*!< Pin IO mode selection for GPIO pin 147                                    */
      __IOM uint32_t DS147      : 2;            /*!< Drive strength selection for GPIO 147                                     */
      __IOM uint32_t SR147      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG147 : 3;            /*!< Pullup/Pulldown configuration for GPIO 147                                */
      __IOM uint32_t NCESRC147  : 6;            /*!< IOMSTR/MSPI N Chip Select 147, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL147  : 1;            /*!< Polarity select for NCE for GPIO 147                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN147    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN147    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG147_b;
  } ;

  union {
    __IOM uint32_t PINCFG148;                   /*!< Controls the operation of GPIO pin 148.                                   */

    struct {
      __IOM uint32_t FNCSEL148  : 4;            /*!< Function select for GPIO pin 148                                          */
      __IOM uint32_t INPEN148   : 1;            /*!< Input enable for GPIO 148                                                 */
      __IOM uint32_t RDZERO148  : 1;            /*!< Return 0 for read data on GPIO 148                                        */
      __IOM uint32_t IRPTEN148  : 2;            /*!< Interrupt enable for GPIO 148                                             */
      __IOM uint32_t OUTCFG148  : 2;            /*!< Pin IO mode selection for GPIO pin 148                                    */
      __IOM uint32_t DS148      : 2;            /*!< Drive strength selection for GPIO 148                                     */
      __IOM uint32_t SR148      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG148 : 3;            /*!< Pullup/Pulldown configuration for GPIO 148                                */
      __IOM uint32_t NCESRC148  : 6;            /*!< IOMSTR/MSPI N Chip Select 148, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL148  : 1;            /*!< Polarity select for NCE for GPIO 148                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN148    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN148    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG148_b;
  } ;

  union {
    __IOM uint32_t PINCFG149;                   /*!< Controls the operation of GPIO pin 149.                                   */

    struct {
      __IOM uint32_t FNCSEL149  : 4;            /*!< Function select for GPIO pin 149                                          */
      __IOM uint32_t INPEN149   : 1;            /*!< Input enable for GPIO 149                                                 */
      __IOM uint32_t RDZERO149  : 1;            /*!< Return 0 for read data on GPIO 149                                        */
      __IOM uint32_t IRPTEN149  : 2;            /*!< Interrupt enable for GPIO 149                                             */
      __IOM uint32_t OUTCFG149  : 2;            /*!< Pin IO mode selection for GPIO pin 149                                    */
      __IOM uint32_t DS149      : 2;            /*!< Drive strength selection for GPIO 149                                     */
      __IOM uint32_t SR149      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG149 : 3;            /*!< Pullup/Pulldown configuration for GPIO 149                                */
      __IOM uint32_t NCESRC149  : 6;            /*!< IOMSTR/MSPI N Chip Select 149, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL149  : 1;            /*!< Polarity select for NCE for GPIO 149                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN149    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN149    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG149_b;
  } ;

  union {
    __IOM uint32_t PINCFG150;                   /*!< Controls the operation of GPIO pin 150.                                   */

