AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL150  : 4;            /*!< Function select for GPIO pin 150                                          */
      __IOM uint32_t INPEN150   : 1;            /*!< Input enable for GPIO 150                                                 */
      __IOM uint32_t RDZERO150  : 1;            /*!< Return 0 for read data on GPIO 150                                        */
      __IOM uint32_t IRPTEN150  : 2;            /*!< Interrupt enable for GPIO 150                                             */
      __IOM uint32_t OUTCFG150  : 2;            /*!< Pin IO mode selection for GPIO pin 150                                    */
      __IOM uint32_t DS150      : 2;            /*!< Drive strength selection for GPIO 150                                     */
      __IOM uint32_t SR150      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG150 : 3;            /*!< Pullup/Pulldown configuration for GPIO 150                                */
      __IOM uint32_t NCESRC150  : 6;            /*!< IOMSTR/MSPI N Chip Select 150, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL150  : 1;            /*!< Polarity select for NCE for GPIO 150                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN150    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN150    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG150_b;
  } ;

  union {
    __IOM uint32_t PINCFG151;                   /*!< Controls the operation of GPIO pin 151.                                   */

    struct {
      __IOM uint32_t FNCSEL151  : 4;            /*!< Function select for GPIO pin 151                                          */
      __IOM uint32_t INPEN151   : 1;            /*!< Input enable for GPIO 151                                                 */
      __IOM uint32_t RDZERO151  : 1;            /*!< Return 0 for read data on GPIO 151                                        */
      __IOM uint32_t IRPTEN151  : 2;            /*!< Interrupt enable for GPIO 151                                             */
      __IOM uint32_t OUTCFG151  : 2;            /*!< Pin IO mode selection for GPIO pin 151                                    */
      __IOM uint32_t DS151      : 2;            /*!< Drive strength selection for GPIO 151                                     */
      __IOM uint32_t SR151      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG151 : 3;            /*!< Pullup/Pulldown configuration for GPIO 151                                */
      __IOM uint32_t NCESRC151  : 6;            /*!< IOMSTR/MSPI N Chip Select 151, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL151  : 1;            /*!< Polarity select for NCE for GPIO 151                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN151    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN151    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG151_b;
  } ;

  union {
    __IOM uint32_t PINCFG152;                   /*!< Controls the operation of GPIO pin 152.                                   */

    struct {
      __IOM uint32_t FNCSEL152  : 4;            /*!< Function select for GPIO pin 152                                          */
      __IOM uint32_t INPEN152   : 1;            /*!< Input enable for GPIO 152                                                 */
      __IOM uint32_t RDZERO152  : 1;            /*!< Return 0 for read data on GPIO 152                                        */
      __IOM uint32_t IRPTEN152  : 2;            /*!< Interrupt enable for GPIO 152                                             */
      __IOM uint32_t OUTCFG152  : 2;            /*!< Pin IO mode selection for GPIO pin 152                                    */
      __IOM uint32_t DS152      : 2;            /*!< Drive strength selection for GPIO 152                                     */
      __IOM uint32_t SR152      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG152 : 3;            /*!< Pullup/Pulldown configuration for GPIO 152                                */
      __IOM uint32_t NCESRC152  : 6;            /*!< IOMSTR/MSPI N Chip Select 152, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL152  : 1;            /*!< Polarity select for NCE for GPIO 152                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN152    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN152    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG152_b;
  } ;

  union {
    __IOM uint32_t PINCFG153;                   /*!< Controls the operation of GPIO pin 153.                                   */

