AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL153  : 4;            /*!< Function select for GPIO pin 153                                          */
      __IOM uint32_t INPEN153   : 1;            /*!< Input enable for GPIO 153                                                 */
      __IOM uint32_t RDZERO153  : 1;            /*!< Return 0 for read data on GPIO 153                                        */
      __IOM uint32_t IRPTEN153  : 2;            /*!< Interrupt enable for GPIO 153                                             */
      __IOM uint32_t OUTCFG153  : 2;            /*!< Pin IO mode selection for GPIO pin 153                                    */
      __IOM uint32_t DS153      : 2;            /*!< Drive strength selection for GPIO 153                                     */
      __IOM uint32_t SR153      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG153 : 3;            /*!< Pullup/Pulldown configuration for GPIO 153                                */
      __IOM uint32_t NCESRC153  : 6;            /*!< IOMSTR/MSPI N Chip Select 153, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL153  : 1;            /*!< Polarity select for NCE for GPIO 153                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN153    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN153    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG153_b;
  } ;

  union {
    __IOM uint32_t PINCFG154;                   /*!< Controls the operation of GPIO pin 154.                                   */

    struct {
      __IOM uint32_t FNCSEL154  : 4;            /*!< Function select for GPIO pin 154                                          */
      __IOM uint32_t INPEN154   : 1;            /*!< Input enable for GPIO 154                                                 */
      __IOM uint32_t RDZERO154  : 1;            /*!< Return 0 for read data on GPIO 154                                        */
      __IOM uint32_t IRPTEN154  : 2;            /*!< Interrupt enable for GPIO 154                                             */
      __IOM uint32_t OUTCFG154  : 2;            /*!< Pin IO mode selection for GPIO pin 154                                    */
      __IOM uint32_t DS154      : 2;            /*!< Drive strength selection for GPIO 154                                     */
      __IOM uint32_t SR154      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG154 : 3;            /*!< Pullup/Pulldown configuration for GPIO 154                                */
      __IOM uint32_t NCESRC154  : 6;            /*!< IOMSTR/MSPI N Chip Select 154, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL154  : 1;            /*!< Polarity select for NCE for GPIO 154                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN154    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN154    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG154_b;
  } ;

  union {
    __IOM uint32_t PINCFG155;                   /*!< Controls the operation of GPIO pin 155.                                   */

    struct {
      __IOM uint32_t FNCSEL155  : 4;            /*!< Function select for GPIO pin 155                                          */
      __IOM uint32_t INPEN155   : 1;            /*!< Input enable for GPIO 155                                                 */
      __IOM uint32_t RDZERO155  : 1;            /*!< Return 0 for read data on GPIO 155                                        */
      __IOM uint32_t IRPTEN155  : 2;            /*!< Interrupt enable for GPIO 155                                             */
      __IOM uint32_t OUTCFG155  : 2;            /*!< Pin IO mode selection for GPIO pin 155                                    */
      __IOM uint32_t DS155      : 2;            /*!< Drive strength selection for GPIO 155                                     */
      __IOM uint32_t SR155      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG155 : 3;            /*!< Pullup/Pulldown configuration for GPIO 155                                */
      __IOM uint32_t NCESRC155  : 6;            /*!< IOMSTR/MSPI N Chip Select 155, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL155  : 1;            /*!< Polarity select for NCE for GPIO 155                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN155    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN155    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG155_b;
  } ;

  union {
    __IOM uint32_t PINCFG156;                   /*!< Controls the operation of GPIO pin 156.                                   */

