AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL162  : 4;            /*!< Function select for GPIO pin 162                                          */
      __IOM uint32_t INPEN162   : 1;            /*!< Input enable for GPIO 162                                                 */
      __IOM uint32_t RDZERO162  : 1;            /*!< Return 0 for read data on GPIO 162                                        */
      __IOM uint32_t IRPTEN162  : 2;            /*!< Interrupt enable for GPIO 162                                             */
      __IOM uint32_t OUTCFG162  : 2;            /*!< Pin IO mode selection for GPIO pin 162                                    */
      __IOM uint32_t DS162      : 2;            /*!< Drive strength selection for GPIO 162                                     */
      __IOM uint32_t SR162      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG162 : 3;            /*!< Pullup/Pulldown configuration for GPIO 162                                */
      __IOM uint32_t NCESRC162  : 6;            /*!< IOMSTR/MSPI N Chip Select 162, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL162  : 1;            /*!< Polarity select for NCE for GPIO 162                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN162    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN162    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG162_b;
  } ;

  union {
    __IOM uint32_t PINCFG163;                   /*!< Controls the operation of GPIO pin 163.                                   */

    struct {
      __IOM uint32_t FNCSEL163  : 4;            /*!< Function select for GPIO pin 163                                          */
      __IOM uint32_t INPEN163   : 1;            /*!< Input enable for GPIO 163                                                 */
      __IOM uint32_t RDZERO163  : 1;            /*!< Return 0 for read data on GPIO 163                                        */
      __IOM uint32_t IRPTEN163  : 2;            /*!< Interrupt enable for GPIO 163                                             */
      __IOM uint32_t OUTCFG163  : 2;            /*!< Pin IO mode selection for GPIO pin 163                                    */
      __IOM uint32_t DS163      : 2;            /*!< Drive strength selection for GPIO 163                                     */
      __IOM uint32_t SR163      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG163 : 3;            /*!< Pullup/Pulldown configuration for GPIO 163                                */
      __IOM uint32_t NCESRC163  : 6;            /*!< IOMSTR/MSPI N Chip Select 163, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL163  : 1;            /*!< Polarity select for NCE for GPIO 163                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN163    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN163    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG163_b;
  } ;

  union {
    __IOM uint32_t PINCFG164;                   /*!< Controls the operation of GPIO pin 164.                                   */

    struct {
      __IOM uint32_t FNCSEL164  : 4;            /*!< Function select for GPIO pin 164                                          */
      __IOM uint32_t INPEN164   : 1;            /*!< Input enable for GPIO 164                                                 */
      __IOM uint32_t RDZERO164  : 1;            /*!< Return 0 for read data on GPIO 164                                        */
      __IOM uint32_t IRPTEN164  : 2;            /*!< Interrupt enable for GPIO 164                                             */
      __IOM uint32_t OUTCFG164  : 2;            /*!< Pin IO mode selection for GPIO pin 164                                    */
      __IOM uint32_t DS164      : 2;            /*!< Drive strength selection for GPIO 164                                     */
      __IOM uint32_t SR164      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG164 : 3;            /*!< Pullup/Pulldown configuration for GPIO 164                                */
      __IOM uint32_t NCESRC164  : 6;            /*!< IOMSTR/MSPI N Chip Select 164, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL164  : 1;            /*!< Polarity select for NCE for GPIO 164                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN164    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN164    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG164_b;
  } ;

  union {
    __IOM uint32_t PINCFG165;                   /*!< Controls the operation of GPIO pin 165.                                   */

