AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL165  : 4;            /*!< Function select for GPIO pin 165                                          */
      __IOM uint32_t INPEN165   : 1;            /*!< Input enable for GPIO 165                                                 */
      __IOM uint32_t RDZERO165  : 1;            /*!< Return 0 for read data on GPIO 165                                        */
      __IOM uint32_t IRPTEN165  : 2;            /*!< Interrupt enable for GPIO 165                                             */
      __IOM uint32_t OUTCFG165  : 2;            /*!< Pin IO mode selection for GPIO pin 165                                    */
      __IOM uint32_t DS165      : 2;            /*!< Drive strength selection for GPIO 165                                     */
      __IOM uint32_t SR165      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG165 : 3;            /*!< Pullup/Pulldown configuration for GPIO 165                                */
      __IOM uint32_t NCESRC165  : 6;            /*!< IOMSTR/MSPI N Chip Select 165, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL165  : 1;            /*!< Polarity select for NCE for GPIO 165                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN165    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN165    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG165_b;
  } ;

  union {
    __IOM uint32_t PINCFG166;                   /*!< Controls the operation of GPIO pin 166.                                   */

    struct {
      __IOM uint32_t FNCSEL166  : 4;            /*!< Function select for GPIO pin 166                                          */
      __IOM uint32_t INPEN166   : 1;            /*!< Input enable for GPIO 166                                                 */
      __IOM uint32_t RDZERO166  : 1;            /*!< Return 0 for read data on GPIO 166                                        */
      __IOM uint32_t IRPTEN166  : 2;            /*!< Interrupt enable for GPIO 166                                             */
      __IOM uint32_t OUTCFG166  : 2;            /*!< Pin IO mode selection for GPIO pin 166                                    */
      __IOM uint32_t DS166      : 2;            /*!< Drive strength selection for GPIO 166                                     */
      __IOM uint32_t SR166      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG166 : 3;            /*!< Pullup/Pulldown configuration for GPIO 166                                */
      __IOM uint32_t NCESRC166  : 6;            /*!< IOMSTR/MSPI N Chip Select 166, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL166  : 1;            /*!< Polarity select for NCE for GPIO 166                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN166    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN166    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG166_b;
  } ;

  union {
    __IOM uint32_t PINCFG167;                   /*!< Controls the operation of GPIO pin 167.                                   */

    struct {
      __IOM uint32_t FNCSEL167  : 4;            /*!< Function select for GPIO pin 167                                          */
      __IOM uint32_t INPEN167   : 1;            /*!< Input enable for GPIO 167                                                 */
      __IOM uint32_t RDZERO167  : 1;            /*!< Return 0 for read data on GPIO 167                                        */
      __IOM uint32_t IRPTEN167  : 2;            /*!< Interrupt enable for GPIO 167                                             */
      __IOM uint32_t OUTCFG167  : 2;            /*!< Pin IO mode selection for GPIO pin 167                                    */
      __IOM uint32_t DS167      : 2;            /*!< Drive strength selection for GPIO 167                                     */
      __IOM uint32_t SR167      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG167 : 3;            /*!< Pullup/Pulldown configuration for GPIO 167                                */
      __IOM uint32_t NCESRC167  : 6;            /*!< IOMSTR/MSPI N Chip Select 167, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL167  : 1;            /*!< Polarity select for NCE for GPIO 167                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN167    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN167    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG167_b;
  } ;

  union {
    __IOM uint32_t PINCFG168;                   /*!< Controls the operation of GPIO pin 168.                                   */

