AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL174  : 4;            /*!< Function select for GPIO pin 174                                          */
      __IOM uint32_t INPEN174   : 1;            /*!< Input enable for GPIO 174                                                 */
      __IOM uint32_t RDZERO174  : 1;            /*!< Return 0 for read data on GPIO 174                                        */
      __IOM uint32_t IRPTEN174  : 2;            /*!< Interrupt enable for GPIO 174                                             */
      __IOM uint32_t OUTCFG174  : 2;            /*!< Pin IO mode selection for GPIO pin 174                                    */
      __IOM uint32_t DS174      : 2;            /*!< Drive strength selection for GPIO 174                                     */
      __IOM uint32_t SR174      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG174 : 3;            /*!< Pullup/Pulldown configuration for GPIO 174                                */
      __IOM uint32_t NCESRC174  : 6;            /*!< IOMSTR/MSPI N Chip Select 174, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL174  : 1;            /*!< Polarity select for NCE for GPIO 174                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN174    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN174    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG174_b;
  } ;

  union {
    __IOM uint32_t PINCFG175;                   /*!< Controls the operation of GPIO pin 175.                                   */

    struct {
      __IOM uint32_t FNCSEL175  : 4;            /*!< Function select for GPIO pin 175                                          */
      __IOM uint32_t INPEN175   : 1;            /*!< Input enable for GPIO 175                                                 */
      __IOM uint32_t RDZERO175  : 1;            /*!< Return 0 for read data on GPIO 175                                        */
      __IOM uint32_t IRPTEN175  : 2;            /*!< Interrupt enable for GPIO 175                                             */
      __IOM uint32_t OUTCFG175  : 2;            /*!< Pin IO mode selection for GPIO pin 175                                    */
      __IOM uint32_t DS175      : 2;            /*!< Drive strength selection for GPIO 175                                     */
      __IOM uint32_t SR175      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG175 : 3;            /*!< Pullup/Pulldown configuration for GPIO 175                                */
      __IOM uint32_t NCESRC175  : 6;            /*!< IOMSTR/MSPI N Chip Select 175, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL175  : 1;            /*!< Polarity select for NCE for GPIO 175                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN175    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN175    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG175_b;
  } ;

  union {
    __IOM uint32_t PINCFG176;                   /*!< Controls the operation of GPIO pin 176.                                   */

    struct {
      __IOM uint32_t FNCSEL176  : 4;            /*!< Function select for GPIO pin 176                                          */
      __IOM uint32_t INPEN176   : 1;            /*!< Input enable for GPIO 176                                                 */
      __IOM uint32_t RDZERO176  : 1;            /*!< Return 0 for read data on GPIO 176                                        */
      __IOM uint32_t IRPTEN176  : 2;            /*!< Interrupt enable for GPIO 176                                             */
      __IOM uint32_t OUTCFG176  : 2;            /*!< Pin IO mode selection for GPIO pin 176                                    */
      __IOM uint32_t DS176      : 2;            /*!< Drive strength selection for GPIO 176                                     */
      __IOM uint32_t SR176      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG176 : 3;            /*!< Pullup/Pulldown configuration for GPIO 176                                */
      __IOM uint32_t NCESRC176  : 6;            /*!< IOMSTR/MSPI N Chip Select 176, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL176  : 1;            /*!< Polarity select for NCE for GPIO 176                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN176    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN176    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG176_b;
  } ;

  union {
    __IOM uint32_t PINCFG177;                   /*!< Controls the operation of GPIO pin 177.                                   */

