AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL177  : 4;            /*!< Function select for GPIO pin 177                                          */
      __IOM uint32_t INPEN177   : 1;            /*!< Input enable for GPIO 177                                                 */
      __IOM uint32_t RDZERO177  : 1;            /*!< Return 0 for read data on GPIO 177                                        */
      __IOM uint32_t IRPTEN177  : 2;            /*!< Interrupt enable for GPIO 177                                             */
      __IOM uint32_t OUTCFG177  : 2;            /*!< Pin IO mode selection for GPIO pin 177                                    */
      __IOM uint32_t DS177      : 2;            /*!< Drive strength selection for GPIO 177                                     */
      __IOM uint32_t SR177      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG177 : 3;            /*!< Pullup/Pulldown configuration for GPIO 177                                */
      __IOM uint32_t NCESRC177  : 6;            /*!< IOMSTR/MSPI N Chip Select 177, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL177  : 1;            /*!< Polarity select for NCE for GPIO 177                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN177    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN177    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG177_b;
  } ;

  union {
    __IOM uint32_t PINCFG178;                   /*!< Controls the operation of GPIO pin 178.                                   */

    struct {
      __IOM uint32_t FNCSEL178  : 4;            /*!< Function select for GPIO pin 178                                          */
      __IOM uint32_t INPEN178   : 1;            /*!< Input enable for GPIO 178                                                 */
      __IOM uint32_t RDZERO178  : 1;            /*!< Return 0 for read data on GPIO 178                                        */
      __IOM uint32_t IRPTEN178  : 2;            /*!< Interrupt enable for GPIO 178                                             */
      __IOM uint32_t OUTCFG178  : 2;            /*!< Pin IO mode selection for GPIO pin 178                                    */
      __IOM uint32_t DS178      : 2;            /*!< Drive strength selection for GPIO 178                                     */
      __IOM uint32_t SR178      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG178 : 3;            /*!< Pullup/Pulldown configuration for GPIO 178                                */
      __IOM uint32_t NCESRC178  : 6;            /*!< IOMSTR/MSPI N Chip Select 178, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL178  : 1;            /*!< Polarity select for NCE for GPIO 178                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN178    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN178    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG178_b;
  } ;

  union {
    __IOM uint32_t PINCFG179;                   /*!< Controls the operation of GPIO pin 179.                                   */

    struct {
      __IOM uint32_t FNCSEL179  : 4;            /*!< Function select for GPIO pin 179                                          */
      __IOM uint32_t INPEN179   : 1;            /*!< Input enable for GPIO 179                                                 */
      __IOM uint32_t RDZERO179  : 1;            /*!< Return 0 for read data on GPIO 179                                        */
      __IOM uint32_t IRPTEN179  : 2;            /*!< Interrupt enable for GPIO 179                                             */
      __IOM uint32_t OUTCFG179  : 2;            /*!< Pin IO mode selection for GPIO pin 179                                    */
      __IOM uint32_t DS179      : 2;            /*!< Drive strength selection for GPIO 179                                     */
      __IOM uint32_t SR179      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG179 : 3;            /*!< Pullup/Pulldown configuration for GPIO 179                                */
      __IOM uint32_t NCESRC179  : 6;            /*!< IOMSTR/MSPI N Chip Select 179, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL179  : 1;            /*!< Polarity select for NCE for GPIO 179                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN179    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN179    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG179_b;
  } ;

  union {
    __IOM uint32_t PINCFG180;                   /*!< Controls the operation of GPIO pin 180.                                   */

