AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL186  : 4;            /*!< Function select for GPIO pin 186                                          */
      __IOM uint32_t INPEN186   : 1;            /*!< Input enable for GPIO 186                                                 */
      __IOM uint32_t RDZERO186  : 1;            /*!< Return 0 for read data on GPIO 186                                        */
      __IOM uint32_t IRPTEN186  : 2;            /*!< Interrupt enable for GPIO 186                                             */
      __IOM uint32_t OUTCFG186  : 2;            /*!< Pin IO mode selection for GPIO pin 186                                    */
      __IOM uint32_t DS186      : 2;            /*!< Drive strength selection for GPIO 186                                     */
      __IOM uint32_t SR186      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG186 : 3;            /*!< Pullup/Pulldown configuration for GPIO 186                                */
      __IOM uint32_t NCESRC186  : 6;            /*!< IOMSTR/MSPI N Chip Select 186, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL186  : 1;            /*!< Polarity select for NCE for GPIO 186                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN186    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN186    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG186_b;
  } ;

  union {
    __IOM uint32_t PINCFG187;                   /*!< Controls the operation of GPIO pin 187.                                   */

    struct {
      __IOM uint32_t FNCSEL187  : 4;            /*!< Function select for GPIO pin 187                                          */
      __IOM uint32_t INPEN187   : 1;            /*!< Input enable for GPIO 187                                                 */
      __IOM uint32_t RDZERO187  : 1;            /*!< Return 0 for read data on GPIO 187                                        */
      __IOM uint32_t IRPTEN187  : 2;            /*!< Interrupt enable for GPIO 187                                             */
      __IOM uint32_t OUTCFG187  : 2;            /*!< Pin IO mode selection for GPIO pin 187                                    */
      __IOM uint32_t DS187      : 2;            /*!< Drive strength selection for GPIO 187                                     */
      __IOM uint32_t SR187      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG187 : 3;            /*!< Pullup/Pulldown configuration for GPIO 187                                */
      __IOM uint32_t NCESRC187  : 6;            /*!< IOMSTR/MSPI N Chip Select 187, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL187  : 1;            /*!< Polarity select for NCE for GPIO 187                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN187    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN187    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG187_b;
  } ;

  union {
    __IOM uint32_t PINCFG188;                   /*!< Controls the operation of GPIO pin 188.                                   */

    struct {
      __IOM uint32_t FNCSEL188  : 4;            /*!< Function select for GPIO pin 188                                          */
      __IOM uint32_t INPEN188   : 1;            /*!< Input enable for GPIO 188                                                 */
      __IOM uint32_t RDZERO188  : 1;            /*!< Return 0 for read data on GPIO 188                                        */
      __IOM uint32_t IRPTEN188  : 2;            /*!< Interrupt enable for GPIO 188                                             */
      __IOM uint32_t OUTCFG188  : 2;            /*!< Pin IO mode selection for GPIO pin 188                                    */
      __IOM uint32_t DS188      : 2;            /*!< Drive strength selection for GPIO 188                                     */
      __IOM uint32_t SR188      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG188 : 3;            /*!< Pullup/Pulldown configuration for GPIO 188                                */
      __IOM uint32_t NCESRC188  : 6;            /*!< IOMSTR/MSPI N Chip Select 188, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL188  : 1;            /*!< Polarity select for NCE for GPIO 188                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN188    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN188    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG188_b;
  } ;

  union {
    __IOM uint32_t PINCFG189;                   /*!< Controls the operation of GPIO pin 189.                                   */

