AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL192  : 4;            /*!< Function select for GPIO pin 192                                          */
      __IOM uint32_t INPEN192   : 1;            /*!< Input enable for GPIO 192                                                 */
      __IOM uint32_t RDZERO192  : 1;            /*!< Return 0 for read data on GPIO 192                                        */
      __IOM uint32_t IRPTEN192  : 2;            /*!< Interrupt enable for GPIO 192                                             */
      __IOM uint32_t OUTCFG192  : 2;            /*!< Pin IO mode selection for GPIO pin 192                                    */
      __IOM uint32_t DS192      : 2;            /*!< Drive strength selection for GPIO 192                                     */
      __IOM uint32_t SR192      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG192 : 3;            /*!< Pullup/Pulldown configuration for GPIO 192                                */
      __IOM uint32_t NCESRC192  : 6;            /*!< IOMSTR/MSPI N Chip Select 192, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL192  : 1;            /*!< Polarity select for NCE for GPIO 192                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN192    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN192    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG192_b;
  } ;

  union {
    __IOM uint32_t PINCFG193;                   /*!< Controls the operation of GPIO pin 193.                                   */

    struct {
      __IOM uint32_t FNCSEL193  : 4;            /*!< Function select for GPIO pin 193                                          */
      __IOM uint32_t INPEN193   : 1;            /*!< Input enable for GPIO 193                                                 */
      __IOM uint32_t RDZERO193  : 1;            /*!< Return 0 for read data on GPIO 193                                        */
      __IOM uint32_t IRPTEN193  : 2;            /*!< Interrupt enable for GPIO 193                                             */
      __IOM uint32_t OUTCFG193  : 2;            /*!< Pin IO mode selection for GPIO pin 193                                    */
      __IOM uint32_t DS193      : 2;            /*!< Drive strength selection for GPIO 193                                     */
      __IOM uint32_t SR193      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG193 : 3;            /*!< Pullup/Pulldown configuration for GPIO 193                                */
      __IOM uint32_t NCESRC193  : 6;            /*!< IOMSTR/MSPI N Chip Select 193, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL193  : 1;            /*!< Polarity select for NCE for GPIO 193                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN193    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN193    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG193_b;
  } ;

  union {
    __IOM uint32_t PINCFG194;                   /*!< Controls the operation of GPIO pin 194.                                   */

    struct {
      __IOM uint32_t FNCSEL194  : 4;            /*!< Function select for GPIO pin 194                                          */
      __IOM uint32_t INPEN194   : 1;            /*!< Input enable for GPIO 194                                                 */
      __IOM uint32_t RDZERO194  : 1;            /*!< Return 0 for read data on GPIO 194                                        */
      __IOM uint32_t IRPTEN194  : 2;            /*!< Interrupt enable for GPIO 194                                             */
      __IOM uint32_t OUTCFG194  : 2;            /*!< Pin IO mode selection for GPIO pin 194                                    */
      __IOM uint32_t DS194      : 2;            /*!< Drive strength selection for GPIO 194                                     */
      __IOM uint32_t SR194      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG194 : 3;            /*!< Pullup/Pulldown configuration for GPIO 194                                */
      __IOM uint32_t NCESRC194  : 6;            /*!< IOMSTR/MSPI N Chip Select 194, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL194  : 1;            /*!< Polarity select for NCE for GPIO 194                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN194    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN194    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG194_b;
  } ;

  union {
    __IOM uint32_t PINCFG195;                   /*!< Controls the operation of GPIO pin 195.                                   */

