AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL204  : 4;            /*!< Function select for GPIO pin 204                                          */
      __IOM uint32_t INPEN204   : 1;            /*!< Input enable for GPIO 204                                                 */
      __IOM uint32_t RDZERO204  : 1;            /*!< Return 0 for read data on GPIO 204                                        */
      __IOM uint32_t IRPTEN204  : 2;            /*!< Interrupt enable for GPIO 204                                             */
      __IOM uint32_t OUTCFG204  : 2;            /*!< Pin IO mode selection for GPIO pin 204                                    */
      __IOM uint32_t DS204      : 2;            /*!< Drive strength selection for GPIO 204                                     */
      __IOM uint32_t SR204      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG204 : 3;            /*!< Pullup/Pulldown configuration for GPIO 204                                */
      __IOM uint32_t NCESRC204  : 6;            /*!< IOMSTR/MSPI N Chip Select 204, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL204  : 1;            /*!< Polarity select for NCE for GPIO 204                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN204    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN204    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG204_b;
  } ;

  union {
    __IOM uint32_t PINCFG205;                   /*!< Controls the operation of GPIO pin 205.                                   */

    struct {
      __IOM uint32_t FNCSEL205  : 4;            /*!< Function select for GPIO pin 205                                          */
      __IOM uint32_t INPEN205   : 1;            /*!< Input enable for GPIO 205                                                 */
      __IOM uint32_t RDZERO205  : 1;            /*!< Return 0 for read data on GPIO 205                                        */
      __IOM uint32_t IRPTEN205  : 2;            /*!< Interrupt enable for GPIO 205                                             */
      __IOM uint32_t OUTCFG205  : 2;            /*!< Pin IO mode selection for GPIO pin 205                                    */
      __IOM uint32_t DS205      : 2;            /*!< Drive strength selection for GPIO 205                                     */
      __IOM uint32_t SR205      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG205 : 3;            /*!< Pullup/Pulldown configuration for GPIO 205                                */
      __IOM uint32_t NCESRC205  : 6;            /*!< IOMSTR/MSPI N Chip Select 205, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL205  : 1;            /*!< Polarity select for NCE for GPIO 205                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN205    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN205    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG205_b;
  } ;

  union {
    __IOM uint32_t PINCFG206;                   /*!< Controls the operation of GPIO pin 206.                                   */

    struct {
      __IOM uint32_t FNCSEL206  : 4;            /*!< Function select for GPIO pin 206                                          */
      __IOM uint32_t INPEN206   : 1;            /*!< Input enable for GPIO 206                                                 */
      __IOM uint32_t RDZERO206  : 1;            /*!< Return 0 for read data on GPIO 206                                        */
      __IOM uint32_t IRPTEN206  : 2;            /*!< Interrupt enable for GPIO 206                                             */
      __IOM uint32_t OUTCFG206  : 2;            /*!< Pin IO mode selection for GPIO pin 206                                    */
      __IOM uint32_t DS206      : 2;            /*!< Drive strength selection for GPIO 206                                     */
      __IOM uint32_t SR206      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG206 : 3;            /*!< Pullup/Pulldown configuration for GPIO 206                                */
      __IOM uint32_t NCESRC206  : 6;            /*!< IOMSTR/MSPI N Chip Select 206, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL206  : 1;            /*!< Polarity select for NCE for GPIO 206                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN206    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN206    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG206_b;
  } ;

  union {
    __IOM uint32_t PINCFG207;                   /*!< Controls the operation of GPIO pin 207.                                   */

