AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL213  : 4;            /*!< Function select for GPIO pin 213                                          */
      __IOM uint32_t INPEN213   : 1;            /*!< Input enable for GPIO 213                                                 */
      __IOM uint32_t RDZERO213  : 1;            /*!< Return 0 for read data on GPIO 213                                        */
      __IOM uint32_t IRPTEN213  : 2;            /*!< Interrupt enable for GPIO 213                                             */
      __IOM uint32_t OUTCFG213  : 2;            /*!< Pin IO mode selection for GPIO pin 213                                    */
      __IOM uint32_t DS213      : 2;            /*!< Drive strength selection for GPIO 213                                     */
      __IOM uint32_t SR213      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG213 : 3;            /*!< Pullup/Pulldown configuration for GPIO 213                                */
      __IOM uint32_t NCESRC213  : 6;            /*!< IOMSTR/MSPI N Chip Select 213, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL213  : 1;            /*!< Polarity select for NCE for GPIO 213                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN213    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN213    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG213_b;
  } ;

  union {
    __IOM uint32_t PINCFG214;                   /*!< Controls the operation of GPIO pin 214.                                   */

    struct {
      __IOM uint32_t FNCSEL214  : 4;            /*!< Function select for GPIO pin 214                                          */
      __IOM uint32_t INPEN214   : 1;            /*!< Input enable for GPIO 214                                                 */
      __IOM uint32_t RDZERO214  : 1;            /*!< Return 0 for read data on GPIO 214                                        */
      __IOM uint32_t IRPTEN214  : 2;            /*!< Interrupt enable for GPIO 214                                             */
      __IOM uint32_t OUTCFG214  : 2;            /*!< Pin IO mode selection for GPIO pin 214                                    */
      __IOM uint32_t DS214      : 2;            /*!< Drive strength selection for GPIO 214                                     */
      __IOM uint32_t SR214      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG214 : 3;            /*!< Pullup/Pulldown configuration for GPIO 214                                */
      __IOM uint32_t NCESRC214  : 6;            /*!< IOMSTR/MSPI N Chip Select 214, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL214  : 1;            /*!< Polarity select for NCE for GPIO 214                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN214    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN214    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG214_b;
  } ;

  union {
    __IOM uint32_t PINCFG215;                   /*!< Controls the operation of GPIO pin 215.                                   */

    struct {
      __IOM uint32_t FNCSEL215  : 4;            /*!< Function select for GPIO pin 215                                          */
      __IOM uint32_t INPEN215   : 1;            /*!< Input enable for GPIO 215                                                 */
      __IOM uint32_t RDZERO215  : 1;            /*!< Return 0 for read data on GPIO 215                                        */
      __IOM uint32_t IRPTEN215  : 2;            /*!< Interrupt enable for GPIO 215                                             */
      __IOM uint32_t OUTCFG215  : 2;            /*!< Pin IO mode selection for GPIO pin 215                                    */
      __IOM uint32_t DS215      : 2;            /*!< Drive strength selection for GPIO 215                                     */
      __IOM uint32_t SR215      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG215 : 3;            /*!< Pullup/Pulldown configuration for GPIO 215                                */
      __IOM uint32_t NCESRC215  : 6;            /*!< IOMSTR/MSPI N Chip Select 215, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL215  : 1;            /*!< Polarity select for NCE for GPIO 215                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN215    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN215    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG215_b;
  } ;

  union {
    __IOM uint32_t PINCFG216;                   /*!< Controls the operation of GPIO pin 216.                                   */

