AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FNCSEL216  : 4;            /*!< Function select for GPIO pin 216                                          */
      __IOM uint32_t INPEN216   : 1;            /*!< Input enable for GPIO 216                                                 */
      __IOM uint32_t RDZERO216  : 1;            /*!< Return 0 for read data on GPIO 216                                        */
      __IOM uint32_t IRPTEN216  : 2;            /*!< Interrupt enable for GPIO 216                                             */
      __IOM uint32_t OUTCFG216  : 2;            /*!< Pin IO mode selection for GPIO pin 216                                    */
      __IOM uint32_t DS216      : 2;            /*!< Drive strength selection for GPIO 216                                     */
      __IOM uint32_t SR216      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG216 : 3;            /*!< Pullup/Pulldown configuration for GPIO 216                                */
      __IOM uint32_t NCESRC216  : 6;            /*!< IOMSTR/MSPI N Chip Select 216, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL216  : 1;            /*!< Polarity select for NCE for GPIO 216                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN216    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN216    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG216_b;
  } ;

  union {
    __IOM uint32_t PINCFG217;                   /*!< Controls the operation of GPIO pin 217.                                   */

    struct {
      __IOM uint32_t FNCSEL217  : 4;            /*!< Function select for GPIO pin 217                                          */
      __IOM uint32_t INPEN217   : 1;            /*!< Input enable for GPIO 217                                                 */
      __IOM uint32_t RDZERO217  : 1;            /*!< Return 0 for read data on GPIO 217                                        */
      __IOM uint32_t IRPTEN217  : 2;            /*!< Interrupt enable for GPIO 217                                             */
      __IOM uint32_t OUTCFG217  : 2;            /*!< Pin IO mode selection for GPIO pin 217                                    */
      __IOM uint32_t DS217      : 2;            /*!< Drive strength selection for GPIO 217                                     */
      __IOM uint32_t SR217      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG217 : 3;            /*!< Pullup/Pulldown configuration for GPIO 217                                */
      __IOM uint32_t NCESRC217  : 6;            /*!< IOMSTR/MSPI N Chip Select 217, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL217  : 1;            /*!< Polarity select for NCE for GPIO 217                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN217    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN217    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG217_b;
  } ;

  union {
    __IOM uint32_t PINCFG218;                   /*!< Controls the operation of GPIO pin 218.                                   */

    struct {
      __IOM uint32_t FNCSEL218  : 4;            /*!< Function select for GPIO pin 218                                          */
      __IOM uint32_t INPEN218   : 1;            /*!< Input enable for GPIO 218                                                 */
      __IOM uint32_t RDZERO218  : 1;            /*!< Return 0 for read data on GPIO 218                                        */
      __IOM uint32_t IRPTEN218  : 2;            /*!< Interrupt enable for GPIO 218                                             */
      __IOM uint32_t OUTCFG218  : 2;            /*!< Pin IO mode selection for GPIO pin 218                                    */
      __IOM uint32_t DS218      : 2;            /*!< Drive strength selection for GPIO 218                                     */
      __IOM uint32_t SR218      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG218 : 3;            /*!< Pullup/Pulldown configuration for GPIO 218                                */
      __IOM uint32_t NCESRC218  : 6;            /*!< IOMSTR/MSPI N Chip Select 218, DISP control signals DE, CSX,
                                                     and CS. Polarity is determined by CE_POLARITY field                       */
      __IOM uint32_t NCEPOL218  : 1;            /*!< Polarity select for NCE for GPIO 218                                      */
            uint32_t            : 3;
      __IOM uint32_t FIEN218    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN218    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG218_b;
  } ;

  union {
    __IOM uint32_t PINCFG219;                   /*!< Controls the operation of GPIO pin 219.                                   */

