AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t EN3        : 32;           /*!< GPIO127-96 Enables tri-state pin output. Writing a 1 to any
                                                     bit enables, and writing a 0 to any bit disables, the output
                                                     for the corresponding GPIO. Reads return output enable/disable
                                                     status of GPIO.                                                           */
    } EN3_b;
  } ;

  union {
    __IOM uint32_t EN4;                         /*!< GPIO Enable 4 (159-128)                                                   */

    struct {
      __IOM uint32_t EN4        : 32;           /*!< GPIO159-128 Enables tri-state pin output. Writing a 1 to any
                                                     bit enables, and writing a 0 to any bit disables, the output
                                                     for the corresponding GPIO. Reads return output enable/disable
                                                     status of GPIO.                                                           */
    } EN4_b;
  } ;

  union {
    __IOM uint32_t EN5;                         /*!< GPIO Enable 5 (191-160)                                                   */

    struct {
      __IOM uint32_t EN5        : 32;           /*!< GPIO191-160 Enables tri-state pin output. Writing a 1 to any
                                                     bit enables, and writing a 0 to any bit disables, the output
                                                     for the corresponding GPIO. Reads return output enable/disable
                                                     status of GPIO.                                                           */
    } EN5_b;
  } ;

  union {
    __IOM uint32_t EN6;                         /*!< GPIO Enable 6 (223-192)                                                   */

    struct {
      __IOM uint32_t EN6        : 32;           /*!< GPIO223-192 Enables tri-state pin output. Writing a 1 to any
                                                     bit enables, and writing a 0 to any bit disables, the output
                                                     for the corresponding GPIO. Reads return output enable/disable
                                                     status of GPIO.                                                           */
    } EN6_b;
  } ;

  union {
    __IOM uint32_t ENS0;                        /*!< GPIO Enable Set 0 (31-0)                                                  */

    struct {
      __IOM uint32_t ENS0       : 32;           /*!< GPIO31-0 Sets pin tri-state output enables. Writing a 1 to any
                                                     bit sets the corresponding bit in the EN register. Writing
                                                     a value of 0 has no effect on the corresponding bit in
                                                     the EN register. Status reads should be made to the EN
                                                     Register.                                                                 */
    } ENS0_b;
  } ;

  union {
    __IOM uint32_t ENS1;                        /*!< GPIO Enable Set 1 (63-32)                                                 */

    struct {
      __IOM uint32_t ENS1       : 32;           /*!< GPIO63-32 Sets pin tri-state output enables. Writing a 1 to
                                                     any bit sets the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENS1_b;
  } ;

  union {
    __IOM uint32_t ENS2;                        /*!< GPIO Enable Set 2 (95-64)                                                 */

    struct {
      __IOM uint32_t ENS2       : 32;           /*!< GPIO95-64 Sets pin tri-state output enables. Writing a 1 to
                                                     any bit sets the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENS2_b;
  } ;

  union {
    __IOM uint32_t ENS3;                        /*!< GPIO Enable Set 3 (127-96)                                                */

    struct {
      __IOM uint32_t ENS3       : 32;           /*!< GPIO127-96 Sets pin tri-state output enables. Writing a 1 to
                                                     any bit sets the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENS3_b;
  } ;

  union {
    __IOM uint32_t ENS4;                        /*!< GPIO Enable Set 4 (159-128)                                               */

    struct {
      __IOM uint32_t ENS4       : 32;           /*!< GPIO159-128 Sets pin tri-state output enables. Writing a 1 to
                                                     any bit sets the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENS4_b;
  } ;

  union {
    __IOM uint32_t ENS5;                        /*!< GPIO Enable Set 5 (191-160)                                               */

