AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t MCUN0GPIO32 : 1;           /*!< GPIO32 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO33 : 1;           /*!< GPIO33 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO34 : 1;           /*!< GPIO34 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO35 : 1;           /*!< GPIO35 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO36 : 1;           /*!< GPIO36 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO37 : 1;           /*!< GPIO37 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO38 : 1;           /*!< GPIO38 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO39 : 1;           /*!< GPIO39 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO40 : 1;           /*!< GPIO40 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO41 : 1;           /*!< GPIO41 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO42 : 1;           /*!< GPIO42 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO43 : 1;           /*!< GPIO43 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO44 : 1;           /*!< GPIO44 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO45 : 1;           /*!< GPIO45 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO46 : 1;           /*!< GPIO46 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO47 : 1;           /*!< GPIO47 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO48 : 1;           /*!< GPIO48 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO49 : 1;           /*!< GPIO49 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO50 : 1;           /*!< GPIO50 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO51 : 1;           /*!< GPIO51 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO52 : 1;           /*!< GPIO52 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO53 : 1;           /*!< GPIO53 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO54 : 1;           /*!< GPIO54 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO55 : 1;           /*!< GPIO55 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO56 : 1;           /*!< GPIO56 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO57 : 1;           /*!< GPIO57 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO58 : 1;           /*!< GPIO58 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO59 : 1;           /*!< GPIO59 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO60 : 1;           /*!< GPIO60 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO61 : 1;           /*!< GPIO61 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO62 : 1;           /*!< GPIO62 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO63 : 1;           /*!< GPIO63 MCU N0-priority interrupt                                          */
    } MCUN0INT1STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT1CLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t MCUN0GPIO32 : 1;           /*!< GPIO32 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO33 : 1;           /*!< GPIO33 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO34 : 1;           /*!< GPIO34 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO35 : 1;           /*!< GPIO35 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO36 : 1;           /*!< GPIO36 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO37 : 1;           /*!< GPIO37 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO38 : 1;           /*!< GPIO38 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO39 : 1;           /*!< GPIO39 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO40 : 1;           /*!< GPIO40 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO41 : 1;           /*!< GPIO41 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO42 : 1;           /*!< GPIO42 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO43 : 1;           /*!< GPIO43 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO44 : 1;           /*!< GPIO44 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO45 : 1;           /*!< GPIO45 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO46 : 1;           /*!< GPIO46 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO47 : 1;           /*!< GPIO47 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO48 : 1;           /*!< GPIO48 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO49 : 1;           /*!< GPIO49 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO50 : 1;           /*!< GPIO50 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO51 : 1;           /*!< GPIO51 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO52 : 1;           /*!< GPIO52 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO53 : 1;           /*!< GPIO53 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO54 : 1;           /*!< GPIO54 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO55 : 1;           /*!< GPIO55 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO56 : 1;           /*!< GPIO56 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO57 : 1;           /*!< GPIO57 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO58 : 1;           /*!< GPIO58 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO59 : 1;           /*!< GPIO59 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO60 : 1;           /*!< GPIO60 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO61 : 1;           /*!< GPIO61 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO62 : 1;           /*!< GPIO62 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO63 : 1;           /*!< GPIO63 MCU N0-priority interrupt                                          */
    } MCUN0INT1CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT1SET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

