AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t MCUN0GPIO32 : 1;           /*!< GPIO32 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO33 : 1;           /*!< GPIO33 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO34 : 1;           /*!< GPIO34 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO35 : 1;           /*!< GPIO35 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO36 : 1;           /*!< GPIO36 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO37 : 1;           /*!< GPIO37 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO38 : 1;           /*!< GPIO38 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO39 : 1;           /*!< GPIO39 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO40 : 1;           /*!< GPIO40 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO41 : 1;           /*!< GPIO41 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO42 : 1;           /*!< GPIO42 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO43 : 1;           /*!< GPIO43 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO44 : 1;           /*!< GPIO44 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO45 : 1;           /*!< GPIO45 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO46 : 1;           /*!< GPIO46 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO47 : 1;           /*!< GPIO47 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO48 : 1;           /*!< GPIO48 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO49 : 1;           /*!< GPIO49 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO50 : 1;           /*!< GPIO50 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO51 : 1;           /*!< GPIO51 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO52 : 1;           /*!< GPIO52 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO53 : 1;           /*!< GPIO53 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO54 : 1;           /*!< GPIO54 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO55 : 1;           /*!< GPIO55 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO56 : 1;           /*!< GPIO56 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO57 : 1;           /*!< GPIO57 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO58 : 1;           /*!< GPIO58 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO59 : 1;           /*!< GPIO59 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO60 : 1;           /*!< GPIO60 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO61 : 1;           /*!< GPIO61 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO62 : 1;           /*!< GPIO62 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO63 : 1;           /*!< GPIO63 MCU N0-priority interrupt                                          */
    } MCUN0INT1SET_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT2EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN0GPIO64 : 1;           /*!< GPIO64 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO65 : 1;           /*!< GPIO65 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO66 : 1;           /*!< GPIO66 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO67 : 1;           /*!< GPIO67 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO68 : 1;           /*!< GPIO68 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO69 : 1;           /*!< GPIO69 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO70 : 1;           /*!< GPIO70 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO71 : 1;           /*!< GPIO71 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO72 : 1;           /*!< GPIO72 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO73 : 1;           /*!< GPIO73 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO74 : 1;           /*!< GPIO74 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO75 : 1;           /*!< GPIO75 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO76 : 1;           /*!< GPIO76 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO77 : 1;           /*!< GPIO77 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO78 : 1;           /*!< GPIO78 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO79 : 1;           /*!< GPIO79 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO80 : 1;           /*!< GPIO80 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO81 : 1;           /*!< GPIO81 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO82 : 1;           /*!< GPIO82 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO83 : 1;           /*!< GPIO83 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO84 : 1;           /*!< GPIO84 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO85 : 1;           /*!< GPIO85 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO86 : 1;           /*!< GPIO86 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO87 : 1;           /*!< GPIO87 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO88 : 1;           /*!< GPIO88 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO89 : 1;           /*!< GPIO89 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO90 : 1;           /*!< GPIO90 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO91 : 1;           /*!< GPIO91 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO92 : 1;           /*!< GPIO92 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO93 : 1;           /*!< GPIO93 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO94 : 1;           /*!< GPIO94 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO95 : 1;           /*!< GPIO95 MCU N0-priority interrupt                                          */
    } MCUN0INT2EN_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT2STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

