AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t MCUN0GPIO64 : 1;           /*!< GPIO64 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO65 : 1;           /*!< GPIO65 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO66 : 1;           /*!< GPIO66 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO67 : 1;           /*!< GPIO67 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO68 : 1;           /*!< GPIO68 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO69 : 1;           /*!< GPIO69 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO70 : 1;           /*!< GPIO70 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO71 : 1;           /*!< GPIO71 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO72 : 1;           /*!< GPIO72 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO73 : 1;           /*!< GPIO73 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO74 : 1;           /*!< GPIO74 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO75 : 1;           /*!< GPIO75 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO76 : 1;           /*!< GPIO76 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO77 : 1;           /*!< GPIO77 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO78 : 1;           /*!< GPIO78 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO79 : 1;           /*!< GPIO79 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO80 : 1;           /*!< GPIO80 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO81 : 1;           /*!< GPIO81 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO82 : 1;           /*!< GPIO82 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO83 : 1;           /*!< GPIO83 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO84 : 1;           /*!< GPIO84 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO85 : 1;           /*!< GPIO85 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO86 : 1;           /*!< GPIO86 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO87 : 1;           /*!< GPIO87 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO88 : 1;           /*!< GPIO88 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO89 : 1;           /*!< GPIO89 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO90 : 1;           /*!< GPIO90 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO91 : 1;           /*!< GPIO91 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO92 : 1;           /*!< GPIO92 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO93 : 1;           /*!< GPIO93 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO94 : 1;           /*!< GPIO94 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO95 : 1;           /*!< GPIO95 MCU N0-priority interrupt                                          */
    } MCUN0INT2SET_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT3EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN0GPIO96 : 1;           /*!< GPIO96 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO97 : 1;           /*!< GPIO97 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO98 : 1;           /*!< GPIO98 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO99 : 1;           /*!< GPIO99 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO100 : 1;          /*!< GPIO100 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO101 : 1;          /*!< GPIO101 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO102 : 1;          /*!< GPIO102 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO103 : 1;          /*!< GPIO103 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO104 : 1;          /*!< GPIO104 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO105 : 1;          /*!< GPIO105 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO106 : 1;          /*!< GPIO106 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO107 : 1;          /*!< GPIO107 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO108 : 1;          /*!< GPIO108 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO109 : 1;          /*!< GPIO109 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO110 : 1;          /*!< GPIO110 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO111 : 1;          /*!< GPIO111 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO112 : 1;          /*!< GPIO112 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO113 : 1;          /*!< GPIO113 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO114 : 1;          /*!< GPIO114 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO115 : 1;          /*!< GPIO115 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO116 : 1;          /*!< GPIO116 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO117 : 1;          /*!< GPIO117 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO118 : 1;          /*!< GPIO118 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO119 : 1;          /*!< GPIO119 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO120 : 1;          /*!< GPIO120 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO121 : 1;          /*!< GPIO121 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO122 : 1;          /*!< GPIO122 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO123 : 1;          /*!< GPIO123 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO124 : 1;          /*!< GPIO124 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO125 : 1;          /*!< GPIO125 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO126 : 1;          /*!< GPIO126 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO127 : 1;          /*!< GPIO127 MCU N0-priority interrupt                                         */
    } MCUN0INT3EN_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT3STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

