AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t MCUN0GPIO96 : 1;           /*!< GPIO96 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO97 : 1;           /*!< GPIO97 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO98 : 1;           /*!< GPIO98 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO99 : 1;           /*!< GPIO99 MCU N0-priority interrupt                                          */
      __IOM uint32_t MCUN0GPIO100 : 1;          /*!< GPIO100 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO101 : 1;          /*!< GPIO101 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO102 : 1;          /*!< GPIO102 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO103 : 1;          /*!< GPIO103 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO104 : 1;          /*!< GPIO104 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO105 : 1;          /*!< GPIO105 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO106 : 1;          /*!< GPIO106 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO107 : 1;          /*!< GPIO107 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO108 : 1;          /*!< GPIO108 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO109 : 1;          /*!< GPIO109 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO110 : 1;          /*!< GPIO110 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO111 : 1;          /*!< GPIO111 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO112 : 1;          /*!< GPIO112 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO113 : 1;          /*!< GPIO113 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO114 : 1;          /*!< GPIO114 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO115 : 1;          /*!< GPIO115 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO116 : 1;          /*!< GPIO116 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO117 : 1;          /*!< GPIO117 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO118 : 1;          /*!< GPIO118 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO119 : 1;          /*!< GPIO119 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO120 : 1;          /*!< GPIO120 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO121 : 1;          /*!< GPIO121 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO122 : 1;          /*!< GPIO122 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO123 : 1;          /*!< GPIO123 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO124 : 1;          /*!< GPIO124 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO125 : 1;          /*!< GPIO125 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO126 : 1;          /*!< GPIO126 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO127 : 1;          /*!< GPIO127 MCU N0-priority interrupt                                         */
    } MCUN0INT3SET_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT4EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN0GPIO128 : 1;          /*!< GPIO128 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO129 : 1;          /*!< GPIO129 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO130 : 1;          /*!< GPIO130 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO131 : 1;          /*!< GPIO131 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO132 : 1;          /*!< GPIO132 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO133 : 1;          /*!< GPIO133 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO134 : 1;          /*!< GPIO134 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO135 : 1;          /*!< GPIO135 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO136 : 1;          /*!< GPIO136 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO137 : 1;          /*!< GPIO137 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO138 : 1;          /*!< GPIO138 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO139 : 1;          /*!< GPIO139 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO140 : 1;          /*!< GPIO140 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO141 : 1;          /*!< GPIO141 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO142 : 1;          /*!< GPIO142 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO143 : 1;          /*!< GPIO143 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO144 : 1;          /*!< GPIO144 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO145 : 1;          /*!< GPIO145 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO146 : 1;          /*!< GPIO146 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO147 : 1;          /*!< GPIO147 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO148 : 1;          /*!< GPIO148 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO149 : 1;          /*!< GPIO149 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO150 : 1;          /*!< GPIO150 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO151 : 1;          /*!< GPIO151 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO152 : 1;          /*!< GPIO152 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO153 : 1;          /*!< GPIO153 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO154 : 1;          /*!< GPIO154 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO155 : 1;          /*!< GPIO155 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO156 : 1;          /*!< GPIO156 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO157 : 1;          /*!< GPIO157 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO158 : 1;          /*!< GPIO158 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO159 : 1;          /*!< GPIO159 MCU N0-priority interrupt                                         */
    } MCUN0INT4EN_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT4STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

