AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t MCUN0GPIO128 : 1;          /*!< GPIO128 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO129 : 1;          /*!< GPIO129 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO130 : 1;          /*!< GPIO130 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO131 : 1;          /*!< GPIO131 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO132 : 1;          /*!< GPIO132 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO133 : 1;          /*!< GPIO133 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO134 : 1;          /*!< GPIO134 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO135 : 1;          /*!< GPIO135 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO136 : 1;          /*!< GPIO136 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO137 : 1;          /*!< GPIO137 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO138 : 1;          /*!< GPIO138 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO139 : 1;          /*!< GPIO139 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO140 : 1;          /*!< GPIO140 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO141 : 1;          /*!< GPIO141 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO142 : 1;          /*!< GPIO142 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO143 : 1;          /*!< GPIO143 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO144 : 1;          /*!< GPIO144 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO145 : 1;          /*!< GPIO145 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO146 : 1;          /*!< GPIO146 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO147 : 1;          /*!< GPIO147 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO148 : 1;          /*!< GPIO148 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO149 : 1;          /*!< GPIO149 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO150 : 1;          /*!< GPIO150 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO151 : 1;          /*!< GPIO151 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO152 : 1;          /*!< GPIO152 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO153 : 1;          /*!< GPIO153 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO154 : 1;          /*!< GPIO154 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO155 : 1;          /*!< GPIO155 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO156 : 1;          /*!< GPIO156 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO157 : 1;          /*!< GPIO157 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO158 : 1;          /*!< GPIO158 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO159 : 1;          /*!< GPIO159 MCU N0-priority interrupt                                         */
    } MCUN0INT4STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT4CLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t MCUN0GPIO128 : 1;          /*!< GPIO128 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO129 : 1;          /*!< GPIO129 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO130 : 1;          /*!< GPIO130 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO131 : 1;          /*!< GPIO131 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO132 : 1;          /*!< GPIO132 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO133 : 1;          /*!< GPIO133 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO134 : 1;          /*!< GPIO134 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO135 : 1;          /*!< GPIO135 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO136 : 1;          /*!< GPIO136 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO137 : 1;          /*!< GPIO137 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO138 : 1;          /*!< GPIO138 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO139 : 1;          /*!< GPIO139 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO140 : 1;          /*!< GPIO140 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO141 : 1;          /*!< GPIO141 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO142 : 1;          /*!< GPIO142 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO143 : 1;          /*!< GPIO143 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO144 : 1;          /*!< GPIO144 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO145 : 1;          /*!< GPIO145 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO146 : 1;          /*!< GPIO146 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO147 : 1;          /*!< GPIO147 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO148 : 1;          /*!< GPIO148 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO149 : 1;          /*!< GPIO149 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO150 : 1;          /*!< GPIO150 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO151 : 1;          /*!< GPIO151 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO152 : 1;          /*!< GPIO152 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO153 : 1;          /*!< GPIO153 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO154 : 1;          /*!< GPIO154 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO155 : 1;          /*!< GPIO155 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO156 : 1;          /*!< GPIO156 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO157 : 1;          /*!< GPIO157 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO158 : 1;          /*!< GPIO158 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO159 : 1;          /*!< GPIO159 MCU N0-priority interrupt                                         */
    } MCUN0INT4CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT4SET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

