AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t MCUN0GPIO160 : 1;          /*!< GPIO160 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO161 : 1;          /*!< GPIO161 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO162 : 1;          /*!< GPIO162 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO163 : 1;          /*!< GPIO163 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO164 : 1;          /*!< GPIO164 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO165 : 1;          /*!< GPIO165 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO166 : 1;          /*!< GPIO166 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO167 : 1;          /*!< GPIO167 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO168 : 1;          /*!< GPIO168 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO169 : 1;          /*!< GPIO169 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO170 : 1;          /*!< GPIO170 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO171 : 1;          /*!< GPIO171 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO172 : 1;          /*!< GPIO172 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO173 : 1;          /*!< GPIO173 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO174 : 1;          /*!< GPIO174 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO175 : 1;          /*!< GPIO175 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO176 : 1;          /*!< GPIO176 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO177 : 1;          /*!< GPIO177 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO178 : 1;          /*!< GPIO178 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO179 : 1;          /*!< GPIO179 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO180 : 1;          /*!< GPIO180 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO181 : 1;          /*!< GPIO181 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO182 : 1;          /*!< GPIO182 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO183 : 1;          /*!< GPIO183 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO184 : 1;          /*!< GPIO184 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO185 : 1;          /*!< GPIO185 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO186 : 1;          /*!< GPIO186 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO187 : 1;          /*!< GPIO187 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO188 : 1;          /*!< GPIO188 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO189 : 1;          /*!< GPIO189 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO190 : 1;          /*!< GPIO190 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO191 : 1;          /*!< GPIO191 MCU N0-priority interrupt                                         */
    } MCUN0INT5STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT5CLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t MCUN0GPIO160 : 1;          /*!< GPIO160 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO161 : 1;          /*!< GPIO161 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO162 : 1;          /*!< GPIO162 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO163 : 1;          /*!< GPIO163 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO164 : 1;          /*!< GPIO164 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO165 : 1;          /*!< GPIO165 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO166 : 1;          /*!< GPIO166 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO167 : 1;          /*!< GPIO167 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO168 : 1;          /*!< GPIO168 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO169 : 1;          /*!< GPIO169 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO170 : 1;          /*!< GPIO170 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO171 : 1;          /*!< GPIO171 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO172 : 1;          /*!< GPIO172 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO173 : 1;          /*!< GPIO173 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO174 : 1;          /*!< GPIO174 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO175 : 1;          /*!< GPIO175 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO176 : 1;          /*!< GPIO176 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO177 : 1;          /*!< GPIO177 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO178 : 1;          /*!< GPIO178 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO179 : 1;          /*!< GPIO179 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO180 : 1;          /*!< GPIO180 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO181 : 1;          /*!< GPIO181 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO182 : 1;          /*!< GPIO182 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO183 : 1;          /*!< GPIO183 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO184 : 1;          /*!< GPIO184 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO185 : 1;          /*!< GPIO185 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO186 : 1;          /*!< GPIO186 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO187 : 1;          /*!< GPIO187 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO188 : 1;          /*!< GPIO188 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO189 : 1;          /*!< GPIO189 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO190 : 1;          /*!< GPIO190 MCU N0-priority interrupt                                         */
      __IOM uint32_t MCUN0GPIO191 : 1;          /*!< GPIO191 MCU N0-priority interrupt                                         */
    } MCUN0INT5CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN0INT5SET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

