AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t MCUN1GPIO0 : 1;            /*!< GPIO0 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO1 : 1;            /*!< GPIO1 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO2 : 1;            /*!< GPIO2 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO3 : 1;            /*!< GPIO3 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO4 : 1;            /*!< GPIO4 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO5 : 1;            /*!< GPIO5 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO6 : 1;            /*!< GPIO6 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO7 : 1;            /*!< GPIO7 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO8 : 1;            /*!< GPIO8 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO9 : 1;            /*!< GPIO9 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO10 : 1;           /*!< GPIO10 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO11 : 1;           /*!< GPIO11 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO12 : 1;           /*!< GPIO12 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO13 : 1;           /*!< GPIO13 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO14 : 1;           /*!< GPIO14 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO15 : 1;           /*!< GPIO15 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO16 : 1;           /*!< GPIO16 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO17 : 1;           /*!< GPIO17 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO18 : 1;           /*!< GPIO18 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO19 : 1;           /*!< GPIO19 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO20 : 1;           /*!< GPIO20 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO21 : 1;           /*!< GPIO21 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO22 : 1;           /*!< GPIO22 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO23 : 1;           /*!< GPIO23 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO24 : 1;           /*!< GPIO24 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO25 : 1;           /*!< GPIO25 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO26 : 1;           /*!< GPIO26 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO27 : 1;           /*!< GPIO27 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO28 : 1;           /*!< GPIO28 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO29 : 1;           /*!< GPIO29 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO30 : 1;           /*!< GPIO30 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO31 : 1;           /*!< GPIO31 MCU N1-priority interrupt                                          */
    } MCUN1INT0SET_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT1EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN1GPIO32 : 1;           /*!< GPIO32 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO33 : 1;           /*!< GPIO33 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO34 : 1;           /*!< GPIO34 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO35 : 1;           /*!< GPIO35 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO36 : 1;           /*!< GPIO36 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO37 : 1;           /*!< GPIO37 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO38 : 1;           /*!< GPIO38 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO39 : 1;           /*!< GPIO39 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO40 : 1;           /*!< GPIO40 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO41 : 1;           /*!< GPIO41 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO42 : 1;           /*!< GPIO42 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO43 : 1;           /*!< GPIO43 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO44 : 1;           /*!< GPIO44 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO45 : 1;           /*!< GPIO45 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO46 : 1;           /*!< GPIO46 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO47 : 1;           /*!< GPIO47 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO48 : 1;           /*!< GPIO48 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO49 : 1;           /*!< GPIO49 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO50 : 1;           /*!< GPIO50 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO51 : 1;           /*!< GPIO51 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO52 : 1;           /*!< GPIO52 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO53 : 1;           /*!< GPIO53 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO54 : 1;           /*!< GPIO54 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO55 : 1;           /*!< GPIO55 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO56 : 1;           /*!< GPIO56 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO57 : 1;           /*!< GPIO57 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO58 : 1;           /*!< GPIO58 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO59 : 1;           /*!< GPIO59 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO60 : 1;           /*!< GPIO60 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO61 : 1;           /*!< GPIO61 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO62 : 1;           /*!< GPIO62 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO63 : 1;           /*!< GPIO63 MCU N1-priority interrupt                                          */
    } MCUN1INT1EN_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT1STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

