AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t MCUN1GPIO96 : 1;           /*!< GPIO96 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO97 : 1;           /*!< GPIO97 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO98 : 1;           /*!< GPIO98 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO99 : 1;           /*!< GPIO99 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO100 : 1;          /*!< GPIO100 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO101 : 1;          /*!< GPIO101 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO102 : 1;          /*!< GPIO102 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO103 : 1;          /*!< GPIO103 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO104 : 1;          /*!< GPIO104 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO105 : 1;          /*!< GPIO105 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO106 : 1;          /*!< GPIO106 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO107 : 1;          /*!< GPIO107 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO108 : 1;          /*!< GPIO108 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO109 : 1;          /*!< GPIO109 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO110 : 1;          /*!< GPIO110 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO111 : 1;          /*!< GPIO111 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO112 : 1;          /*!< GPIO112 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO113 : 1;          /*!< GPIO113 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO114 : 1;          /*!< GPIO114 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO115 : 1;          /*!< GPIO115 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO116 : 1;          /*!< GPIO116 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO117 : 1;          /*!< GPIO117 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO118 : 1;          /*!< GPIO118 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO119 : 1;          /*!< GPIO119 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO120 : 1;          /*!< GPIO120 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO121 : 1;          /*!< GPIO121 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO122 : 1;          /*!< GPIO122 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO123 : 1;          /*!< GPIO123 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO124 : 1;          /*!< GPIO124 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO125 : 1;          /*!< GPIO125 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO126 : 1;          /*!< GPIO126 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO127 : 1;          /*!< GPIO127 MCU N1-priority interrupt                                         */
    } MCUN1INT3SET_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT4EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN1GPIO128 : 1;          /*!< GPIO128 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO129 : 1;          /*!< GPIO129 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO130 : 1;          /*!< GPIO130 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO131 : 1;          /*!< GPIO131 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO132 : 1;          /*!< GPIO132 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO133 : 1;          /*!< GPIO133 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO134 : 1;          /*!< GPIO134 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO135 : 1;          /*!< GPIO135 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO136 : 1;          /*!< GPIO136 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO137 : 1;          /*!< GPIO137 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO138 : 1;          /*!< GPIO138 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO139 : 1;          /*!< GPIO139 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO140 : 1;          /*!< GPIO140 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO141 : 1;          /*!< GPIO141 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO142 : 1;          /*!< GPIO142 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO143 : 1;          /*!< GPIO143 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO144 : 1;          /*!< GPIO144 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO145 : 1;          /*!< GPIO145 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO146 : 1;          /*!< GPIO146 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO147 : 1;          /*!< GPIO147 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO148 : 1;          /*!< GPIO148 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO149 : 1;          /*!< GPIO149 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO150 : 1;          /*!< GPIO150 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO151 : 1;          /*!< GPIO151 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO152 : 1;          /*!< GPIO152 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO153 : 1;          /*!< GPIO153 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO154 : 1;          /*!< GPIO154 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO155 : 1;          /*!< GPIO155 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO156 : 1;          /*!< GPIO156 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO157 : 1;          /*!< GPIO157 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO158 : 1;          /*!< GPIO158 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO159 : 1;          /*!< GPIO159 MCU N1-priority interrupt                                         */
    } MCUN1INT4EN_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT4STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

