AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t MCUN1GPIO128 : 1;          /*!< GPIO128 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO129 : 1;          /*!< GPIO129 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO130 : 1;          /*!< GPIO130 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO131 : 1;          /*!< GPIO131 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO132 : 1;          /*!< GPIO132 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO133 : 1;          /*!< GPIO133 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO134 : 1;          /*!< GPIO134 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO135 : 1;          /*!< GPIO135 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO136 : 1;          /*!< GPIO136 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO137 : 1;          /*!< GPIO137 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO138 : 1;          /*!< GPIO138 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO139 : 1;          /*!< GPIO139 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO140 : 1;          /*!< GPIO140 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO141 : 1;          /*!< GPIO141 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO142 : 1;          /*!< GPIO142 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO143 : 1;          /*!< GPIO143 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO144 : 1;          /*!< GPIO144 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO145 : 1;          /*!< GPIO145 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO146 : 1;          /*!< GPIO146 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO147 : 1;          /*!< GPIO147 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO148 : 1;          /*!< GPIO148 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO149 : 1;          /*!< GPIO149 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO150 : 1;          /*!< GPIO150 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO151 : 1;          /*!< GPIO151 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO152 : 1;          /*!< GPIO152 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO153 : 1;          /*!< GPIO153 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO154 : 1;          /*!< GPIO154 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO155 : 1;          /*!< GPIO155 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO156 : 1;          /*!< GPIO156 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO157 : 1;          /*!< GPIO157 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO158 : 1;          /*!< GPIO158 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO159 : 1;          /*!< GPIO159 MCU N1-priority interrupt                                         */
    } MCUN1INT4STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT4CLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t MCUN1GPIO128 : 1;          /*!< GPIO128 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO129 : 1;          /*!< GPIO129 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO130 : 1;          /*!< GPIO130 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO131 : 1;          /*!< GPIO131 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO132 : 1;          /*!< GPIO132 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO133 : 1;          /*!< GPIO133 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO134 : 1;          /*!< GPIO134 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO135 : 1;          /*!< GPIO135 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO136 : 1;          /*!< GPIO136 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO137 : 1;          /*!< GPIO137 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO138 : 1;          /*!< GPIO138 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO139 : 1;          /*!< GPIO139 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO140 : 1;          /*!< GPIO140 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO141 : 1;          /*!< GPIO141 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO142 : 1;          /*!< GPIO142 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO143 : 1;          /*!< GPIO143 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO144 : 1;          /*!< GPIO144 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO145 : 1;          /*!< GPIO145 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO146 : 1;          /*!< GPIO146 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO147 : 1;          /*!< GPIO147 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO148 : 1;          /*!< GPIO148 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO149 : 1;          /*!< GPIO149 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO150 : 1;          /*!< GPIO150 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO151 : 1;          /*!< GPIO151 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO152 : 1;          /*!< GPIO152 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO153 : 1;          /*!< GPIO153 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO154 : 1;          /*!< GPIO154 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO155 : 1;          /*!< GPIO155 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO156 : 1;          /*!< GPIO156 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO157 : 1;          /*!< GPIO157 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO158 : 1;          /*!< GPIO158 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO159 : 1;          /*!< GPIO159 MCU N1-priority interrupt                                         */
    } MCUN1INT4CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT4SET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

