AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t MCUN1GPIO128 : 1;          /*!< GPIO128 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO129 : 1;          /*!< GPIO129 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO130 : 1;          /*!< GPIO130 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO131 : 1;          /*!< GPIO131 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO132 : 1;          /*!< GPIO132 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO133 : 1;          /*!< GPIO133 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO134 : 1;          /*!< GPIO134 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO135 : 1;          /*!< GPIO135 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO136 : 1;          /*!< GPIO136 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO137 : 1;          /*!< GPIO137 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO138 : 1;          /*!< GPIO138 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO139 : 1;          /*!< GPIO139 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO140 : 1;          /*!< GPIO140 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO141 : 1;          /*!< GPIO141 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO142 : 1;          /*!< GPIO142 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO143 : 1;          /*!< GPIO143 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO144 : 1;          /*!< GPIO144 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO145 : 1;          /*!< GPIO145 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO146 : 1;          /*!< GPIO146 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO147 : 1;          /*!< GPIO147 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO148 : 1;          /*!< GPIO148 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO149 : 1;          /*!< GPIO149 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO150 : 1;          /*!< GPIO150 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO151 : 1;          /*!< GPIO151 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO152 : 1;          /*!< GPIO152 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO153 : 1;          /*!< GPIO153 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO154 : 1;          /*!< GPIO154 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO155 : 1;          /*!< GPIO155 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO156 : 1;          /*!< GPIO156 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO157 : 1;          /*!< GPIO157 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO158 : 1;          /*!< GPIO158 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO159 : 1;          /*!< GPIO159 MCU N1-priority interrupt                                         */
    } MCUN1INT4SET_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT5EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN1GPIO160 : 1;          /*!< GPIO160 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO161 : 1;          /*!< GPIO161 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO162 : 1;          /*!< GPIO162 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO163 : 1;          /*!< GPIO163 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO164 : 1;          /*!< GPIO164 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO165 : 1;          /*!< GPIO165 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO166 : 1;          /*!< GPIO166 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO167 : 1;          /*!< GPIO167 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO168 : 1;          /*!< GPIO168 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO169 : 1;          /*!< GPIO169 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO170 : 1;          /*!< GPIO170 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO171 : 1;          /*!< GPIO171 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO172 : 1;          /*!< GPIO172 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO173 : 1;          /*!< GPIO173 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO174 : 1;          /*!< GPIO174 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO175 : 1;          /*!< GPIO175 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO176 : 1;          /*!< GPIO176 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO177 : 1;          /*!< GPIO177 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO178 : 1;          /*!< GPIO178 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO179 : 1;          /*!< GPIO179 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO180 : 1;          /*!< GPIO180 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO181 : 1;          /*!< GPIO181 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO182 : 1;          /*!< GPIO182 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO183 : 1;          /*!< GPIO183 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO184 : 1;          /*!< GPIO184 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO185 : 1;          /*!< GPIO185 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO186 : 1;          /*!< GPIO186 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO187 : 1;          /*!< GPIO187 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO188 : 1;          /*!< GPIO188 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO189 : 1;          /*!< GPIO189 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO190 : 1;          /*!< GPIO190 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO191 : 1;          /*!< GPIO191 MCU N1-priority interrupt                                         */
    } MCUN1INT5EN_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT5STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

