AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t MCUN1GPIO160 : 1;          /*!< GPIO160 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO161 : 1;          /*!< GPIO161 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO162 : 1;          /*!< GPIO162 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO163 : 1;          /*!< GPIO163 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO164 : 1;          /*!< GPIO164 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO165 : 1;          /*!< GPIO165 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO166 : 1;          /*!< GPIO166 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO167 : 1;          /*!< GPIO167 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO168 : 1;          /*!< GPIO168 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO169 : 1;          /*!< GPIO169 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO170 : 1;          /*!< GPIO170 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO171 : 1;          /*!< GPIO171 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO172 : 1;          /*!< GPIO172 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO173 : 1;          /*!< GPIO173 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO174 : 1;          /*!< GPIO174 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO175 : 1;          /*!< GPIO175 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO176 : 1;          /*!< GPIO176 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO177 : 1;          /*!< GPIO177 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO178 : 1;          /*!< GPIO178 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO179 : 1;          /*!< GPIO179 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO180 : 1;          /*!< GPIO180 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO181 : 1;          /*!< GPIO181 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO182 : 1;          /*!< GPIO182 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO183 : 1;          /*!< GPIO183 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO184 : 1;          /*!< GPIO184 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO185 : 1;          /*!< GPIO185 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO186 : 1;          /*!< GPIO186 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO187 : 1;          /*!< GPIO187 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO188 : 1;          /*!< GPIO188 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO189 : 1;          /*!< GPIO189 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO190 : 1;          /*!< GPIO190 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO191 : 1;          /*!< GPIO191 MCU N1-priority interrupt                                         */
    } MCUN1INT5STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT5CLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t MCUN1GPIO160 : 1;          /*!< GPIO160 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO161 : 1;          /*!< GPIO161 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO162 : 1;          /*!< GPIO162 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO163 : 1;          /*!< GPIO163 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO164 : 1;          /*!< GPIO164 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO165 : 1;          /*!< GPIO165 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO166 : 1;          /*!< GPIO166 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO167 : 1;          /*!< GPIO167 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO168 : 1;          /*!< GPIO168 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO169 : 1;          /*!< GPIO169 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO170 : 1;          /*!< GPIO170 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO171 : 1;          /*!< GPIO171 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO172 : 1;          /*!< GPIO172 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO173 : 1;          /*!< GPIO173 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO174 : 1;          /*!< GPIO174 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO175 : 1;          /*!< GPIO175 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO176 : 1;          /*!< GPIO176 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO177 : 1;          /*!< GPIO177 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO178 : 1;          /*!< GPIO178 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO179 : 1;          /*!< GPIO179 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO180 : 1;          /*!< GPIO180 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO181 : 1;          /*!< GPIO181 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO182 : 1;          /*!< GPIO182 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO183 : 1;          /*!< GPIO183 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO184 : 1;          /*!< GPIO184 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO185 : 1;          /*!< GPIO185 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO186 : 1;          /*!< GPIO186 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO187 : 1;          /*!< GPIO187 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO188 : 1;          /*!< GPIO188 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO189 : 1;          /*!< GPIO189 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO190 : 1;          /*!< GPIO190 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO191 : 1;          /*!< GPIO191 MCU N1-priority interrupt                                         */
    } MCUN1INT5CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT5SET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

