AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t MCUN1GPIO160 : 1;          /*!< GPIO160 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO161 : 1;          /*!< GPIO161 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO162 : 1;          /*!< GPIO162 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO163 : 1;          /*!< GPIO163 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO164 : 1;          /*!< GPIO164 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO165 : 1;          /*!< GPIO165 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO166 : 1;          /*!< GPIO166 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO167 : 1;          /*!< GPIO167 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO168 : 1;          /*!< GPIO168 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO169 : 1;          /*!< GPIO169 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO170 : 1;          /*!< GPIO170 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO171 : 1;          /*!< GPIO171 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO172 : 1;          /*!< GPIO172 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO173 : 1;          /*!< GPIO173 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO174 : 1;          /*!< GPIO174 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO175 : 1;          /*!< GPIO175 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO176 : 1;          /*!< GPIO176 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO177 : 1;          /*!< GPIO177 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO178 : 1;          /*!< GPIO178 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO179 : 1;          /*!< GPIO179 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO180 : 1;          /*!< GPIO180 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO181 : 1;          /*!< GPIO181 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO182 : 1;          /*!< GPIO182 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO183 : 1;          /*!< GPIO183 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO184 : 1;          /*!< GPIO184 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO185 : 1;          /*!< GPIO185 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO186 : 1;          /*!< GPIO186 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO187 : 1;          /*!< GPIO187 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO188 : 1;          /*!< GPIO188 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO189 : 1;          /*!< GPIO189 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO190 : 1;          /*!< GPIO190 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO191 : 1;          /*!< GPIO191 MCU N1-priority interrupt                                         */
    } MCUN1INT5SET_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT6EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN1GPIO192 : 1;          /*!< GPIO192 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO193 : 1;          /*!< GPIO193 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO194 : 1;          /*!< GPIO194 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO195 : 1;          /*!< GPIO195 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO196 : 1;          /*!< GPIO196 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO197 : 1;          /*!< GPIO197 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO198 : 1;          /*!< GPIO198 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO199 : 1;          /*!< GPIO199 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO200 : 1;          /*!< GPIO200 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO201 : 1;          /*!< GPIO201 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO202 : 1;          /*!< GPIO202 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO203 : 1;          /*!< GPIO203 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO204 : 1;          /*!< GPIO204 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO205 : 1;          /*!< GPIO205 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO206 : 1;          /*!< GPIO206 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO207 : 1;          /*!< GPIO207 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO208 : 1;          /*!< GPIO208 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO209 : 1;          /*!< GPIO209 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO210 : 1;          /*!< GPIO210 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO211 : 1;          /*!< GPIO211 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO212 : 1;          /*!< GPIO212 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO213 : 1;          /*!< GPIO213 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO214 : 1;          /*!< GPIO214 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO215 : 1;          /*!< GPIO215 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO216 : 1;          /*!< GPIO216 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO217 : 1;          /*!< GPIO217 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO218 : 1;          /*!< GPIO218 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO219 : 1;          /*!< GPIO219 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO220 : 1;          /*!< GPIO220 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO221 : 1;          /*!< GPIO221 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO222 : 1;          /*!< GPIO222 MCU N1-priority interrupt                                         */
      __IOM uint32_t MCUN1GPIO223 : 1;          /*!< GPIO223 MCU N1-priority interrupt                                         */
    } MCUN1INT6EN_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT6STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

