AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t SMOD0EN    : 1;            /*!< Submodule 0 enable (1) or disable (0)                                     */
      __IOM uint32_t SMOD0TYPE  : 3;            /*!< Submodule 0 module type. This is the SPI Master interface.                */
      __IOM uint32_t SMOD1EN    : 1;            /*!< Submodule 1 enable (1) or disable (0)                                     */
      __IOM uint32_t SMOD1TYPE  : 3;            /*!< Submodule 1 module type. This is the I2C Master interface                 */
            uint32_t            : 24;
    } SUBMODCTRL_b;
  } ;

  union {
    __IOM uint32_t CMD;                         /*!< Writes to this register will start an IO transaction, as well
                                                     as set various parameters for the command itself. Reads
                                                     will return the command value written to the CMD register.To
                                                     read the number of bytes that have yet to be transferred,
                                                     refer to the CTSIZE field within the CMDSTAT register.                    */

    struct {
      __IOM uint32_t CMD        : 4;            /*!< Command for submodule.                                                    */
      __IOM uint32_t OFFSETCNT  : 3;            /*!< Number of offset bytes to use for the command - 0, 1, 2, 3,
                                                     4, 5 are valid selections. The second (byte 1),third (byte
                                                     2), and forth (byte 3) are read from the OFFSETHI register,
                                                     and the low order byte is pulled from this register in
                                                     the OFFSETLO field.Offset bytes are transmitted highest
                                                     byte first. EG if offsetcnt == 4, OFFSETHI[23:16] will
                                                     be transmitted first, then OFFSETHI[15:8], then OFFSETHI[7:0]
                                                     then OFFSETLO.If offsetcnt == 5, OFFSETHI[31:24] will be
                                                     transmitted, then OFFSETHI[23:0], then OFFSETLO.If offsetcnt
                                                     == 4, OFFSETHI[23:16] will be transmitted, then OFFSETHI[15:0],
                                                     then OFFSETLO.If offsetcnt == 3, OFFSETHI[15:8] will be
                                                     transmitted, then OFFSETHI[7:0], then OFFSETLO.If offsetcnt
                                                     == 2, OFFSETHI[7:0] will be transmitted, then OFFSETLO.If
                                                     offsetcnt == 1, only OFFSETLO will be transmitted.Offset
                                                     bytes are always transmitted MSB first, regardless of the
                                                     value of the LSB control bit within the module configuration.             */
      __IOM uint32_t CONT       : 1;            /*!< Contine to hold the bus after the current transaction if set
                                                     to a 1 with a new command issued.                                         */
      __IOM uint32_t TSIZE      : 12;           /*!< Defines the transaction size in bytes. The offset transfer is
                                                     not included in this size.                                                */
      __IOM uint32_t CMDSEL     : 2;            /*!< Command Specific selection information. Not used in Master I2C.
                                                     Used as CEn select for Master SPI transactions                            */
            uint32_t            : 2;
      __IOM uint32_t OFFSETLO   : 8;            /*!< This register holds the low order byte of offset to be used
                                                     in the transaction. The number of offset bytes to use is
                                                     set with bits 1:0 of the command.                                         */
    } CMD_b;
  } ;

  union {
    __IOM uint32_t DCXCTRL;                     /*!< Enables transmission of DCX signal with SPI transactions and
                                                     selects which CE signals will be used to transmit the DCX
                                                     signal.                                                                   */

    struct {
      __IOM uint32_t DCXSEL     : 4;            /*!< Selects the CE channel used to convey the DCX function. The
                                                     select is bitwise encoded, with bit 0 = 1 enabling CE0
                                                     for DCX transmission, bit 1 = 1 enableing CE1 for DCX transmission,
                                                     etc. If the CE used for the SPI transaction is set, it
                                                     will be ignored and used as the transaction CE instead.
                                                     Multiple CE channels can be selected at once. To enable
                                                     the DCX signal to be transmitted out of the chip, the corresponding
                                                     pin mux function must be enabled in the GPIO logic as well.               */
      __IOM uint32_t DCXEN      : 1;            /*!< Global enable of the DCX function. Setting to 1 will enable
                                                     the generation of the DCX signal, which will assert when
                                                     sending the offset bytes of the SPI transaction.                          */
            uint32_t            : 27;
    } DCXCTRL_b;
  } ;

  union {
    __IOM uint32_t OFFSETHI;                    /*!< High order bytes of offset for IO transaction                             */

