AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t CQCURIDX   : 8;            /*!< Holds 8 bits of data that will be compared with the CQENDIX
                                                     register field. If the values match, the IDXEQ pause event
                                                     will be activated, which will cause the pausing of command
                                                     quue operation if the IDXEQ bit is enabled in CQPAUSEEN.                  */
            uint32_t            : 24;
    } CQCURIDX_b;
  } ;

  union {
    __IOM uint32_t CQENDIDX;                    /*!< End index value, targeted to be written by software to indicate
                                                     the last valid register pair contained within the command
                                                     queue. rgister write operations within the command queue.This
                                                     is compared to the CQCURIDX and will stop the CQ operation
                                                     if bit 15 of the CQPAUSEEN is '1' andthis current index
                                                     equals the CQCURIDX register value. This will only pause
                                                     when the values are equal.                                                */

    struct {
      __IOM uint32_t CQENDIDX   : 8;            /*!< Holds 8 bits of data that will be compared with the CQCURIX
                                                     register field. If the values match, the IDXEQ pause event
                                                     will be activated, which will cause the pausing of command
                                                     quue operation if the IDXEQ bit is enabled in CQPAUSEEN.                  */
            uint32_t            : 24;
    } CQENDIDX_b;
  } ;

  union {
    __IOM uint32_t STATUS;                      /*!< IOM Module Status                                                         */

    struct {
      __IOM uint32_t ERR        : 1;            /*!< Bit has been deprecated. Please refer to the other error indicators.
                                                     This will always return 0.                                                */
      __IOM uint32_t CMDACT     : 1;            /*!< Indicates if the active I/O Command is currently processing
                                                     a transaction, or command is complete, but the FIFO pointers
                                                     are still syncronizing internally. This bit will go high
                                                     atthe start of the transaction, and will go low when the
                                                     command is complete, and the data and pointers within the
                                                     FIFO have been syncronized.                                               */
      __IOM uint32_t IDLEST     : 1;            /*!< indicates if the active I/O state machine is IDLE. Note - The
                                                     state machine could be in idle state due to holdoffs from
                                                     data availability, or as the command gets propagated into
                                                     the logic from the registers.                                             */
            uint32_t            : 29;
    } STATUS_b;
  } ;
  __IM  uint32_t  RESERVED2[13];

  union {
    __IOM uint32_t MSPICFG;                     /*!< Controls the configuration of the SPI master module, including
                                                     POL/PHA, LSB, flow control, and delays for MISO and MOSI                  */

    struct {
      __IOM uint32_t SPOL       : 1;            /*!< Selects SPI polarity.IMPORTANT NOTICE: Due to the susceptibility
                                                     of creating a clock glitch which could cause register corruption,
                                                     changing SPHA and SPOL bits should be done in separate
                                                     writes to this register.                                                  */
      __IOM uint32_t SPHA       : 1;            /*!< Selects SPI phase.IMPORTANT NOTICE: Due to the susceptibility
                                                     of creating a clock glitch which could cause register corruption,
                                                     changing SPHA and SPOL bits should be done in separate
                                                     writes to this register.                                                  */
      __IOM uint32_t FULLDUP    : 1;            /*!< Enables full duplex mode for Master SPI write operations. Data
                                                     will be captured simultaneously into the read fifo                        */
            uint32_t            : 13;
      __IOM uint32_t WTFC       : 1;            /*!< enables write mode flow control.                                          */
      __IOM uint32_t RDFC       : 1;            /*!< Enables read mode flow control.                                           */
      __IOM uint32_t MOSIINV    : 1;            /*!< Inverts MOSI when flow control is enabled.                                */
            uint32_t            : 1;
      __IOM uint32_t WTFCIRQ    : 1;            /*!< Selects the write mode flow control signal.                               */
      __IOM uint32_t WTFCPOL    : 1;            /*!< selects the write flow control signal polarity. The transfers
                                                     are halted when the selected flow control signal is OPPOSITE
                                                     polarity of bit. (For example: WTFCPOL = 0 will allow a
                                                     IRQ=1 to pause transfers).                                                */
      __IOM uint32_t RDFCPOL    : 1;            /*!< Selects the read flow control signal polarity.                            */
      __IOM uint32_t SPILSB     : 1;            /*!< Selects data transfer as MSB first (0) or LSB first (1) for
                                                     the data portion of the SPI transaction. The offset bytes
                                                     are always transmitted MSB first.                                         */
      __IOM uint32_t DINDLY     : 3;            /*!< Delay tap to use for the input signal (MISO). This gives more
                                                     hold time on the input data.                                              */
      __IOM uint32_t DOUTDLY    : 3;            /*!< Delay tap to use for the output signal (MOSI). This give more
                                                     hold time on the output data                                              */
      __IOM uint32_t MSPIRST    : 1;            /*!< Not used. To reset the module, toggle the SMOD_EN for the module          */
            uint32_t            : 1;
    } MSPICFG_b;
  } ;
  __IM  uint32_t  RESERVED3[15];

  union {
    __IOM uint32_t MI2CCFG;                     /*!< Controls the configuration of the I2C bus master.                         */

