AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FIFOTHR    : 8;            /*!< FIFO size interrupt threshold.                                            */
            uint32_t            : 24;
    } FIFOTHR_b;
  } ;

  union {
    __IOM uint32_t FUPD;                        /*!< FIFO Update Status                                                        */

    struct {
      __IOM uint32_t FIFOUPD    : 1;            /*!< This bit indicates that a FIFO update is underway.                        */
      __IOM uint32_t IOREAD     : 1;            /*!< This bitfield indicates an IO read is active.                             */
            uint32_t            : 30;
    } FUPD_b;
  } ;

  union {
    __IOM uint32_t FIFOCTR;                     /*!< Overall FIFO Counter                                                      */

    struct {
      __IOM uint32_t FIFOCTR    : 10;           /*!< Virtual FIFO byte count                                                   */
            uint32_t            : 22;
    } FIFOCTR_b;
  } ;

  union {
    __IOM uint32_t FIFOINC;                     /*!< Overall FIFO Counter Increment                                            */

    struct {
      __IOM uint32_t FIFOINC    : 10;           /*!< Increment the Overall FIFO Counter by this value on a write               */
            uint32_t            : 22;
    } FIFOINC_b;
  } ;

  union {
    __IOM uint32_t CFG;                         /*!< I/O Slave Configuration                                                   */

    struct {
            uint32_t            : 1;
      __IOM uint32_t SPOL       : 1;            /*!< This bit selects SPI polarity.                                            */
      __IOM uint32_t LSB        : 1;            /*!< This bit selects the transfer bit ordering.                               */
            uint32_t            : 1;
      __IOM uint32_t STARTRD    : 1;            /*!< This bit holds the cycle to initiate an I/O RAM read.                     */
            uint32_t            : 15;
      __IOM uint32_t WRAPPTR    : 1;            /*!< Address pointer wrap mode enable.                                         */
            uint32_t            : 10;
      __IOM uint32_t IFCEN      : 1;            /*!< IOSLAVE interface enable.                                                 */
    } CFG_b;
  } ;

  union {
    __IOM uint32_t PRENC;                       /*!< I/O Slave Interrupt Priority Encode                                       */

    struct {
      __IOM uint32_t PRENC      : 5;            /*!< These bits hold the priority encode of the REGACC interrupts.             */
            uint32_t            : 27;
    } PRENC_b;
  } ;

  union {
    __IOM uint32_t IOINTCTL;                    /*!< I/O Interrupt Control                                                     */

    struct {
      __IOM uint32_t IOINTEN    : 8;            /*!< These read-only bits indicate whether the IOINT interrupts are
                                                     enabled.                                                                  */
      __IOM uint32_t IOINT      : 8;            /*!< These bits read the IOINT interrupts.                                     */
      __IOM uint32_t IOINTCLR   : 1;            /*!< This bit clears all of the IOINT interrupts when written with
                                                     a 1.                                                                      */
            uint32_t            : 7;
      __IOM uint32_t IOINTSET   : 8;            /*!< These bits set the IOINT interrupts when written with a 1.                */
    } IOINTCTL_b;
  } ;

  union {
    __IOM uint32_t GENADD;                      /*!< General Address Data                                                      */

    struct {
      __IOM uint32_t GADATA     : 8;            /*!< The data supplied on the last General Address reference.                  */
            uint32_t            : 24;
    } GENADD_b;
  } ;

  union {
    __IOM uint32_t ADDPTR;                      /*!< Address pointer                                                           */

    struct {
      __IOM uint32_t ADDPTR     : 8;            /*!< The current value in the Address pointer.                                 */
            uint32_t            : 24;
    } ADDPTR_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t DMACFG;                      /*!< Configuration control of the DMA process, including the direction
                                                     of DMA, and enablement of DMA                                             */

    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< DMA Enable. Setting this bit to EN will start the DMA operation.
                                                     This should be the last DMA related register set prior
                                                     to issuing the command                                                    */
      __IOM uint32_t DMADIR     : 1;            /*!< Direction                                                                 */
            uint32_t            : 6;
      __IOM uint32_t DMAPRI     : 1;            /*!< Sets the Priority of the DMA request                                      */
      __IOM uint32_t DPWROFF    : 1;            /*!< Power off module after DMA is complete. If this bit is active,
                                                     the module will request to power off the supply it is attached
                                                     to. If there are other units still requiring power from
                                                     the same domain, power down will not be performed.                        */
      __IOM uint32_t DMAQUAD    : 1;            /*!< Sets the Priority of the DMA request                                      */
            uint32_t            : 5;
      __IOM uint32_t PADBYTE    : 8;            /*!< PAD byte value.                                                           */
      __IOM uint32_t PADBYTEEN  : 1;            /*!< PAD byte enable.                                                          */
      __IOM uint32_t FRCDMA     : 1;            /*!< Force DMA transfer read/write independent of R/W bit in interface
                                                     command                                                                   */
      __IOM uint32_t FRCRDWRT   : 1;            /*!< Select DMA transfer force direction                                       */
            uint32_t            : 5;
    } DMACFG_b;
  } ;

  union {
    __IOM uint32_t DMATOTCOUNT;                 /*!< Contains the number of bytes to be transferred for this DMA
                                                     transaction. This register is decremented as the data is
                                                     transferred.                                                              */

