AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t TOTCOUNT   : 16;           /*!< This bitfield holds the number of bytes transferred to/from
                                                     memory during a DMA transfer.                                             */
      __IOM uint32_t XFRCOUNT   : 16;           /*!< This bitfield holds the number of bytes transferred on the interface.     */
    } DMATOTCOUNT_b;
  } ;

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< The source or destination address internal the SRAM for the
                                                     DMA data. For write operations, this can only be SRAM data
                                                     (ADDR bit 28 = 1); For read operations, this can be either
                                                     SRAM or FLASH (ADDR bit 28 = 0)                                           */

    struct {
      __IOM uint32_t TARGADDR   : 32;           /*!< Bits [28:0] of the target byte address for source of DMA (either
                                                     read or write). The address can be any byte alignment,
                                                     and does not have to be word aligned. In cases of non-word
                                                     aligned addresses, the DMA logic will take care of ensuring
                                                     only the target bytes are read/written.                                   */
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMASTAT;                     /*!< Status of the DMA operation currently in progress.                        */

    struct {
      __IOM uint32_t DMATIP     : 1;            /*!< DMA Transfer In Progress indicator. 1 will indicate that a DMA
                                                     transfer is active. The DMA transfer may be waiting on
                                                     data, transferring data, or waiting for priority.All of
                                                     these will be indicated with a 1. A 0 will indicate that
                                                     the DMA is fully complete and no further transactions will
                                                     be done. This bit is read only.                                           */
      __IOM uint32_t DMACPL     : 1;            /*!< DMA Transfer Complete. This signals the end of the DMA operation.
                                                     This bit can be cleared by writing to 0, and will also
                                                     be cleared when a new DMA is started.                                     */
      __IOM uint32_t XFRCMP     : 1;            /*!< DMA Error. This active high bit signals when the transfer is
                                                     complete from teh Host. The bit can be cleared by writing
                                                     to 0. Once set, this bit will remain set until cleared
                                                     by software.                                                              */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error. This active high bit signals an error was encountered
                                                     during the DMA operation. The bit can be cleared by writing
                                                     to 0. Once set, this bit will remain set until cleared
                                                     by software.                                                              */
      __IOM uint32_t DMAUNDFL   : 1;            /*!< DMA Error. This active high bit signals an underflow was encountered
                                                     during a DMA write operation. The bit can be cleared by
                                                     writing to 0. Once set, this bit will remain set until
                                                     cleared by software.                                                      */
            uint32_t            : 3;
      __IOM uint32_t DMAFSIZE   : 8;            /*!< DMA FIFO size not transferred                                             */
      __IOM uint32_t DMAFOVF    : 1;            /*!< DMA FIFO size overflow                                                    */
            uint32_t            : 15;
    } DMASTAT_b;
  } ;
  __IM  uint32_t  RESERVED2[48];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t FSIZE      : 1;            /*!< FIFO Size interrupt.                                                      */
      __IOM uint32_t FOVFL      : 1;            /*!< FIFO Overflow interrupt.                                                  */
      __IOM uint32_t FUNDFL     : 1;            /*!< FIFO Underflow interrupt.                                                 */
      __IOM uint32_t FRDERR     : 1;            /*!< FIFO Read Error interrupt.                                                */
            uint32_t            : 1;
      __IOM uint32_t IOINTW     : 1;            /*!< IO Write interrupt.                                                       */
      __IOM uint32_t XCMPRF     : 1;            /*!< Transfer complete interrupt, read from FIFO space.                        */
      __IOM uint32_t XCMPRR     : 1;            /*!< Transfer complete interrupt, read from register space.                    */
      __IOM uint32_t XCMPWF     : 1;            /*!< Transfer complete interrupt, write to FIFO space.                         */
      __IOM uint32_t XCMPWR     : 1;            /*!< Transfer complete interrupt, write to register space.                     */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Complete. Processing of the DMA operation has completed
                                                     and the DMA submodule is returned into the idle state                     */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error encountered during the processing of the DMA command.
                                                     The DMA error could occur when the memory access specified
                                                     in the DMA operation is not available or incorrectly specified.           */
            uint32_t            : 20;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

