AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t FSIZE      : 1;            /*!< FIFO Size interrupt.                                                      */
      __IOM uint32_t FOVFL      : 1;            /*!< FIFO Overflow interrupt.                                                  */
      __IOM uint32_t FUNDFL     : 1;            /*!< FIFO Underflow interrupt.                                                 */
      __IOM uint32_t FRDERR     : 1;            /*!< FIFO Read Error interrupt.                                                */
            uint32_t            : 1;
      __IOM uint32_t IOINTW     : 1;            /*!< IO Write interrupt.                                                       */
      __IOM uint32_t XCMPRF     : 1;            /*!< Transfer complete interrupt, read from FIFO space.                        */
      __IOM uint32_t XCMPRR     : 1;            /*!< Transfer complete interrupt, read from register space.                    */
      __IOM uint32_t XCMPWF     : 1;            /*!< Transfer complete interrupt, write to FIFO space.                         */
      __IOM uint32_t XCMPWR     : 1;            /*!< Transfer complete interrupt, write to register space.                     */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Complete. Processing of the DMA operation has completed
                                                     and the DMA submodule is returned into the idle state                     */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error encountered during the processing of the DMA command.
                                                     The DMA error could occur when the memory access specified
                                                     in the DMA operation is not available or incorrectly specified.           */
            uint32_t            : 20;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t FSIZE      : 1;            /*!< FIFO Size interrupt.                                                      */
      __IOM uint32_t FOVFL      : 1;            /*!< FIFO Overflow interrupt.                                                  */
      __IOM uint32_t FUNDFL     : 1;            /*!< FIFO Underflow interrupt.                                                 */
      __IOM uint32_t FRDERR     : 1;            /*!< FIFO Read Error interrupt.                                                */
            uint32_t            : 1;
      __IOM uint32_t IOINTW     : 1;            /*!< IO Write interrupt.                                                       */
      __IOM uint32_t XCMPRF     : 1;            /*!< Transfer complete interrupt, read from FIFO space.                        */
      __IOM uint32_t XCMPRR     : 1;            /*!< Transfer complete interrupt, read from register space.                    */
      __IOM uint32_t XCMPWF     : 1;            /*!< Transfer complete interrupt, write to FIFO space.                         */
      __IOM uint32_t XCMPWR     : 1;            /*!< Transfer complete interrupt, write to register space.                     */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Complete. Processing of the DMA operation has completed
                                                     and the DMA submodule is returned into the idle state                     */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error encountered during the processing of the DMA command.
                                                     The DMA error could occur when the memory access specified
                                                     in the DMA operation is not available or incorrectly specified.           */
            uint32_t            : 20;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t FSIZE      : 1;            /*!< FIFO Size interrupt.                                                      */
      __IOM uint32_t FOVFL      : 1;            /*!< FIFO Overflow interrupt.                                                  */
      __IOM uint32_t FUNDFL     : 1;            /*!< FIFO Underflow interrupt.                                                 */
      __IOM uint32_t FRDERR     : 1;            /*!< FIFO Read Error interrupt.                                                */
            uint32_t            : 1;
      __IOM uint32_t IOINTW     : 1;            /*!< IO Write interrupt.                                                       */
      __IOM uint32_t XCMPRF     : 1;            /*!< Transfer complete interrupt, read from FIFO space.                        */
      __IOM uint32_t XCMPRR     : 1;            /*!< Transfer complete interrupt, read from register space.                    */
      __IOM uint32_t XCMPWF     : 1;            /*!< Transfer complete interrupt, write to FIFO space.                         */
      __IOM uint32_t XCMPWR     : 1;            /*!< Transfer complete interrupt, write to register space.                     */
      __IOM uint32_t DCMP       : 1;            /*!< DMA Complete. Processing of the DMA operation has completed
                                                     and the DMA submodule is returned into the idle state                     */
      __IOM uint32_t DERR       : 1;            /*!< DMA Error encountered during the processing of the DMA command.
                                                     The DMA error could occur when the memory access specified
                                                     in the DMA operation is not available or incorrectly specified.           */
            uint32_t            : 20;
    } INTSET_b;
  } ;

  union {
    __IOM uint32_t REGACCINTEN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

