AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t RSVD       : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t TEMP       : 2;            /*!< Temperature.                                                              */
      __IOM uint32_t PINS       : 3;            /*!< Number of pins for a given package.                                       */
      __IOM uint32_t PKG        : 2;            /*!< Package type.                                                             */
      __IOM uint32_t REVMIN     : 4;            /*!< Minor revision. Please use the CHIPREV register for device identification. */
      __IOM uint32_t REVMAJ     : 4;            /*!< Major revision. Please use the CHIPREV register for device identification. */
      __IOM uint32_t SRAMSIZE   : 4;            /*!< SRAM size. Please use the SKU register for determining memory
                                                     sizing.                                                                   */
      __IOM uint32_t MRAMSIZE   : 4;            /*!< MRAM size. Please use the SKU register for determining memory
                                                     sizing.                                                                   */
      __IOM uint32_t PN         : 8;            /*!< Apollo family device type.                                                */
    } CHIPPN_b;
  } ;

  union {
    __IOM uint32_t CHIPID0;                     /*!< Unique Chip ID 0                                                          */

    struct {
      __IOM uint32_t CHIPID0    : 32;           /*!< Unique chip ID 0. For APOLLO CHIPID0 value is 0x0                         */
    } CHIPID0_b;
  } ;

  union {
    __IOM uint32_t CHIPID1;                     /*!< Unique Chip ID 1                                                          */

    struct {
      __IOM uint32_t CHIPID1    : 32;           /*!< Unique chip ID 1. For APOLLO CHIPID1 value is 0x0                         */
    } CHIPID1_b;
  } ;

  union {
    __IOM uint32_t CHIPREV;                     /*!< Chip Revision                                                             */

    struct {
      __IOM uint32_t REVMIN     : 4;            /*!< Minor Revision ID.                                                        */
      __IOM uint32_t REVMAJ     : 4;            /*!< Major Revision ID.                                                        */
      __IOM uint32_t SIPART     : 12;           /*!< Silicon Part ID                                                           */
            uint32_t            : 12;
    } CHIPREV_b;
  } ;

  union {
    __IOM uint32_t VENDORID;                    /*!< Unique Vendor ID                                                          */

    struct {
      __IOM uint32_t VENDORID   : 32;           /*!< Unique Vendor ID                                                          */
    } VENDORID_b;
  } ;

  union {
    __IOM uint32_t SKU;                         /*!< Unique Chip SKU                                                           */

    struct {
      __IOM uint32_t SKUSRAMSIZE : 2;           /*!< SRAM SKU dictates the available memory for MCU. All of the MCU
                                                     TCM (384KB) and System SRAM (2MB) available by default.                   */
      __IOM uint32_t SKUMRAMSIZE : 2;           /*!< MRAM size SKU. All of 4MB Available by default.                           */
            uint32_t            : 2;
      __IOM uint32_t SKUTURBOSPOT : 1;          /*!< High performance mode for MCU and DSPs.                                   */
      __IOM uint32_t SKUMIPIDSI : 1;            /*!< MIPI DSI available                                                        */
      __IOM uint32_t SKUGFX     : 1;            /*!< GFX available                                                             */
      __IOM uint32_t SKUUSB     : 1;            /*!< USB available                                                             */
      __IOM uint32_t SKUSECURESPOT : 1;         /*!< Secure boot feature                                                       */
      __IOM uint32_t SKUITCM    : 4;            /*!< ITCM size feature0x6: 32KB0x8: 128KB0x9: 256KB                            */
      __IOM uint32_t SKUDTCM    : 4;            /*!< DTCM size feature0x8: 128KB0x9: 256KB0xA: 512KB                           */
      __IOM uint32_t SKUFPU     : 1;            /*!< FPU feature0x0: no FPU0x1: Has FPU                                        */
      __IOM uint32_t SKUMVE     : 2;            /*!< MVE feature0x0: no MVE0x1: Integer MVE only0x2: Integer and
                                                     Floating Point MVE supported (note that with this setting,
                                                     FPU must be enabled)                                                      */
            uint32_t            : 10;
    } SKU_b;
  } ;

  union {
    __IOM uint32_t SKUOVERRIDE;                 /*!< Override register for Chip SKU                                            */

    struct {
      __IOM uint32_t SKUSRAMSIZE : 2;           /*!< Override for sram size sku                                                */
      __IOM uint32_t SKUMRAMSIZE : 2;           /*!< Override for mram size sku                                                */
            uint32_t            : 2;
      __IOM uint32_t SKUTURBOSPOT : 1;          /*!< Override for turbo spot sku                                               */
      __IOM uint32_t SKUMIPIDSI : 1;            /*!< Override for mipi dsi sku                                                 */
      __IOM uint32_t SKUGFX     : 1;            /*!< Override for gfx sku                                                      */
      __IOM uint32_t SKUUSB     : 1;            /*!< Override for usb sku                                                      */
            uint32_t            : 1;
      __IOM uint32_t CFGITCMSZ  : 4;            /*!< ITCM size feature (only 3 ITCM configurations are allowed: 0x6
                                                     - 32K, 0x8 - 128K, 0x9 - 256K)                                            */
      __IOM uint32_t CFGDTCMSZ  : 4;            /*!< DTCM size feature (only 3 DTCM configurations are allowed: 0x8
                                                     - 128K, 0x9 - 256K, 0xA - 512K)                                           */
      __IOM uint32_t CFGFPU     : 1;            /*!< FPU feature                                                               */
      __IOM uint32_t CFGMVE     : 2;            /*!< MVE feature                                                               */
            uint32_t            : 10;
    } SKUOVERRIDE_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t DEBUGGER;                    /*!< Debugger Control                                                          */

