AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t CORELDOOVER : 1;           /*!< Override control for CORE LDO signals                                     */
      __IOM uint32_t CORELDOPDNB : 1;           /*!< CORE LDO PDNB control. Override for PWRCTRL going to analog
                                                     when CORELDOOVER = 1                                                      */
      __IOM uint32_t CORELDOACTIVEEARLY : 1;    /*!< CORE LDO EARLY ACTIVE control. Override for PWRCTRL going to
                                                     analog when CORELDOOVER = 1                                               */
      __IOM uint32_t CORELDOACTIVE : 1;         /*!< CORE LDO ACTIVE control. Override for PWRCTRL going to analog
                                                     when CORELDOOVER = 1                                                      */
      __IOM uint32_t CORELDOCOLDSTARTEN : 1;    /*!< CORE LDO COLDSTART EN control. This is a shadow backed register
                                                     and no need to set CORELDOOVER.                                           */
      __IOM uint32_t MEMLDOOVER : 1;            /*!< Override control for MEM LDO signals                                      */
      __IOM uint32_t MEMLDOPDNB : 1;            /*!< MEM LDO PDNB control. Override signal for PWRCTRL going to analog
                                                     when MEMLDOOVER = 1                                                       */
      __IOM uint32_t MEMLDOACTIVEEARLY : 1;     /*!< MEM LDO EARLY ACTIVE control. Override for PWRCTRL going to
                                                     analog when MEMLDOOVER = 1                                                */
      __IOM uint32_t MEMLDOACTIVE : 1;          /*!< MEM LDO ACTIVE control. Override for PWRCTRL going to analog
                                                     when MEMLDOOVER = 1                                                       */
      __IOM uint32_t MEMLDOCOLDSTARTEN : 1;     /*!< MEM LDO COLDSTART EN control. This is a shadow backed register
                                                     and no need to set MEMLDOOVER.                                            */
      __IOM uint32_t MEMLPLDOOVER : 1;          /*!< Override control for MEM LP LDO signals                                   */
      __IOM uint32_t MEMLPLDOPDNB : 1;          /*!< MEM LP LDO PDNB control. Override for PWRCTRL going to analog
                                                     when MEMLPLDOOVER = 1                                                     */
      __IOM uint32_t MEMLPLDOACTIVE : 1;        /*!< MEM LP LDO ACTVIVE control. Override for PWRCTRL going to analog
                                                     when MEMLPLDOOVER = 1                                                     */
      __IOM uint32_t ANALDOOVER : 1;            /*!< Override control for ANALDO signals                                       */
      __IOM uint32_t ANALDOPDNB : 1;            /*!< ANALDO PDNB control. Override for PWRCTRL going to analog when
                                                     ANALDOOVER = 1                                                            */
      __IOM uint32_t ANALDOACTIVE : 1;          /*!< ANALDO LDO ACTIVE control. Override for PWRCTRL going to analog
                                                     when ANALDOOVER = 1                                                       */
      __IOM uint32_t SIMOBUCKOVER : 1;          /*!< Override control for SIMO BUCK signals                                    */
      __IOM uint32_t SIMOBUCKPDNB : 1;          /*!< SIMO BUCK PDNB control. Override for PWRCTRL going to analog
                                                     when SIMOBUCKOVER = 1                                                     */
      __IOM uint32_t SIMOBUCKRSTB : 1;          /*!< SIMO BUCK RSTB control. Override for PWRCTRL going to analog
                                                     when SIMOBUCKOVER = 1                                                     */
      __IOM uint32_t SIMOBUCKACTIVE : 1;        /*!< SIMO BUCK ACTIVE control. Override for PWRCTRL going to analog
                                                     when SIMOBUCKOVER = 1                                                     */
            uint32_t            : 12;
    } VRCTRL_b;
  } ;
  __IM  uint32_t  RESERVED4[7];

  union {
    __IOM uint32_t LDOREG1;                     /*!< CORELDO trims Reg                                                         */

    struct {
      __IOM uint32_t CORELDOACTIVETRIM : 10;    /*!< CORE LDO active trim                                                      */
      __IOM uint32_t CORELDOTEMPCOTRIM : 4;     /*!< CORE LDO TEMPCO trim                                                      */
      __IOM uint32_t CORELDOLPTRIM : 6;         /*!< CORE LDO Low Power Trim                                                   */
      __IOM uint32_t CORELDOIBIASTRIM : 1;      /*!< CORE LDO IBIAS Trim                                                       */
      __IOM uint32_t CORELDOIBIASSEL : 1;       /*!< Core LDO IBIAS sel. Note: the SWE mux select in PWRSEQ2SWE must
                                                     be set for this to take effect.                                           */
            uint32_t            : 10;
    } LDOREG1_b;
  } ;
  __IM  uint32_t  RESERVED5;

  union {
    __IOM uint32_t LDOREG2;                     /*!< MEMLDO and MEMLPLDO Trims                                                 */

    struct {
      __IOM uint32_t MEMLDOACTIVETRIM : 6;      /*!< MEM LDO active trim                                                       */
      __IOM uint32_t MEMLDOLPTRIM : 6;          /*!< MEM LDO LP trim                                                           */
      __IOM uint32_t MEMLDOLPALTTRIM : 6;       /*!< MEM LDO TRIM LP ALT SET                                                   */
      __IOM uint32_t MEMLPLDOTRIM : 6;          /*!< MEM LPLDO TRIM                                                            */
      __IOM uint32_t MEMLPLDOIBIASTRIM : 1;     /*!< Mem LPLDO IBIAS trim                                                      */
      __IOM uint32_t MEMLDOIBIASSEL : 1;        /*!< Mem LDO IBIAS sel. Note: the SWE mux select in PWRSEQ2SWE must
                                                     be set for this to take effect.                                           */
      __IOM uint32_t TRIMANALDO : 4;            /*!< Analog LDO Trim.                                                          */
            uint32_t            : 2;
    } LDOREG2_b;
  } ;
  __IM  uint32_t  RESERVED6[21];

  union {
    __IOM uint32_t LFRC;                        /*!< LFRC Control                                                              */

