AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t BATTLOAD   : 1;            /*!< Enable the ADC battery load resistor                                      */
            uint32_t            : 31;
    } ADCBATTLOAD_b;
  } ;
  __IM  uint32_t  RESERVED9[3];

  union {
    __IOM uint32_t XTALCTRL;                    /*!< XTAL Oscillator Control                                                   */

    struct {
      __IOM uint32_t XTALSWE    : 1;            /*!< XTAL Software Override Enable.                                            */
      __IOM uint32_t XTALCOREDISFB : 1;         /*!< XTAL Oscillator Disable Feedback.                                         */
      __IOM uint32_t XTALCOMPBYPASS : 1;        /*!< XTAL Oscillator Bypass Comparator.                                        */
      __IOM uint32_t XTALPDNB   : 1;            /*!< XTAL Oscillator Power Down Core.                                          */
      __IOM uint32_t XTALCOMPPDNB : 1;          /*!< XTAL Oscillator Power Down Comparator.                                    */
      __IOM uint32_t XTALIBUFTRIM : 2;          /*!< XTAL IBUFF trim                                                           */
      __IOM uint32_t XTALICOMPTRIM : 2;         /*!< XTAL ICOMP trim                                                           */
            uint32_t            : 23;
    } XTALCTRL_b;
  } ;

  union {
    __IOM uint32_t XTALGENCTRL;                 /*!< XTAL Oscillator General Control                                           */

    struct {
      __IOM uint32_t ACWARMUP   : 2;            /*!< Auto-calibration delay control                                            */
      __IOM uint32_t XTALBIASTRIM : 6;          /*!< XTAL BIAS trim                                                            */
      __IOM uint32_t XTALKSBIASTRIM : 6;        /*!< XTAL IBIAS Kick start trim. This trim value is used during the
                                                     startup process to enable a faster lock.                                  */
            uint32_t            : 18;
    } XTALGENCTRL_b;
  } ;

  union {
    __IOM uint32_t XTALHSTRIMS;                 /*!< XTALHS Trims                                                              */

    struct {
      __IOM uint32_t XTALHSCAP2TRIM : 6;        /*!< xtalhs_cap2_trim                                                          */
      __IOM uint32_t XTALHSCAPTRIM : 4;         /*!< xtalhs_cap_trim                                                           */
      __IOM uint32_t XTALHSDRIVETRIM : 2;       /*!< xtalhs_drive_trim                                                         */
      __IOM uint32_t XTALHSDRIVERSTRENGTH : 3;  /*!< xtalhs_driver_strength                                                    */
      __IOM uint32_t XTALHSIBIASCOMP2TRIM : 2;  /*!< xtalhs_ibias_comp2_trim                                                   */
      __IOM uint32_t XTALHSIBIASCOMPTRIM : 4;   /*!< xtalhs_ibias_comp_trim                                                    */
      __IOM uint32_t XTALHSIBIASTRIM : 7;       /*!< xtalhs_ibias_trim                                                         */
      __IOM uint32_t XTALHSRSTRIM : 1;          /*!< xtalhs_rs_trim                                                            */
      __IOM uint32_t XTALHSSPARE : 1;           /*!< xtalhs_spare                                                              */
            uint32_t            : 2;
    } XTALHSTRIMS_b;
  } ;

  union {
    __IOM uint32_t XTALHSCTRL;                  /*!< XTALHS Control                                                            */

    struct {
      __IOM uint32_t XTALHSPDNB : 1;            /*!< xtalhs_pdnb                                                               */
      __IOM uint32_t XTALHSCOMPPDNB : 1;        /*!< xtalhs_comp_pdnb                                                          */
      __IOM uint32_t XTALHSCOMPSEL : 1;         /*!< xtalhs_comp_sel                                                           */
      __IOM uint32_t XTALHSIBSTENABLE : 1;      /*!< xtalhs_ibst_enable                                                        */
      __IOM uint32_t XTALHSINJECTIONENABLE : 1; /*!< xtalhs_injection_enable                                                   */
      __IOM uint32_t XTALHSPDNPNIMPROVE : 1;    /*!< xtalhs_pdn_pn_improve                                                     */
      __IOM uint32_t XTALHSSELRCOM : 1;         /*!< xtalhs_sel_rcom                                                           */
      __IOM uint32_t XTALHSPADOUTEN : 1;        /*!< xtalhs_padout_en                                                          */
      __IOM uint32_t XTALHSEXTERNALCLOCK : 1;   /*!< xtalhs_external_clock                                                     */
            uint32_t            : 23;
    } XTALHSCTRL_b;
  } ;
  __IM  uint32_t  RESERVED10;

  union {
    __IOM uint32_t BGTLPCTRL;                   /*!< LP Bandgap Control                                                        */

    struct {
      __IOM uint32_t BGTLPPTATTRIM : 6;         /*!< BGTLP ptat trim                                                           */
      __IOM uint32_t BGTLPCTATTRIM : 6;         /*!< BGTLP ctat trim                                                           */
      __IOM uint32_t BGTLPVBG2P5TRIM : 6;       /*!< BGTLP vbg2p5 trim                                                         */
      __IOM uint32_t BGTLPBYPASSB : 1;          /*!< bgtlp_bypass_b                                                            */
      __IOM uint32_t BGTLPQUICKCHB : 1;         /*!< bgtlp_quickch_b                                                           */
            uint32_t            : 12;
    } BGTLPCTRL_b;
  } ;
  __IM  uint32_t  RESERVED11[18];

  union {
    __IOM uint32_t MRAMCRYPTOPWRCTRL;           /*!< MRAM Crypto Power Control                                                 */

    struct {
      __IOM uint32_t MRAM0LPREN : 1;            /*!< MRAM0 low power mode enable                                               */
      __IOM uint32_t MRAM0SLPEN : 1;            /*!< MRAM0 sleep mode enable                                                   */
      __IOM uint32_t MRAM0PWRCTRL : 1;          /*!< MRAM0 low power mode control. When set to 1, tmc_lpr and tmc_slp
                                                     are driven by the value of MRAM0LPREN and MRAM0SLPEN of
                                                     this register.                                                            */
      __IOM uint32_t MRAM1LPREN : 1;            /*!< MRAM1 low power mode enable                                               */
      __IOM uint32_t MRAM1SLPEN : 1;            /*!< MRAM1 sleep mode enable                                                   */
      __IOM uint32_t MRAM1PWRCTRL : 1;          /*!< MRAM1 low power mode control. When set to 1, tmc_lpr and tmc_slp
                                                     are driven by the value of MRAM1LPREN and MRAM1SLPEN of
                                                     this register.                                                            */
            uint32_t            : 2;
      __IOM uint32_t CRYPTOPWRDOWREADY : 1;     /*!< Crypto power down is ready, sw can pwd down the crypto through
                                                     power ctrl                                                                */
      __IOM uint32_t CRYPTOCLKGATEN : 1;        /*!< crypto clk gating enable configuration                                    */
            uint32_t            : 22;
    } MRAMCRYPTOPWRCTRL_b;
  } ;
  __IM  uint32_t  RESERVED12[10];

  union {
    __IOM uint32_t BODISABLE;                   /*!< Brownout Disable                                                          */

