AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t VDDFLPHIGHTOFFTRIMFINE : 4;/*!< DEPRECATED.                                                               */
      __IOM uint32_t VDDFLPHIGHTOFFTRIM : 5;    /*!< VDDF low power high toff trim control for Buck sequence.                  */
      __IOM uint32_t VDDFLPHIGHTONTRIM : 5;     /*!< VDDF low power high ton trim control for Buck sequence.                   */
      __IOM uint32_t VDDFLPLOWTOFFTRIMFINE : 4; /*!< DEPRECATED.                                                               */
      __IOM uint32_t VDDFLPLOWTOFFTRIM : 5;     /*!< VDDF low power low toff trim control for Buck sequence.                   */
      __IOM uint32_t VDDFLPLOWTONTRIM : 5;      /*!< VDDF low power low ton trim control for Buck sequence.                    */
            uint32_t            : 4;
    } SIMOBUCK8_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK9;                   /*!< SIMO Buck Muxed VDDS Active Sequence Trim Control                         */

    struct {
      __IOM uint32_t VDDSACTDRVSTRTRIM : 2;     /*!< simobuck_vdds_act_drvstr_trim                                             */
      __IOM uint32_t VDDSACTFBTRIM : 6;         /*!< DEPRECATED                                                                */
      __IOM uint32_t VDDSACTHIGHTOFFTRIMFINE : 4;/*!< DEPRECATED.                                                              */
      __IOM uint32_t VDDSACTHIGHTOFFTRIM : 5;   /*!< VDDS active high toff trim control for Buck sequence.                     */
      __IOM uint32_t VDDSACTHIGHTONTRIM : 5;    /*!< VDDS active high ton trim control for Buck sequence.                      */
      __IOM uint32_t VDDSACTINPREFSEL : 1;      /*!< DEPRECATED                                                                */
      __IOM uint32_t VDDSACTLOWTONTRIM : 5;     /*!< VDDS active low ton trim control for Buck sequence.                       */
      __IOM uint32_t VDDSLEAKAGETRIM : 1;       /*!< DEPRECATED                                                                */
            uint32_t            : 3;
    } SIMOBUCK9_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK10;                  /*!< SIMO Buck Muxed VDDS active Sequence Trim Control                         */

    struct {
      __IOM uint32_t VDDSACTLOWTOFFTRIMFINE : 4;/*!< DEPRECATED.                                                               */
      __IOM uint32_t VDDSACTLOWTOFFTRIM : 5;    /*!< VDDS active low toff trim control for Buck sequence.                      */
      __IOM uint32_t VDDSLPDRVSTRTRIM : 2;      /*!< VDDS low power trim control for drive strength.                           */
      __IOM uint32_t VDDSLPFBCDACEN : 1;        /*!< DEPRECATED                                                                */
      __IOM uint32_t VDDSLPFBCDACTRIM : 2;      /*!< DEPRECATED                                                                */
      __IOM uint32_t VDDSLPFBTRIM : 6;          /*!< DEPRECATED                                                                */
      __IOM uint32_t VDDSLPHIGHTOFFTRIMFINE : 4;/*!< DEPRECATED.                                                               */
      __IOM uint32_t VDDSLPHIGHTOFFTRIM : 5;    /*!< VDDS low power high toff trim control for a Buck sequence.                */
            uint32_t            : 3;
    } SIMOBUCK10_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK11;                  /*!< SIMO Buck Muxed Sequence Trim Control                                     */

    struct {
      __IOM uint32_t VDDSLPHIGHTONTRIM : 5;     /*!< VDDS low power high ton trim control for a Buck sequence.                 */
      __IOM uint32_t VDDSLPINPREFSEL : 1;       /*!< DEPRECATED                                                                */
      __IOM uint32_t VDDSLPLOWTOFFTRIMFINE : 4; /*!< DEPRECATED.                                                               */
      __IOM uint32_t VDDSLPLOWTOFFTRIM : 5;     /*!< VDDS low power low toff trim control for a Buck sequence.                 */
      __IOM uint32_t VDDSLPLOWTONTRIM : 5;      /*!< VDDS low power low ton trim control for a Buck sequence.                  */
      __IOM uint32_t TRIMCHANGEDLYPRE : 2;      /*!< Delay used on the trims valid de-assertion before trims are
                                                     changed.                                                                  */
      __IOM uint32_t TRIMCHANGEDLYPOST : 2;     /*!< Delay used on the trims valid assertion after trims are changed.          */
      __IOM uint32_t ENBRNOUT   : 4;            /*!< Enable each individual rail counter.                                      */
            uint32_t            : 4;
    } SIMOBUCK11_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK12;                  /*!< SIMO Buck Compare, Brown out, Active, Low power Trim Control              */

    struct {
      __IOM uint32_t VDDCLVCOMPTRIMMINUS : 5;   /*!< Static trim to allow separation between low power and active
                                                     rail.                                                                     */
      __IOM uint32_t VDDCLVCOMPTRIMPLUS : 5;    /*!< Static trim to allow separation when low power GT active rail.            */
      __IOM uint32_t VDDCLVBRNOUTTRIM : 10;     /*!< Digital brown out max counter value for VDDC LV rail.                     */
      __IOM uint32_t ACTTRIMVDDF : 6;           /*!< Active VDDF trim.                                                         */
      __IOM uint32_t LPTRIMVDDF : 6;            /*!< Low power VDDF trim.                                                      */
    } SIMOBUCK12_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK13;                  /*!< SIMO Buck Compare, Brown out, Active, Low power Trim Control              */

    struct {
      __IOM uint32_t VDDSCOMPTRIMMINUS : 5;     /*!< Static trim to allow separation between low power and active
                                                     rail.                                                                     */
      __IOM uint32_t VDDSCOMPTRIMPLUS : 5;      /*!< Static trim to allow separation when low power GT active rail.            */
      __IOM uint32_t VDDSBRNOUTTRIM : 10;       /*!< Digital brown out max counter value for VDDS rail.                        */
      __IOM uint32_t ACTTRIMVDDS : 6;           /*!< Active VDDS trim.                                                         */
      __IOM uint32_t LPTRIMVDDS : 6;            /*!< Low power VDDS trim.                                                      */
    } SIMOBUCK13_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK14;                  /*!< SIMO Buck Compare, Brown out, Active, Low power and Leakage
                                                     Trim Control                                                              */

