AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
            uint32_t            : 10;
      __IOM uint32_t PWRSWVDDRLDYNSEL : 1;      /*!< override value for pwrsw_vddrl_dynsel                                     */
      __IOM uint32_t PWRSWVDDRLPGN : 1;         /*!< override value for pwrsw_vddrl_pgn                                        */
      __IOM uint32_t PWRSWVDDRLSTATSEL : 1;     /*!< VDDRL power switch static select                                          */
      __IOM uint32_t PWRSWVDDRLOVERRIDE : 1;    /*!< override enable for pwrsw_vddrl_dynsel and pgn                            */
      __IOM uint32_t PWRSWVDDRMDYNSEL : 1;      /*!< override value for pwrsw_vddrm_dynsel                                     */
      __IOM uint32_t PWRSWVDDRMPGN : 1;         /*!< override value for pwrsw_vddrm_pgn                                        */
      __IOM uint32_t PWRSWVDDRMSTATSEL : 1;     /*!< VDDRM power switch static select                                          */
      __IOM uint32_t PWRSWVDDRMOVERRIDE : 1;    /*!< override enable for pwrsw_vddrm_dynsel and pgn                            */
      __IOM uint32_t PWRSWVDDLPGN : 1;          /*!< override value for pwrsw_vddl_pgn                                         */
      __IOM uint32_t PWRSWVDDLOVERRIDE : 1;     /*!< override enable for pwrsw_vddl_pgn                                        */
            uint32_t            : 6;
      __IOM uint32_t FORCEVDDRMVDDF : 1;        /*!< Setting this bit selects VDDF for VDDRM when Flash is off. This
                                                     is valid for only normal operational mode (i.e. without
                                                     overrides).                                                               */
      __IOM uint32_t FORCEVDDRMOFF : 1;         /*!< Setting this bit forces VDDRM to be open when Flash is off.
                                                     This is valid for only normal operational mode (i.e. without
                                                     overrides).                                                               */
      __IOM uint32_t SHORTVDDCVDDCLVOREN : 1;   /*!< pwrsw short override select for vddc/vddclv                               */
      __IOM uint32_t SHORTVDDCVDDCLVORVAL : 1;  /*!< pwrsw short override value for vddc/vddclv                                */
      __IOM uint32_t SHORTVDDFVDDSOREN : 1;     /*!< pwrsw short override select for vddf/vdds                                 */
      __IOM uint32_t SHORTVDDFVDDSORVAL : 1;    /*!< pwrsw short override value for vddf/vdds                                  */
    } PWRSW1_b;
  } ;
  __IM  uint32_t  RESERVED20;

  union {
    __IOM uint32_t USBRSTCTRL;                  /*!< USB Reset Startup Control                                                 */

    struct {
      __IOM uint32_t USBRSTENABLE : 1;          /*!< This bit enables this register control. If set to '1', the reset
                                                     release bits will be active. If set to '0', this register
                                                     is not controlling the USB override bits.                                 */
      __IOM uint32_t USBPORRSTRELEASE : 1;      /*!< Set this bit to '1' after USB power domain is up. This will
                                                     release the reset override condition                                      */
      __IOM uint32_t USBUTMIRSTRELEASE : 1;     /*!< Set this bit to '1' after USB power domain is up. This will
                                                     release the reset override condition                                      */
            uint32_t            : 29;
    } USBRSTCTRL_b;
  } ;
  __IM  uint32_t  RESERVED21[7];

  union {
    __IOM uint32_t FLASHWPROT0;                 /*!< These bits write-protect flash in 16KB chunks, but cpu still
                                                     can excute from that that memory.                                         */

    struct {
      __IOM uint32_t FW0BITS    : 32;           /*!< Write protect flash 0x00000000 - 0x0007FFFF. Each bit provides
                                                     write protection for 16KB chunks of flash data space. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHWPROT0_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT1;                 /*!< These bits write-protect flash in 16KB chunks, but cpu still
                                                     can excute from that that memory.                                         */

    struct {
      __IOM uint32_t FW1BITS    : 32;           /*!< Write protect flash 0x00080000 - 0x000FFFFF. Each bit provides
                                                     write protection for 16KB chunks of flash data space. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHWPROT1_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT2;                 /*!< These bits write-protect flash in 16KB chunks, but cpu still
                                                     can excute from that that memory.                                         */

    struct {
      __IOM uint32_t FW2BITS    : 32;           /*!< Write protect flash 0x00100000 - 0x0017FFFF. Each bit provides
                                                     write protection for 16KB chunks of flash data space. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHWPROT2_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT3;                 /*!< These bits write-protect flash in 16KB chunks, but cpu still
                                                     can excute from that that memory.                                         */

