AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t SRAMWPROT3 : 32;           /*!< Write protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu writes, when
                                                     set to 0, DMA may write the region.                                       */
    } SRAMWPROT3_b;
  } ;

  union {
    __IOM uint32_t SRAMWPROT4;                  /*!< These bits write-protect system SRAM from non-cpu access in
                                                     16KB chunks.                                                              */

    struct {
      __IOM uint32_t SRAMWPROT4 : 32;           /*!< Write protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu writes, when
                                                     set to 0, DMA may write the region.                                       */
    } SRAMWPROT4_b;
  } ;

  union {
    __IOM uint32_t SRAMWPROT5;                  /*!< These bits write-protect system SRAM from non-cpu access in
                                                     16KB chunks.                                                              */

    struct {
      __IOM uint32_t SRAMWPROT5 : 32;           /*!< Write protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu writes, when
                                                     set to 0, DMA may write the region.                                       */
    } SRAMWPROT5_b;
  } ;
  __IM  uint32_t  RESERVED22[4];

  union {
    __IOM uint32_t SRAMRPROT0;                  /*!< These bits read-protect system SRAM from non-cpu access in 16KB
                                                     chunks.                                                                   */

    struct {
      __IOM uint32_t SRAMRPROT0 : 32;           /*!< Read protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu reads, when set
                                                     to 0, DMA may read the region.                                            */
    } SRAMRPROT0_b;
  } ;

  union {
    __IOM uint32_t SRAMRPROT1;                  /*!< These bits read-protect system SRAM from non-cpu access in 16KB
                                                     chunks.                                                                   */

    struct {
      __IOM uint32_t SRAMRPROT1 : 32;           /*!< Read protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu reads, when set
                                                     to 0, DMA may read the region.                                            */
    } SRAMRPROT1_b;
  } ;

  union {
    __IOM uint32_t SRAMRPROT2;                  /*!< These bits read-protect system SRAM from non-cpu access in 16KB
                                                     chunks.                                                                   */

    struct {
      __IOM uint32_t SRAMRPROT2 : 32;           /*!< Read protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu reads, when set
                                                     to 0, DMA may read the region.                                            */
    } SRAMRPROT2_b;
  } ;

  union {
    __IOM uint32_t SRAMRPROT3;                  /*!< These bits read-protect system SRAM from non-cpu access in 16KB
                                                     chunks.                                                                   */

    struct {
      __IOM uint32_t SRAMRPROT3 : 32;           /*!< Read protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu reads, when set
                                                     to 0, DMA may read the region.                                            */
    } SRAMRPROT3_b;
  } ;

  union {
    __IOM uint32_t SRAMRPROT4;                  /*!< These bits read-protect system SRAM from non-cpu access in 16KB
                                                     chunks.                                                                   */

    struct {
      __IOM uint32_t SRAMRPROT4 : 32;           /*!< Read protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu reads, when set
                                                     to 0, DMA may read the region.                                            */
    } SRAMRPROT4_b;
  } ;

  union {
    __IOM uint32_t SRAMRPROT5;                  /*!< These bits read-protect system SRAM from non-cpu access in 16KB
                                                     chunks.                                                                   */

