AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t SDIO1SYSCLKEN : 1;         /*!< SDIO1 system clock enable.                                                */
      __IOM uint32_t SDIO1XINCLKEN : 1;         /*!< SDIO1 serial clock source enable.                                         */
      __IOM uint32_t SDIO1ITAPCHGWIN : 1;       /*!< This is used to gate the output of the Tap Delay lines so as
                                                     to avoid glithches being propagated into the Core. This
                                                     signal should be asserted few clocks before the itapdlysel
                                                     changes and should be asserted for few clocks after.                      */
      __IOM uint32_t SDIO1ITAPDLYENA : 1;       /*!< Used to enable selective Tap delay line on the Looped back SD
                                                     Clock (rxclk_in). This signal along with the itapdlysel[4:0]
                                                     selects the the amount of delay to be inserted on the line.
                                                     When Tuning is enabled (for SDR104 and optionally for SDR50),
                                                     this signal is ignored and internalcontrols are used instead.
                                                     This should not be asserted when operating in DS mode.                    */
      __IOM uint32_t SDIO1ITAPDLYSEL : 5;       /*!< Selects one of the 32 Taps on the rxclk_in line. This is effective
                                                     only when itapdlyena is asserted and Tuning is not enabled.               */
      __IOM uint32_t SDIO1OTAPDLYENA : 1;       /*!< Used to enable the selective Tap delay on the sdcard_clk so
                                                     as to generate the delayed sdcard_clk. This is used to
                                                     latch the CMD/DAT outputs to generate delay on them w.r.t
                                                     CLK going out. This signal along with otapdlysel[3:0] selects
                                                     the amount of delay to be inserted on the Clock line. This
                                                     signal should not be asserted when operating in DS mode.                  */
      __IOM uint32_t SDIO1OTAPDLYSEL : 4;       /*!< Selects one of the 16 Taps on the sdcard_clk. This is effective
                                                     only when otapdlyena is asserted.                                         */
      __IOM uint32_t SDIO1ASYNCWKUPENA : 1;     /*!< SDIO1 asynchronous wakeup mode. 0: Synchronous wakeup mode,
                                                     1: Asynchronous wakeup mode                                               */
      __IOM uint32_t SDIO1XINCLKSEL : 2;        /*!< Select clock source for SDIO1 xin_clk.                                    */
      __IOM uint32_t SDIO1CMDOPENDRAINEN : 1;   /*!< SDIO1 CMD line configured as open-drian. 0: Push-pull mode,
                                                     1: Open-drain mode                                                        */
      __IOM uint32_t SDIO1DATOPENDRAINEN : 1;   /*!< SDIO1 DAT line configured as open-drian. 0: Push-pull mode,
                                                     1: Open-drain mode                                                        */
            uint32_t            : 13;
    } SDIO1CTRL_b;
  } ;

  union {
    __IOM uint32_t PDMCTRL;                     /*!< PDM Control                                                               */

    struct {
      __IOM uint32_t PDMGLOBALEN : 1;           /*!< PDM global enable to allow all PDMs to have synchronized interface
                                                     clocks and FIFO sampling.                                                 */
            uint32_t            : 31;
    } PDMCTRL_b;
  } ;
  __IM  uint32_t  RESERVED26[16];

  union {
    __IOM uint32_t DSIBIST;                     /*!< DPHY BIST register for the Analog testing                                 */

    struct {
      __IOM uint32_t DSIBISTLP  : 1;            /*!< To enable the BIST this bit (dln_loop_back in hardware) needs
                                                     to be set to 1. This signal internally asserts the clock
                                                     for the BIST modules.                                                     */
      __IOM uint32_t DSIBISTFORCEERR : 1;       /*!< bist_force_error in hardware                                              */
      __IOM uint32_t DSIBISTMODE : 2;           /*!< {bist_en_esc_lp, bist_en_esc_hs} in hardware.                             */
            uint32_t            : 4;
      __IOM uint32_t DSIBISTSEED : 8;           /*!< bist_seed in hardware                                                     */
            uint32_t            : 11;
      __IOM uint32_t DSIBISTERRRXHSSYNC : 1;    /*!< Indicates the sync error conditions in HS mode.                           */
      __IOM uint32_t DSIBISTERRRXHS : 1;        /*!< Indicates the normal error conditions in HS mode.                         */
      __IOM uint32_t DSIBISTERRRXESCSYNC : 1;   /*!< Indicates the sync error conditions in LP mode.                           */
      __IOM uint32_t DSIBISTERRRXESC : 1;       /*!< Indicates the normal error conditions in LP mode. Also indicates
                                                     the RxClkEsc mode error.                                                  */
      __IOM uint32_t DSIBISTDONE : 1;           /*!< Status of the BIST engine, indicates the completion as well
                                                     as error conditions.                                                      */
    } DSIBIST_b;
  } ;

  union {
    __IOM uint32_t MMSMISCCTRL;                 /*!< MM Sytem Miscellaneous Control                                            */

