AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t GFXSRAMCHK : 1;            /*!< Control bit for the sram power domain checking in GFX.                    */
      __IOM uint32_t DISPSRAMCHK : 1;           /*!< Control bit for the sram power domain checking in DC.                     */
            uint32_t            : 30;
    } MMSMISCCTRL_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT4;                 /*!< These bits write-protect flash in 16KB chunks, but cpu still
                                                     can excute from that that memory.                                         */

    struct {
      __IOM uint32_t FW4BITS    : 32;           /*!< Write protect flash 0x00200000 - 0x0027FFFF. Each bit provides
                                                     write protection for 16KB chunks of flash data space. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHWPROT4_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT5;                 /*!< These bits write-protect flash in 16KB chunks, but cpu still
                                                     can excute from that that memory.                                         */

    struct {
      __IOM uint32_t FW5BITS    : 32;           /*!< Write protect flash 0x00280000 - 0x002FFFFF. Each bit provides
                                                     write protection for 16KB chunks of flash data space. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHWPROT5_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT6;                 /*!< These bits write-protect flash in 16KB chunks, but cpu still
                                                     can excute from that that memory.                                         */

    struct {
      __IOM uint32_t FW6BITS    : 32;           /*!< Write protect flash 0x00300000 - 0x0037FFFF. Each bit provides
                                                     write protection for 16KB chunks of flash data space. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHWPROT6_b;
  } ;

  union {
    __IOM uint32_t FLASHWPROT7;                 /*!< These bits write-protect flash in 16KB chunks, but cpu still
                                                     can excute from that that memory.                                         */

    struct {
      __IOM uint32_t FW7BITS    : 32;           /*!< Write protect flash 0x00380000 - 0x004FFFFF. Each bit provides
                                                     write protection for 16KB chunks of flash data space. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHWPROT7_b;
  } ;

  union {
    __IOM uint32_t FLASHRPROT4;                 /*!< These bits read-protect flash in 16KB chunks, but cpu still
                                                     can excute from that that memory.                                         */

    struct {
      __IOM uint32_t FR4BITS    : 32;           /*!< Copy (read) protect flash 0x00200000 - 0x0027FFFF. Each bit
                                                     provides read protection for 16KB chunks of flash. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHRPROT4_b;
  } ;

  union {
    __IOM uint32_t FLASHRPROT5;                 /*!< These bits read-protect flash in 16KB chunks, but cpu still
                                                     can excute from that that memory.                                         */

    struct {
      __IOM uint32_t FR5BITS    : 32;           /*!< Copy (read) protect flash 0x00280000 - 0x002FFFFF. Each bit
                                                     provides read protection for 16KB chunks of flash. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHRPROT5_b;
  } ;

  union {
    __IOM uint32_t FLASHRPROT6;                 /*!< These bits read-protect flash in 16KB chunks, but cpu still
                                                     can excute from that that memory.                                         */

    struct {
      __IOM uint32_t FR6BITS    : 32;           /*!< Copy (read) protect flash 0x00300000 - 0x0037FFFF. Each bit
                                                     provides read protection for 16KB chunks of flash. Bits
                                                     are cleared by writing a 1 to the bit. When read, 0 indicates
                                                     the region is protected. Bits are sticky (can be set when
                                                     PROTLOCK is 1, but only cleared by reset)                                 */
    } FLASHRPROT6_b;
  } ;

  union {
    __IOM uint32_t FLASHRPROT7;                 /*!< These bits read-protect flash in 16KB chunks, but cpu still
                                                     can excute from that that memory.                                         */

