AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t CQEN       : 1;            /*!< Command queue enable. When set, will enable the processing of
                                                     the command queue                                                         */
      __IOM uint32_t CQPRI      : 1;            /*!< Sets the Priority of the command queue DMA request                        */
      __IOM uint32_t CQPWROFF   : 1;            /*!< Power off MSPI domain upon completion of DMA operation.                   */
      __IOM uint32_t CQAUTOCLEARMASK : 1;       /*!< Enable clear of CQMASK after each pause operation. This may
                                                     be useful when using software flags to pause CQ.                          */
      __IOM uint32_t CQPAUSEOP  : 1;            /*!< To pause Command Queue Operation                                          */
            uint32_t            : 27;
    } CQCFG_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t CQADDR;                      /*!< Location of the command queue in SRAM or flash memory. This
                                                     register will increment as CQ operations commence. Software
                                                     should only write CQADDR when CQEN is disabled, however
                                                     the command queue script itself may update CQADDR in order
                                                     to perform queue management functions (like resetting the
                                                     pointers)                                                                 */

    struct {
      __IOM uint32_t CQADDR     : 32;           /*!< Address of command queue buffer in SRAM or flash. The buffer
                                                     address must be aligned to a word boundary.                               */
    } CQADDR_b;
  } ;

  union {
    __IOM uint32_t CQSTAT;                      /*!< Command Queue Status                                                      */

    struct {
      __IOM uint32_t CQTIP      : 1;            /*!< Command queue Transfer In Progress indicator. 1 will indicate
                                                     that a CQ transfer is active and this will remain active
                                                     even when paused waiting for external event.                              */
      __IOM uint32_t CQCPL      : 1;            /*!< Command queue operation Complete. This signals the end of the
                                                     command queue operation.                                                  */
      __IOM uint32_t CQERR      : 1;            /*!< Command queue processing Error. This active high bit signals
                                                     that an error was encountered during the CQ operation.                    */
      __IOM uint32_t CQPAUSED   : 1;            /*!< Command queue is currently paused status.                                 */
            uint32_t            : 28;
    } CQSTAT_b;
  } ;

  union {
    __IOM uint32_t CQFLAGS;                     /*!< Command Queue Flags                                                       */

    struct {
      __IOM uint32_t CQFLAGS    : 16;           /*!< Current flag status (read-only). Bits [7:0] are software controllable
                                                     and bits [15:8] are hardware status.                                      */
            uint32_t            : 16;
    } CQFLAGS_b;
  } ;

  union {
    __IOM uint32_t CQSETCLEAR;                  /*!< Command Queue Flag Set/Clear                                              */

    struct {
      __IOM uint32_t CQFSET     : 8;            /*!< Set CQFlag status bits. Set has priority over clear if both
                                                     are high.                                                                 */
      __IOM uint32_t CQFTOGGLE  : 8;            /*!< Toggle CQFlag status bits                                                 */
      __IOM uint32_t CQFCLR     : 8;            /*!< Clear CQFlag status bits.                                                 */
            uint32_t            : 8;
    } CQSETCLEAR_b;
  } ;

  union {
    __IOM uint32_t CQPAUSE;                     /*!< Command Queue Pause Mask                                                  */

    struct {
      __IOM uint32_t CQMASK     : 16;           /*!< CQ will pause processing when ALL specified events are satisfied
                                                     -- i.e. when (CQMASK and CQPAUSE)==CQMASK.                                */
            uint32_t            : 16;
    } CQPAUSE_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t CQCURIDX;                    /*!< This register can be used in conjunction with the CQENDIDX register
                                                     to manage the command queue. Typically software will initialize
                                                     the CQCURIDX and CQENDIDX to the same value, which will
                                                     cause the CQ to be paused when enabled. Software may then
                                                     add entries to the command queue (in SRAM) and update CQENDIDX.
                                                     The command queue operations will then increment CQCURIDX
                                                     as it processes operations. Once CQCURIDX==CQENDIDX, the
                                                     command queue hardware will automatically pause since no
                                                     additional operations have been appended to the queue.                    */

    struct {
      __IOM uint32_t CQCURIDX   : 8;            /*!< Can be used to indicate the current position of the command
                                                     queue by having CQ operations write this field. A CQ hardware
                                                     status flag indicates when CURIDX and ENDIDX are not equal,
                                                     allowing SW to pause the CQ processing until the end index
                                                     is updated.                                                               */
            uint32_t            : 24;
    } CQCURIDX_b;
  } ;

  union {
    __IOM uint32_t CQENDIDX;                    /*!< Command Queue End Index                                                   */

