AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t CLKEN      : 1;            /*!< PDM Clock enable.If multiple clocks are enabled, priority is
                                                     HFRC2, HF XTAL, HFRC.                                                     */
      __IOM uint32_t CLKSEL     : 3;            /*!< PDM Master Clock select (24.576MHz).                                      */
      __IOM uint32_t RSTB       : 1;            /*!< Reset IP core. 0 puts the core in reset; 1 takes the core out
                                                     of reset.                                                                 */
      __IOM uint32_t PCMPACK    : 1;            /*!< Enable PCM packing. Only 24-bit unpacked mode supported.                  */
      __IOM uint32_t EN         : 1;            /*!< PDM enable register                                                       */
      __IOM uint32_t CLKGATEMODE : 1;           /*!< Clock gating mode. 0 = clock always enabled when DMA is enabled.
                                                     1 = clock is enabled when there is actual DMA transfer                    */
            uint32_t            : 24;
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t CORECFG0;                    /*!< PDM to PCM Core Configuration                                             */

    struct {
      __IOM uint32_t LRSWAP     : 1;            /*!< Left/Right channel swap when = 1                                          */
      __IOM uint32_t SOFTMUTE   : 1;            /*!< Soft mute enable when = 1                                                 */
      __IOM uint32_t SCYCLES    : 3;            /*!< Set number of PDMA_CKO cycles during gain setting changes or
                                                     soft mute                                                                 */
      __IOM uint32_t HPGAIN     : 4;            /*!< Adjust High Pass filter coefficients                                      */
      __IOM uint32_t ADCHPD     : 1;            /*!< Disable high pass filter when = 1                                         */
      __IOM uint32_t MCLKDIV    : 4;            /*!< PDMA_CKO frequency divisor.MCLKDIV > 0. MCLKDIV = 0 PROHIBITED.MCLKDIV
                                                     = (PDM_CLK /Fsin / (DIVMCLKQ + 1)) -1                                     */
      __IOM uint32_t SINCRATE   : 7;            /*!< Synchronous decimation rate.SINC_RATE = OSR /2. OSR = Fsin /
                                                     Fsout.Even values between 16 and 64 allowed.                              */
      __IOM uint32_t PGAL       : 5;            /*!< Left Channel PGA Gain: +1.5dB/step, -12dB ~ +34.5dB;enum name
                                                     = M12_0DB value = 0x0 desc = Left channel PGA gain = -12.0
                                                     dB                                                                        */
      __IOM uint32_t PGAR       : 5;            /*!< Right Channel PGA Gain:+1.5dB/step, -12dB ~ +34.5dB;                      */
            uint32_t            : 1;
    } CORECFG0_b;
  } ;

  union {
    __IOM uint32_t CORECFG1;                    /*!< PDM to PCM Extra Configuration                                            */

    struct {
      __IOM uint32_t PCMCHSET   : 2;            /*!< PCM output chanel 0xsetting                                               */
      __IOM uint32_t DIVMCLKQ   : 2;            /*!< Divide down ratio for generating internal master MCLKQ.DIVMCLKQ
                                                     > 0. DIVMCLKQ = 0 PROHIBITED.Recommend value of 1.Fmclkq
                                                     = Fpdmclk/(DIVMCLKQ+1).                                                   */
      __IOM uint32_t CKODLY     : 3;            /*!< PDMA_CKO clock phase delay in terms of PDMCLK period to internal
                                                     sampler                                                                   */
      __IOM uint32_t SELSTEP    : 1;            /*!< Fine grain step size for smooth PGA or Softmute attenuation
                                                     transition0: 0.13dB1: 0.26dB                                              */
            uint32_t            : 24;
    } CORECFG1_b;
  } ;

  union {
    __IOM uint32_t CORECTRL;                    /*!< PDM to PCM Control                                                        */

    struct {
      __IOM uint32_t CORECTRL   : 32;           /*!< Overall control of PDM core. Internal use only                            */
    } CORECTRL_b;
  } ;

  union {
    __IOM uint32_t FIFOCNT;                     /*!< FIFO count                                                                */

    struct {
      __IOM uint32_t FIFOCNT    : 6;            /*!< Valid 32-bit entries currently in the FIFO.                               */
            uint32_t            : 26;
    } FIFOCNT_b;
  } ;

  union {
    __IOM uint32_t FIFOREAD;                    /*!< FIFO Read                                                                 */

    struct {
      __IOM uint32_t FIFOREAD   : 32;           /*!< FIFO read data.                                                           */
    } FIFOREAD_b;
  } ;

  union {
    __IOM uint32_t FIFOFLUSH;                   /*!< FIFO Flush                                                                */

    struct {
      __IOM uint32_t FIFOFLUSH  : 1;            /*!< FIFO FLUSH.                                                               */
            uint32_t            : 31;
    } FIFOFLUSH_b;
  } ;

  union {
    __IOM uint32_t FIFOTHR;                     /*!< FIFO Threshold                                                            */

    struct {
      __IOM uint32_t FIFOTHR    : 5;            /*!< FIFO Threshold value. When the FIFO count is equal to, or larger
                                                     than this value (in words), a THR interrupt is generated
                                                     (if enabled). If used for DMA purposes then only supported
                                                     values are 0x4, 0x8, 0xc, 0x10, 0x14, 0x18 and 0x1C.                      */
            uint32_t            : 27;
    } FIFOTHR_b;
  } ;
  __IM  uint32_t  RESERVED[56];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

