AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t LTARGADDR  : 32;           /*!< DMA Target Address. This register is not updated with the current
                                                     address of the DMA, but will remain static with the original
                                                     address during the DMA transfer.                                          */
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMASTAT;                     /*!< DMA Status                                                                */

    struct {
      __IOM uint32_t DMATIP     : 1;            /*!< DMA Transfer In Progress                                                  */
      __IOM uint32_t DMACPL     : 1;            /*!< DMA Transfer Complete                                                     */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error                                                                 */
            uint32_t            : 29;
    } DMASTAT_b;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t DMATARGADDRNEXT;             /*!< DMA Target Address                                                        */

    struct {
      __IOM uint32_t TARGADDRNEXT : 32;         /*!< Next DMA Target Address. This register is not updated with the
                                                     current address of the DMA, but will remain static with
                                                     the original address during the DMA transfer.                             */
    } DMATARGADDRNEXT_b;
  } ;

  union {
    __IOM uint32_t DMATOTCOUNTNEXT;             /*!< Next DMA Total Count                                                      */

    struct {
      __IOM uint32_t TOTCOUNTNEXT : 20;         /*!< Next Total Transfer Count.                                                */
            uint32_t            : 12;
    } DMATOTCOUNTNEXT_b;
  } ;

  union {
    __IOM uint32_t DMAENNEXTCTRL;               /*!< Enable Next DMA Job                                                       */

    struct {
      __IOM uint32_t DMAENNEXT  : 1;            /*!< SW set this bit after setting up TOTCOUNTNEXT and TARGADDRNEXT
                                                     register fields. HW will then auto-load TOTCOUNTNEXT and
                                                     TARGADDRNEXT values when its current DMA job completes,
                                                     and auto-clear this DMAENNEXT bit. SW can then reload a
                                                     new DMA job with new TOTCOUNTNEXT and TARGADDRNEXT values.                */
            uint32_t            : 31;
    } DMAENNEXTCTRL_b;
  } ;
  __IM  uint32_t  RESERVED4[57];

  union {
    __IOM uint32_t DMATOTCOUNT;                 /*!< DMA Total Transfer Count                                                  */

    struct {
      __IOM uint32_t TOTCOUNT   : 20;           /*!< Total Transfer Count. The transfer count must be a multiple
                                                     of the THR setting to avoid DMA overruns.                                 */
            uint32_t            : 12;
    } DMATOTCOUNT_b;
  } ;
} PDM0_Type;                                    /*!< Size = 596 (0x254)                                                        */



/* =========================================================================================================================== */
/* ================                                          PWRCTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief PWR Controller Register Bank (PWRCTRL)
  */

typedef struct {                                /*!< PWRCTRL Structure                                                         */

  union {
    __IOM uint32_t MCUPERFREQ;                  /*!< This register provides the performance mode knobs for MCU. S/w
                                                     should write the *PERFREQ field to desired mode and wait
                                                     for the *PERFACK and check for the *PERFSTATUS. Some times
                                                     system may not allow certain modes but *PERFACK should
                                                     always follow *PERFREQ change.                                            */

    struct {
      __IOM uint32_t MCUPERFREQ : 2;            /*!< MCU Performance mode request                                              */
      __IOM uint32_t MCUPERFACK : 1;            /*!< Indicates the MCU performance status indicated in STATUS register
                                                     is valid.                                                                 */
      __IOM uint32_t MCUPERFSTATUS : 2;         /*!< MCU Performance mode request                                              */
            uint32_t            : 24;
      __IOM uint32_t PWRENMCUE  : 1;            /*!< Powerup MCUE power domain                                                 */
      __IOM uint32_t PWRSTMCUE  : 2;            /*!< Power Status MCUE subsystem                                               */
    } MCUPERFREQ_b;
  } ;

  union {
    __IOM uint32_t DEVPWREN;                    /*!< This enables various peripherals power domains.                           */

    struct {
      __IOM uint32_t PWRENIOS0  : 1;            /*!< Power up IO Slave 0                                                       */
      __IOM uint32_t PWRENIOM0  : 1;            /*!< Power up IO Master 0                                                      */
      __IOM uint32_t PWRENIOM1  : 1;            /*!< Power up IO Master 1                                                      */
      __IOM uint32_t PWRENIOM2  : 1;            /*!< Power up IO Master 2                                                      */
      __IOM uint32_t PWRENIOM3  : 1;            /*!< Power up IO Master 3                                                      */
      __IOM uint32_t PWRENIOM4  : 1;            /*!< Power up IO Master 4                                                      */
      __IOM uint32_t PWRENIOM5  : 1;            /*!< Power up IO Master 5                                                      */
      __IOM uint32_t PWRENIOM6  : 1;            /*!< Power up IO Master 6                                                      */
      __IOM uint32_t PWRENIOM7  : 1;            /*!< Power up IO Master 7                                                      */
      __IOM uint32_t PWRENUART0 : 1;            /*!< Power up UART Controller 0                                                */
      __IOM uint32_t PWRENUART1 : 1;            /*!< Power up UART Controller 1                                                */
      __IOM uint32_t PWRENUART2 : 1;            /*!< Power up UART Controller 2                                                */
      __IOM uint32_t PWRENUART3 : 1;            /*!< Power up UART Controller 3                                                */
      __IOM uint32_t PWRENADC   : 1;            /*!< Power up ADC Digital Controller                                           */
      __IOM uint32_t PWRENMSPI0 : 1;            /*!< Power up MSPI Controller0                                                 */
      __IOM uint32_t PWRENMSPI1 : 1;            /*!< Power up MSPI Controller1                                                 */
      __IOM uint32_t PWRENMSPI2 : 1;            /*!< Power up MSPI Controller2                                                 */
      __IOM uint32_t PWRENMSPI3 : 1;            /*!< Power up MSPI Controller3                                                 */
      __IOM uint32_t PWRENGFX   : 1;            /*!< Power up GFX controller                                                   */
      __IOM uint32_t PWRENDISP  : 1;            /*!< Power up DISP controller                                                  */
      __IOM uint32_t PWRENDISPPHY : 1;          /*!< Power up DISP PHY                                                         */
      __IOM uint32_t PWRENCRYPTO : 1;           /*!< Power up CRYPTO module                                                    */
      __IOM uint32_t PWRENSDIO0 : 1;            /*!< Power up SDIO0 controller                                                 */
      __IOM uint32_t PWRENSDIO1 : 1;            /*!< Power up SDIO1 controller                                                 */
      __IOM uint32_t PWRENUSB   : 1;            /*!< Power up USB controller                                                   */
      __IOM uint32_t PWRENUSBPHY : 1;           /*!< Power up USB PHY                                                          */
      __IOM uint32_t PWRENDBG   : 1;            /*!< Powerup DBG power domain                                                  */
      __IOM uint32_t PWRENOTP   : 1;            /*!< Powerup OTP power domain                                                  */
      __IOM uint32_t PWRENIOSFD0 : 1;           /*!< Power up IO FD Slave 0                                                    */
      __IOM uint32_t PWRENIOSFD1 : 1;           /*!< Power up IO FD Slave 1                                                    */
            uint32_t            : 2;
    } DEVPWREN_b;
  } ;

  union {
    __IOM uint32_t DEVPWRSTATUS;                /*!< This provides the power status for the peripheral device domains
                                                     controlled through DEVPWREN register. Value of 1 means
                                                     the device is powred up and ready to be used and 0 means
                                                     its not powered up.                                                       */

