AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t PWRSTIOS0  : 1;            /*!< Power status IO Slave 0                                                   */
      __IOM uint32_t PWRSTIOM0  : 1;            /*!< Power status IO Master 0                                                  */
      __IOM uint32_t PWRSTIOM1  : 1;            /*!< Power status IO Master 1                                                  */
      __IOM uint32_t PWRSTIOM2  : 1;            /*!< Power status IO Master 2                                                  */
      __IOM uint32_t PWRSTIOM3  : 1;            /*!< Power status IO Master 3                                                  */
      __IOM uint32_t PWRSTIOM4  : 1;            /*!< Power status IO Master 4                                                  */
      __IOM uint32_t PWRSTIOM5  : 1;            /*!< Power Status IO Master 5                                                  */
      __IOM uint32_t PWRSTIOM6  : 1;            /*!< Power Status IO Master 6                                                  */
      __IOM uint32_t PWRSTIOM7  : 1;            /*!< Power Status IO Master 7                                                  */
      __IOM uint32_t PWRSTUART0 : 1;            /*!< Power Status UART Controller 0                                            */
      __IOM uint32_t PWRSTUART1 : 1;            /*!< Power Status UART Controller 1                                            */
      __IOM uint32_t PWRSTUART2 : 1;            /*!< Power Status UART Controller 2                                            */
      __IOM uint32_t PWRSTUART3 : 1;            /*!< Power Status UART Controller 3                                            */
      __IOM uint32_t PWRSTADC   : 1;            /*!< Power Status ADC Digital Controller                                       */
      __IOM uint32_t PWRSTMSPI0 : 1;            /*!< Power Status MSPI Controller0                                             */
      __IOM uint32_t PWRSTMSPI1 : 1;            /*!< Power Status MSPI Controller1                                             */
      __IOM uint32_t PWRSTMSPI2 : 1;            /*!< Power Status MSPI Controller2                                             */
      __IOM uint32_t PWRSTMSPI3 : 1;            /*!< Power Status MSPI Controller3                                             */
      __IOM uint32_t PWRSTGFX   : 1;            /*!< Power Status GFX controller                                               */
      __IOM uint32_t PWRSTDISP  : 1;            /*!< Power Status DISP controller                                              */
      __IOM uint32_t PWRSTDISPPHY : 1;          /*!< Power Status DISP PHY                                                     */
      __IOM uint32_t PWRSTCRYPTO : 1;           /*!< Power Status CRYPTO module                                                */
      __IOM uint32_t PWRSTSDIO0 : 1;            /*!< Power Status SDIO0 controller                                             */
      __IOM uint32_t PWRSTSDIO1 : 1;            /*!< Power Status SDIO1 controller                                             */
      __IOM uint32_t PWRSTUSB   : 1;            /*!< Power Status USB controller                                               */
      __IOM uint32_t PWRSTUSBPHY : 1;           /*!< Power Status USB PHY                                                      */
      __IOM uint32_t PWRSTDBG   : 1;            /*!< Power Status DBG subsystem                                                */
      __IOM uint32_t PWRSTOTP   : 1;            /*!< Power Status OTP                                                          */
      __IOM uint32_t PWRSTIOSFD0 : 1;           /*!< Power status IO FD Slave 0                                                */
      __IOM uint32_t PWRSTIOSFD1 : 1;           /*!< Power status IO FD Slave 1                                                */
            uint32_t            : 2;
    } DEVPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t AUDSSPWREN;                  /*!< This enables various power domains in audio subsystem.                    */

    struct {
            uint32_t            : 2;
      __IOM uint32_t PWRENPDM0  : 1;            /*!< Power up audio subsystem PDM0 domain                                      */
            uint32_t            : 3;
      __IOM uint32_t PWRENI2S0  : 1;            /*!< Power up audio subsystem I2S0 domain                                      */
      __IOM uint32_t PWRENI2S1  : 1;            /*!< Power up audio subsystem I2S1 domain                                      */
            uint32_t            : 2;
      __IOM uint32_t PWRENAUDADC : 1;           /*!< Power up audio subsystem ADC domain                                       */
            uint32_t            : 21;
    } AUDSSPWREN_b;
  } ;

  union {
    __IOM uint32_t AUDSSPWRSTATUS;              /*!< This provides the power status for the peripheral domains controlled
                                                     through AUDSSPWREN register. Value of 1 means the device
                                                     is powred up and ready to be used and 0 means its not powered
                                                     up.                                                                       */

    struct {
            uint32_t            : 2;
      __IOM uint32_t PWRSTPDM0  : 1;            /*!< Power Status audio subsystem PDM0 domain                                  */
            uint32_t            : 3;
      __IOM uint32_t PWRSTI2S0  : 1;            /*!< Power Status audio subsystem I2S0 domain                                  */
      __IOM uint32_t PWRSTI2S1  : 1;            /*!< Power Status audio subsystem I2S1 domain                                  */
            uint32_t            : 2;
      __IOM uint32_t PWRSTAUDADC : 1;           /*!< Power Status audio subsystem ADC domain                                   */
            uint32_t            : 21;
    } AUDSSPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t MEMPWREN;                    /*!< Enables individual banks of memories. When a PWREN field is
                                                     set, power is enabled to the memory or specific bank of
                                                     memory. This register works in conjunction with the MEMRETCFG
                                                     register. If a field in this register is not set, then
                                                     power is always disabled to the memory bank. In the case
                                                     of NVM, to enable NVM1, NVM0 must also be enabled. Disabling
                                                     power to NVM0 also disables power to NVM1.                                */

