AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t LPOVRTHRESHVDDS : 32;      /*!< vdds lp override threshold for ton counter comparator                     */
    } LPOVRTHRESHVDDS_b;
  } ;

  union {
    __IOM uint32_t LPOVRHYSTCNT;                /*!< Low power override hysteresis count                                       */

    struct {
      __IOM uint32_t LPOVRHYSTCNT : 32;         /*!< lp hysteresis count                                                       */
    } LPOVRHYSTCNT_b;
  } ;

  union {
    __IOM uint32_t LPOVRTHRESHVDDF;             /*!< Low power override for VDDF                                               */

    struct {
      __IOM uint32_t LPOVRTHRESHVDDF : 32;      /*!< vddf lp override threshold for ton counter comparator                     */
    } LPOVRTHRESHVDDF_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t LPOVRTHRESHVDDC;             /*!< Low power override for VDDC                                               */

    struct {
      __IOM uint32_t LPOVRTHRESHVDDC : 32;      /*!< vddc lp override threshold for ton counter comparator                     */
    } LPOVRTHRESHVDDC_b;
  } ;
  __IM  uint32_t  RESERVED7;

  union {
    __IOM uint32_t LPOVRTHRESHVDDCLV;           /*!< Low power override for VDDC_LV                                            */

    struct {
      __IOM uint32_t LPOVRTHRESHVDDCLV : 32;    /*!< vddc_lv lp override threshold for ton counter comparator                  */
    } LPOVRTHRESHVDDCLV_b;
  } ;
  __IM  uint32_t  RESERVED8;

  union {
    __IOM uint32_t LPOVRSTAT;                   /*!< Low power override status register                                        */

    struct {
      __IOM uint32_t LPOVRTRIG  : 1;            /*!< VDDS LP override has been triggered; write 1 to clear                     */
            uint32_t            : 31;
    } LPOVRSTAT_b;
  } ;

  union {
    __IOM uint32_t MRAMEXTCTRL;                 /*!< MRAM control register                                                     */

    struct {
      __IOM uint32_t MRAMTMCCLKGATDIS : 1;      /*!< disable last tmc_clk/tmc_clk_inv clock gate                               */
      __IOM uint32_t MRAMAUTOWAKEUPCTRL : 2;    /*!< over write rst_auto_wk for TMC IP. auto wake up is enabled at
                                                     default. write 0x3 to this field to disable the auto wake
                                                     up.                                                                       */
      __IOM uint32_t MRAMHARDRECALL : 1;        /*!< over write send recall command from hardware side                         */
      __IOM uint32_t MRAMLPRDYNAMIC : 1;        /*!< bypass lpr dynamic mode                                                   */
            uint32_t            : 27;
    } MRAMEXTCTRL_b;
  } ;
  __IM  uint32_t  RESERVED9[13];

  union {
    __IOM uint32_t EMONCTRL;                    /*!< Controls each of the energy monitor conuters                              */

    struct {
      __IOM uint32_t FREEZE     : 8;            /*!< Freeze the counter. Each bit corresponds to a counter. 0: Let
                                                     the counter run. 1: Stop the counter.                                     */
      __IOM uint32_t CLEAR      : 8;            /*!< Clear the counter. Each bit corresponds to a counter. 0: Let
                                                     the counter run run on its input clk. 1: Clear the counter                */
            uint32_t            : 16;
    } EMONCTRL_b;
  } ;

  union {
    __IOM uint32_t EMONCFG0;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL0   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG0_b;
  } ;

  union {
    __IOM uint32_t EMONCFG1;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL1   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG1_b;
  } ;

  union {
    __IOM uint32_t EMONCFG2;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL2   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG2_b;
  } ;

  union {
    __IOM uint32_t EMONCFG3;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL3   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG3_b;
  } ;

  union {
    __IOM uint32_t EMONCFG4;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

    struct {
      __IOM uint32_t EMONSEL4   : 8;            /*!< Power modes for incrementing the counter                                  */
            uint32_t            : 24;
    } EMONCFG4_b;
  } ;

  union {
    __IOM uint32_t EMONCFG5;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

