AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t ALMDATE    : 6;            /*!< Date Alarm. Contains the current value for date alarm.                    */
            uint32_t            : 2;
      __IOM uint32_t ALMMO      : 5;            /*!< Months Alarm. Contains the current value for months alarm.                */
            uint32_t            : 3;
      __IOM uint32_t ALMWKDY    : 3;            /*!< Weekdays Alarm. Contains the current value for weekdays alarm.            */
            uint32_t            : 13;
    } ALMUP_b;
  } ;
  __IM  uint32_t  RESERVED2[114];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t ALM        : 1;            /*!< RTC Alarm interrupt                                                       */
            uint32_t            : 31;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t ALM        : 1;            /*!< RTC Alarm interrupt                                                       */
            uint32_t            : 31;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t ALM        : 1;            /*!< RTC Alarm interrupt                                                       */
            uint32_t            : 31;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t ALM        : 1;            /*!< RTC Alarm interrupt                                                       */
            uint32_t            : 31;
    } INTSET_b;
  } ;
} RTC_Type;                                     /*!< Size = 528 (0x210)                                                        */



/* =========================================================================================================================== */
/* ================                                           SDIO0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief SDIO Control Registers (SDIO0)
  */

typedef struct {                                /*!< SDIO0 Structure                                                           */

  union {
    __IOM uint32_t SDMA;                        /*!< SDMA system address                                                       */

    struct {
      __IOM uint32_t SDMASYSTEMADDRESS : 32;    /*!< This register contains the physical system memory address used
                                                     for DMA transfers or the second argument for the Auto CMD23.
                                                     (1) SDMA System Address This register contains the system
                                                     memory address for a SDMA transfer. When the Host Controller
                                                     stops a SDMA transfer, this register shall point to the
                                                     system address of the next contiguous data position. It
                                                     can be accessed only if no transaction is executing (i.e.,
                                                     after a transaction has stopped). Read operations during
                                                     transfers may return an invalid value. The Host Driver
                                                     shall initialize this register before starting a SDMA transaction.
                                                     After SDMA has stopped, the next system address of the
                                                     next contiguous data position can be read from this register.
                                                     The SDMA transfer waits at the every boundary specified
                                                     by the Host SDMA Buffer Boundary in the Block Size register.
                                                     The Host Controller generates DMA Interrupt to request
                                                     the Host Driver to update this register. The Host Driver
                                                     sets the next system address of the next data position
                                                     to this register. When the most upper byte of this register
                                                     (003h) is written, the Host Controller restarts the SDMA
                                                     transfer. When restarting SDMA by the Resume command or
                                                     by setting Continue Request in the Block Gap Control register,
                                                     the Host Controller shall start at the next contiguous
                                                     address stored here in the SDMA System Address register.
                                                     ADMA does not use this register (2) Argument 2 This register
                                                     is used with the Auto CMD23 to set a 32-bit block count
                                                     value to the argument of the CMD23 while executing Auto
                                                     CMD23. If Auto CMD23 is used with ADMA, the full 32-bit
                                                     block count value can be used. If Auto CMD23 is used without
                                                     AMDA, the available block count value is limited by the
                                                     Block Count register. 65535 blocks is the maximum value
                                                     in this case.                                                             */
    } SDMA_b;
  } ;

  union {
    __IOM uint32_t BLOCK;                       /*!< Block size                                                                */

