AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t COMMANDCOMPLETESTATUSENABLE : 1;/*!< Description                                                          */
      __IOM uint32_t TRANSFERCOMPLETESTATUSENABLE : 1;/*!< Description                                                         */
      __IOM uint32_t BLOCKGAPEVENTSTATUSENABLE : 1;/*!< Description                                                            */
      __IOM uint32_t DMAINTERRUPTSTATUSENABLE : 1;/*!< Description                                                             */
      __IOM uint32_t BUFFERWRITEREADYSTATUSENABLE : 1;/*!< Description                                                         */
      __IOM uint32_t BUFFERREADREADYSTATUSENABLE : 1;/*!< Description                                                          */
      __IOM uint32_t CARDINSERTIONSTATUSENABLE : 1;/*!< Description                                                            */
      __IOM uint32_t CARDREMOVALSTATUSENABLE : 1;/*!< Description                                                              */
      __IOM uint32_t CARDINTERRUPTSTATUSENABLE : 1;/*!< If this bit is set to 0, the HC shall clear Interrupt request
                                                     to the System. The Card Interrupt detection is stopped
                                                     when this bit is cleared and restarted when this bit is
                                                     set to 1. The HD may clear the Card Interrupt Status Enable
                                                     before servicing the Card Interrupt and may set this bit
                                                     again after all Interrupt requests from the card are cleared
                                                     to prevent inadvertent Interrupts.                                        */
      __IOM uint32_t INTASTATUSENABLE : 1;      /*!< If this bit is set to 0, the Host Controller shall clear the
                                                     interrupt request to the System. The Host Driver may clear
                                                     this bit before servicing the INT_A and may set this bit
                                                     again after all interrupt requests to INT_A pin are cleared
                                                     to prevent inadvertent interrupts.                                        */
      __IOM uint32_t INTBSTATUSENABLE : 1;      /*!< If this bit is set to 0, the Host Controller shall clear the
                                                     interrupt request to the System. The Host Driver may clear
                                                     this bit before servicing the INT_B and may set this bit
                                                     again after all interrupt requests to INT_B pin are cleared
                                                     to prevent inadvertent interrupts.                                        */
      __IOM uint32_t INTCSTATUSENABLE : 1;      /*!< If this bit is set to 0, the Host Controller shall clear the
                                                     interrupt request to the System. The Host Driver may clear
                                                     this bit before servicing the INT_C and may set this bit
                                                     again after all interrupt requests to INT_C pin are cleared
                                                     to prevent inadvertent interrupts. Interrupt enable                       */
      __IOM uint32_t RETUNINGEVENTSTATUSENABLE : 1;/*!< Interrupt                                                              */
      __IOM uint32_t BOOTACKRCVENABLE : 1;      /*!< Interrupt                                                                 */
      __IOM uint32_t BOOTTERMINATE : 1;         /*!< Boot is terminated?                                                       */
      __IOM uint32_t FIXEDTO0   : 1;            /*!< The HC shall control error Interrupts using the Error Interrupt
                                                     Status Enable register.                                                   */
      __IOM uint32_t COMMANDTIMEOUTERRORSTATUSENABLE : 1;/*!< Desc                                                             */
      __IOM uint32_t COMMANDCRCERRORSTATUSENABLE : 1;/*!< Desc                                                                 */
      __IOM uint32_t COMMANDENDBITERRORSTATUSENABLE : 1;/*!< Desc                                                              */
      __IOM uint32_t COMMANDINDEXERRORSTATUSENABLE : 1;/*!< Desc                                                               */
      __IOM uint32_t DATATIMEOUTERRORSTATUSENABLE : 1;/*!< Desc                                                                */
      __IOM uint32_t DATACRCERRORSTATUSENABLE : 1;/*!< Desc                                                                    */
      __IOM uint32_t DATAENDBITERRORSTATUSENABLE : 1;/*!< Desc                                                                 */
      __IOM uint32_t CURRENTLIMITERRORSTATUSENABLE : 1;/*!< Desc                                                               */
      __IOM uint32_t AUTOCMD12ERRORSTATUSENABLE : 1;/*!< Desc                                                                  */
      __IOM uint32_t ADMAERRORSTATUSENABLE : 1; /*!< Desc                                                                      */
      __IOM uint32_t TUNINGERRORSTATUS : 1;     /*!< enable                                                                    */
            uint32_t            : 1;
      __IOM uint32_t TGTRESPERRHOSTERRSTATEN : 1;/*!< Desc                                                                     */
      __IOM uint32_t VENDORSPECIFICERRORSTATUSENABLE : 3;/*!< Vendor-specific error status enable.                             */
    } INTENABLE_b;
  } ;

  union {
    __IOM uint32_t INTSIG;                      /*!< Normal interrupt signal enable                                            */

