AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t SDR50      : 1;            /*!< 1- SDR50 is Supported                                                     */
      __IOM uint32_t SDR104     : 1;            /*!< 1- SDR104 is Supported                                                    */
      __IOM uint32_t DDR50      : 1;            /*!< FIXME - Bitfield description needed here.                                 */
            uint32_t            : 1;
      __IOM uint32_t TYPEA      : 1;            /*!< This bit indicates support of Driver Type A for 1.8 Signaling.            */
      __IOM uint32_t TYPEC      : 1;            /*!< This bit indicates support of Driver Type C for 1.8 Signaling.            */
      __IOM uint32_t TYPED      : 1;            /*!< Reserved This bit indicates support of Driver Type D for 1.8
                                                     Signaling.                                                                */
            uint32_t            : 1;
      __IOM uint32_t RETUNINGTMRCNT : 4;        /*!< This field indicates an initial value of the Re-Tuning Timer
                                                     for Re-Tuning Mode 1 to 3. 0h - Get information via other
                                                     source.                                                                   */
            uint32_t            : 1;
      __IOM uint32_t TUNINGSDR50 : 1;           /*!< If this bit is set to 1, this Host Controller requires tuning
                                                     to operate SDR50. (Tuning is always required to operate
                                                     SDR104.)                                                                  */
      __IOM uint32_t RETUNINGMODES : 2;         /*!< This field defines the re-tuning capability of a Host Controller
                                                     and how to manage the data transfer length and a Re-Tuning
                                                     Timer by the Host Driver There are two re-tuning timings:
                                                     Re-Tuning Request and expiration of a Re-Tuning Timer.
                                                     By receiving either timing, the Host Driver executes the
                                                     re-tuning procedure just before a next command issue                      */
      __IOM uint32_t CLKMULT    : 8;            /*!< This field indicates clock multiplier value of programmable
                                                     clock generator. Refer to Clock Control register. Setting
                                                     00h means that Host Controller does not support programmable
                                                     clock generator. The multiplier is (CLKMULT+1).                           */
      __IOM uint32_t SPIMODE    : 1;            /*!< Spi mode                                                                  */
      __IOM uint32_t SPIBLOCKMODE : 1;          /*!< Spi block mode                                                            */
            uint32_t            : 6;
    } CAPABILITIES1_b;
  } ;

  union {
    __IOM uint32_t MAXIMUM0;                    /*!< Maximum current capabilities                                              */

    struct {
      __IOM uint32_t ALLBITSRSVD : 32;          /*!< The entire 32-bits of this register are reserved, do not read
                                                     or write.                                                                 */
    } MAXIMUM0_b;
  } ;

  union {
    __IOM uint32_t MAXIMUM1;                    /*!< Maximum current capabilities                                              */

    struct {
      __IOM uint32_t MAXCURR33V : 8;            /*!< Maximum Current for 3.3V. The current value is specified as
                                                     MAXCURR33V * 4mA. Some example enums follow:                              */
      __IOM uint32_t MAXCURR30V : 8;            /*!< Maximum Current for 3.0V. The current value is specified as
                                                     MAXCURR30V * 4mA. Some example enums follow:                              */
      __IOM uint32_t MAXCURR18V : 8;            /*!< Maximum Current for 1.8V. The current value is specified as
                                                     MAXCURR18V * 4mA. Some example enums follow:                              */
            uint32_t            : 8;
    } MAXIMUM1_b;
  } ;

  union {
    __IOM uint32_t FORCE;                       /*!< Force event register for error interrupt status                           */

    struct {
      __IOM uint32_t FORCEACMD12NOT : 1;        /*!< Description                                                               */
      __IOM uint32_t FORCEACMDTOERR : 1;        /*!< Description                                                               */
      __IOM uint32_t FORCEACMDCRCERR : 1;       /*!< Description                                                               */
      __IOM uint32_t FORCEACMDENDERR : 1;       /*!< Description                                                               */
      __IOM uint32_t FORCEACMDIDXERR : 1;       /*!< Desc                                                                      */
            uint32_t            : 2;
      __IOM uint32_t FORCEACMDISSUEDERR : 1;    /*!< 1 - Interrupt is generated                                                */
            uint32_t            : 8;
      __IOM uint32_t FORCECMDTOERR : 1;         /*!< Force Event for Command Timeout Error                                     */
      __IOM uint32_t FORCECMDCRCERR : 1;        /*!< Force Event for Command CRC Error                                         */
      __IOM uint32_t FORCECMDENDERR : 1;        /*!< Force Event for Command End Bit Error                                     */
      __IOM uint32_t FORCECMDIDXERR : 1;        /*!< Force Event for Command Index Error                                       */
      __IOM uint32_t FORCEDATATOERR : 1;        /*!< Force Event for Data Timeout Error                                        */
      __IOM uint32_t FORCEDATACRCERR : 1;       /*!< Force Event for Data CRC Error                                            */
      __IOM uint32_t FORCEDATAENDERR : 1;       /*!< Force Event for Data End Bit Error                                        */
      __IOM uint32_t FORCECURRLIMITERR : 1;     /*!< Force Event for Current Limit Error                                       */
      __IOM uint32_t FORCEACMDERR : 1;          /*!< Force Event for Auto CMD Error                                            */
      __IOM uint32_t FORCEADMAERR : 1;          /*!< Force event for ADMA error                                                */
            uint32_t            : 6;
    } FORCE_b;
  } ;

  union {
    __IOM uint32_t ADMA;                        /*!< ADMA error status                                                         */

