AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t ADMAERRORSTATE : 2;        /*!< This field indicates the state of ADMA when error is occurred
                                                     during ADMA data transfer. This field never indicates 10
                                                     because ADMA never stops in this state. D01 - D00 : ADMA
                                                     Error State when error occurred Contents of SYS_SDR register              */
      __IOM uint32_t ADMALENMISMATCHERR : 1;    /*!< This error occurs in the following 2 cases. While Block Count
                                                     Enable being set, the total data length specified by the
                                                     Descriptor table is different from that specified by the
                                                     Block Count and Block Length. Total data length can not
                                                     be divided by the block length.                                           */
            uint32_t            : 29;
    } ADMA_b;
  } ;

  union {
    __IOM uint32_t ADMALOWD;                    /*!< ADMA system address [31:0]                                                */

    struct {
      __IOM uint32_t LOWD       : 32;           /*!< This register holds byte address of executing command of the
                                                     Descriptor table. 32-bit Address Descriptor uses lower
                                                     32bit of this register. At the start of ADMA, the Host
                                                     Driver shall set start address of the Descriptor table.
                                                     The ADMA increments this register address, which points
                                                     to next line, when every fetching a Descriptor line. When
                                                     the ADMA Error Interrupt is generated, this register shall
                                                     hold valid Descriptor address depending on the ADMA state.
                                                     The Host Driver shall program Descriptor Table on 32-bit
                                                     boundary and set 32-bit boundary address to this register.
                                                     ADMA2 ignores lower 2-bit of this register and assumes
                                                     it to be 00b. 32-bit Address ADMA Register Value 32bit
                                                     System Address                                                            */
    } ADMALOWD_b;
  } ;

  union {
    __IOM uint32_t ADMAHIWD;                    /*!< ADMA system address [63:0]                                                */

    struct {
      __IOM uint32_t HIWD       : 32;           /*!< This register holds byte address of executing command of the
                                                     Descriptor table. 32-bit Address Descriptor uses lower
                                                     32bit of this register. At the start of ADMA, the Host
                                                     Driver shall set start address of the Descriptor table.
                                                     The ADMA increments this register address, which points
                                                     to next line, when every fetching a Descriptor line. When
                                                     the ADMA Error Interrupt is generated, this register shall
                                                     hold valid Descriptor address depending on the ADMA state.
                                                     The Host Driver shall program Descriptor Table on 32-bit
                                                     boundary and set 32-bit boundary address to this register.
                                                     ADMA2 ignores lower 2-bit of this register and assumes
                                                     it to be 00b. 32-bit Address ADMA Register Value 32bit
                                                     System Address                                                            */
    } ADMAHIWD_b;
  } ;

  union {
    __IOM uint32_t PRESET0;                     /*!< Preset Value initialization and default speed                             */

    struct {
      __IOM uint32_t HISPSDCLKFREQSEL : 10;     /*!< 10 bit preset value to set SDCLK Frequency Select in the Clock
                                                     Control Register is described by a host system. When Host
                                                     Controller supports shared bus, a set of Preset Value registers
                                                     for each device required and the registers location are
                                                     duplicated to the offset 06Fh-060h. A set of Preset Value
                                                     registers can be accessible by selecting Clock Pin Select
                                                     in the Shared Bus Control register                                        */
      __IOM uint32_t HISPCLKGENSEL : 1;         /*!< This bit is effective when Host Controller supports programmable
                                                     clock generator.                                                          */
            uint32_t            : 3;
      __IOM uint32_t HISPDRVRSTRSEL : 2;        /*!< Driver Strength is supported by 1.8V signaling bus speed modes.
                                                     This field is meaningless for 3.3V signaling.                             */
      __IOM uint32_t DEFSPSDCLKFREQSEL : 10;    /*!< 10 bit preset value to set SDCLK Frequency Select in the Clock
                                                     Control Register is described by a host system. When Host
                                                     Controller supports shared bus, a set of Preset Value registers
                                                     for each device required and the registers location are
                                                     duplicated to the offset 06Fh-060h. A set of Preset Value
                                                     registers can be accessible by selecting Clock Pin Select
                                                     in the Shared Bus Control register                                        */
      __IOM uint32_t DEFSPCLKGENSEL : 1;        /*!< This bit is effective when Host Controller supports programmable
                                                     clock generator.                                                          */
            uint32_t            : 3;
      __IOM uint32_t DEFSPDRVRSTRSEL : 2;       /*!< Driver Strength is supported by 1.8V signaling bus speed modes.
                                                     This field is meaningless for 3.3V signaling.                             */
    } PRESET0_b;
  } ;

  union {
    __IOM uint32_t PRESET1;                     /*!< Preset Value for high speed and SDR12                                     */

