AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t COMPAREA   : 1;            /*!< COUNTER is greater than or equal to COMPARE register A.                   */
      __IOM uint32_t COMPAREB   : 1;            /*!< COUNTER is greater than or equal to COMPARE register B.                   */
      __IOM uint32_t COMPAREC   : 1;            /*!< COUNTER is greater than or equal to COMPARE register C.                   */
      __IOM uint32_t COMPARED   : 1;            /*!< COUNTER is greater than or equal to COMPARE register D.                   */
      __IOM uint32_t COMPAREE   : 1;            /*!< COUNTER is greater than or equal to COMPARE register E.                   */
      __IOM uint32_t COMPAREF   : 1;            /*!< COUNTER is greater than or equal to COMPARE register F.                   */
      __IOM uint32_t COMPAREG   : 1;            /*!< COUNTER is greater than or equal to COMPARE register G.                   */
      __IOM uint32_t COMPAREH   : 1;            /*!< COUNTER is greater than or equal to COMPARE register H.                   */
      __IOM uint32_t OVERFLOW   : 1;            /*!< COUNTER over flowed from 0xFFFFFFFF back to 0x00000000.                   */
      __IOM uint32_t CAPTUREA   : 1;            /*!< CAPTURE register A has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREB   : 1;            /*!< CAPTURE register B has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREC   : 1;            /*!< CAPTURE register C has grabbed the value in the counter                   */
      __IOM uint32_t CAPTURED   : 1;            /*!< CAPTURE register D has grabbed the value in the counter                   */
            uint32_t            : 19;
    } STMINTSTAT_b;
  } ;

  union {
    __IOM uint32_t STMINTCLR;                   /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t COMPAREA   : 1;            /*!< COUNTER is greater than or equal to COMPARE register A.                   */
      __IOM uint32_t COMPAREB   : 1;            /*!< COUNTER is greater than or equal to COMPARE register B.                   */
      __IOM uint32_t COMPAREC   : 1;            /*!< COUNTER is greater than or equal to COMPARE register C.                   */
      __IOM uint32_t COMPARED   : 1;            /*!< COUNTER is greater than or equal to COMPARE register D.                   */
      __IOM uint32_t COMPAREE   : 1;            /*!< COUNTER is greater than or equal to COMPARE register E.                   */
      __IOM uint32_t COMPAREF   : 1;            /*!< COUNTER is greater than or equal to COMPARE register F.                   */
      __IOM uint32_t COMPAREG   : 1;            /*!< COUNTER is greater than or equal to COMPARE register G.                   */
      __IOM uint32_t COMPAREH   : 1;            /*!< COUNTER is greater than or equal to COMPARE register H.                   */
      __IOM uint32_t OVERFLOW   : 1;            /*!< COUNTER over flowed from 0xFFFFFFFF back to 0x00000000.                   */
      __IOM uint32_t CAPTUREA   : 1;            /*!< CAPTURE register A has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREB   : 1;            /*!< CAPTURE register B has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREC   : 1;            /*!< CAPTURE register C has grabbed the value in the counter                   */
      __IOM uint32_t CAPTURED   : 1;            /*!< CAPTURE register D has grabbed the value in the counter                   */
            uint32_t            : 19;
    } STMINTCLR_b;
  } ;

  union {
    __IOM uint32_t STMINTSET;                   /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t COMPAREA   : 1;            /*!< COUNTER is greater than or equal to COMPARE register A.                   */
      __IOM uint32_t COMPAREB   : 1;            /*!< COUNTER is greater than or equal to COMPARE register B.                   */
      __IOM uint32_t COMPAREC   : 1;            /*!< COUNTER is greater than or equal to COMPARE register C.                   */
      __IOM uint32_t COMPARED   : 1;            /*!< COUNTER is greater than or equal to COMPARE register D.                   */
      __IOM uint32_t COMPAREE   : 1;            /*!< COUNTER is greater than or equal to COMPARE register E.                   */
      __IOM uint32_t COMPAREF   : 1;            /*!< COUNTER is greater than or equal to COMPARE register F.                   */
      __IOM uint32_t COMPAREG   : 1;            /*!< COUNTER is greater than or equal to COMPARE register G.                   */
      __IOM uint32_t COMPAREH   : 1;            /*!< COUNTER is greater than or equal to COMPARE register H.                   */
      __IOM uint32_t OVERFLOW   : 1;            /*!< COUNTER over flowed from 0xFFFFFFFF back to 0x00000000.                   */
      __IOM uint32_t CAPTUREA   : 1;            /*!< CAPTURE register A has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREB   : 1;            /*!< CAPTURE register B has grabbed the value in the counter                   */
      __IOM uint32_t CAPTUREC   : 1;            /*!< CAPTURE register C has grabbed the value in the counter                   */
      __IOM uint32_t CAPTURED   : 1;            /*!< CAPTURE register D has grabbed the value in the counter                   */
            uint32_t            : 19;
    } STMINTSET_b;
  } ;
} STIMER_Type;                                  /*!< Size = 272 (0x110)                                                        */



/* =========================================================================================================================== */
/* ================                                           TIMER                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Counter/Timer (TIMER)
  */

