AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t OUTCFG8    : 6;            /*!< Counter/Timer or System Timer output selection for GPIO8. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG9    : 6;            /*!< Counter/Timer or System Timer output selection for GPIO9. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG10   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO10. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG11   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO11. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG2_b;
  } ;

  union {
    __IOM uint32_t OUTCFG3;                     /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG12   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO12. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG13   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO13. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG14   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO14. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG15   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO15. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG3_b;
  } ;

  union {
    __IOM uint32_t OUTCFG4;                     /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG16   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO16. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG17   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO17. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG18   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO18. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG19   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO19. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG4_b;
  } ;

  union {
    __IOM uint32_t OUTCFG5;                     /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG20   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO20. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG21   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO21. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG22   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO22. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG23   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO23. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG5_b;
  } ;

  union {
    __IOM uint32_t OUTCFG6;                     /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG24   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO24. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG25   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO25. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG26   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO26. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG27   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO27. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG6_b;
  } ;

  union {
    __IOM uint32_t OUTCFG7;                     /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

