AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t OUTCFG48   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO48. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG49   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO49. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG50   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO50. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG51   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO51. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG12_b;
  } ;

  union {
    __IOM uint32_t OUTCFG13;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG52   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO52. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG53   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO53. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG54   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO54. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG55   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO55. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG13_b;
  } ;

  union {
    __IOM uint32_t OUTCFG14;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG56   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO56. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG57   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO57. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG58   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO58. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG59   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO59. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG14_b;
  } ;

  union {
    __IOM uint32_t OUTCFG15;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG60   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO60. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG61   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO61. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG62   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO62. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG63   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO63. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG15_b;
  } ;

  union {
    __IOM uint32_t OUTCFG16;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG64   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO64. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG65   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO65. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG66   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO66. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG67   : 6;            /*!< Counter/Timer or System Timer output selection for GPIO67. Select
                                                     an output of any timer to be output on this GPIO.                         */
            uint32_t            : 2;
    } OUTCFG16_b;
  } ;

  union {
    __IOM uint32_t OUTCFG17;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

