AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t OUTCFG108  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO108.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG109  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO109.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG110  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO110.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG111  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO111.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG27_b;
  } ;

  union {
    __IOM uint32_t OUTCFG28;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG112  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO112.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG113  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO113.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG114  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO114.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG115  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO115.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG28_b;
  } ;

  union {
    __IOM uint32_t OUTCFG29;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG116  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO116.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG117  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO117.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG118  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO118.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG119  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO119.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG29_b;
  } ;

  union {
    __IOM uint32_t OUTCFG30;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG120  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO120.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG121  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO121.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG122  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO122.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG123  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO123.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG30_b;
  } ;

  union {
    __IOM uint32_t OUTCFG31;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG124  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO124.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG125  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO125.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG126  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO126.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG127  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO127.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG31_b;
  } ;

  union {
    __IOM uint32_t OUTCFG32;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

