AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t OUTCFG128  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO128.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG129  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO129.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG130  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO130.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG131  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO131.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG32_b;
  } ;

  union {
    __IOM uint32_t OUTCFG33;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG132  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO132.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG133  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO133.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG134  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO134.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG135  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO135.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG33_b;
  } ;

  union {
    __IOM uint32_t OUTCFG34;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG136  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO136.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG137  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO137.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG138  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO138.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG139  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO139.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG34_b;
  } ;

  union {
    __IOM uint32_t OUTCFG35;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG140  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO140.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG141  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO141.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG142  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO142.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG143  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO143.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG35_b;
  } ;

  union {
    __IOM uint32_t OUTCFG36;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG144  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO144.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG145  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO145.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG146  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO146.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG147  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO147.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG36_b;
  } ;

  union {
    __IOM uint32_t OUTCFG37;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

