AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t OUTCFG148  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO148.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG149  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO149.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG150  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO150.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG151  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO151.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG37_b;
  } ;

  union {
    __IOM uint32_t OUTCFG38;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG152  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO152.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG153  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO153.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG154  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO154.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG155  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO155.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG38_b;
  } ;

  union {
    __IOM uint32_t OUTCFG39;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG156  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO156.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG157  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO157.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG158  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO158.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG159  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO159.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG39_b;
  } ;

  union {
    __IOM uint32_t OUTCFG40;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG160  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO160.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG161  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO161.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG162  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO162.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG163  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO163.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG40_b;
  } ;

  union {
    __IOM uint32_t OUTCFG41;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

    struct {
      __IOM uint32_t OUTCFG164  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO164.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG165  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO165.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG166  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO166.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG167  : 6;            /*!< Counter/Timer or System Timer output selection for GPIO167.
                                                     Select an output of any timer to be output on this GPIO.                  */
            uint32_t            : 2;
    } OUTCFG41_b;
  } ;

  union {
    __IOM uint32_t OUTCFG42;                    /*!< Counter/Timer or System Timer output selections for GPIO pads.            */

