AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t TIMER6     : 32;           /*!< Counter/Timer 6                                                           */
    } TIMER6_b;
  } ;

  union {
    __IOM uint32_t TMR6CMP0;                    /*!< This contains the Compare limits for timer 6. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR6CMP0   : 32;           /*!< Counter/Timer 6 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR6CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR6CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR6CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR6CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE6;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR6TRIGSEL : 9;           /*!< Counter/Timer 6 Trigger Source Selection                                  */
            uint32_t            : 15;
    } MODE6_b;
  } ;

  union {
    __IOM uint32_t TMR6LMTVAL;                  /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR6LMTVAL : 8;            /*!< Counter/Timer 6 Limit Readback                                            */
            uint32_t            : 24;
    } TMR6LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED10[2];

  union {
    __IOM uint32_t CTRL7;                       /*!< This includes the Control bit fields for timer 7.                         */

    struct {
      __IOM uint32_t TMR7EN     : 1;            /*!< Counter/Timer 7 Enable bit.                                               */
      __IOM uint32_t TMR7CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR7POL0   : 1;            /*!< Counter/Timer 7 output 0 polarity.                                        */
      __IOM uint32_t TMR7POL1   : 1;            /*!< Counter/Timer 7 output 1 polarity.                                        */
      __IOM uint32_t TMR7FN     : 4;            /*!< Counter/Timer 7 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR7CLK    : 9;            /*!< Counter/Timer 7 Clock Select. Note: Any GPIO can be used as
                                                     a clock source.                                                           */
      __IOM uint32_t TMR7TMODE  : 2;            /*!< Counter/Timer 7 Trigger Mode                                              */
            uint32_t            : 5;
      __IOM uint32_t TMR7LMT    : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     7. For Single/Repeat Patterns, it indicates number of bits
                                                     to be shifted out and so, max value is 63.                                */
    } CTRL7_b;
  } ;

  union {
    __IOM uint32_t TIMER7;                      /*!< This register holds the running time or event count for timer
                                                     7.                                                                        */

    struct {
      __IOM uint32_t TIMER7     : 32;           /*!< Counter/Timer 7                                                           */
    } TIMER7_b;
  } ;

  union {
    __IOM uint32_t TMR7CMP0;                    /*!< This contains the Compare limits for timer 7. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR7CMP0   : 32;           /*!< Counter/Timer 7 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR7CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR7CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR7CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR7CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE7;                       /*!< The mode register contains optional mode controls for the timer           */

