AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR7TRIGSEL : 9;           /*!< Counter/Timer 7 Trigger Source Selection                                  */
            uint32_t            : 15;
    } MODE7_b;
  } ;

  union {
    __IOM uint32_t TMR7LMTVAL;                  /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR7LMTVAL : 8;            /*!< Counter/Timer 7 Limit Readback                                            */
            uint32_t            : 24;
    } TMR7LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED11[2];

  union {
    __IOM uint32_t CTRL8;                       /*!< This includes the Control bit fields for timer 8.                         */

    struct {
      __IOM uint32_t TMR8EN     : 1;            /*!< Counter/Timer 8 Enable bit.                                               */
      __IOM uint32_t TMR8CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR8POL0   : 1;            /*!< Counter/Timer 8 output 0 polarity.                                        */
      __IOM uint32_t TMR8POL1   : 1;            /*!< Counter/Timer 8 output 1 polarity.                                        */
      __IOM uint32_t TMR8FN     : 4;            /*!< Counter/Timer 8 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR8CLK    : 9;            /*!< Counter/Timer 8 Clock Select. Note: Any GPIO can be used as
                                                     a clock source.                                                           */
      __IOM uint32_t TMR8TMODE  : 2;            /*!< Counter/Timer 8 Trigger Mode                                              */
            uint32_t            : 5;
      __IOM uint32_t TMR8LMT    : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     8. For Single/Repeat Patterns, it indicates number of bits
                                                     to be shifted out and so, max value is 63.                                */
    } CTRL8_b;
  } ;

  union {
    __IOM uint32_t TIMER8;                      /*!< This register holds the running time or event count for timer
                                                     8.                                                                        */

    struct {
      __IOM uint32_t TIMER8     : 32;           /*!< Counter/Timer 8                                                           */
    } TIMER8_b;
  } ;

  union {
    __IOM uint32_t TMR8CMP0;                    /*!< This contains the Compare limits for timer 8. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR8CMP0   : 32;           /*!< Counter/Timer 8 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR8CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR8CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR8CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR8CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE8;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR8TRIGSEL : 9;           /*!< Counter/Timer 8 Trigger Source Selection                                  */
            uint32_t            : 15;
    } MODE8_b;
  } ;

  union {
    __IOM uint32_t TMR8LMTVAL;                  /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR8LMTVAL : 8;            /*!< Counter/Timer 8 Limit Readback                                            */
            uint32_t            : 24;
    } TMR8LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED12[2];

  union {
    __IOM uint32_t CTRL9;                       /*!< This includes the Control bit fields for timer 9.                         */

    struct {
      __IOM uint32_t TMR9EN     : 1;            /*!< Counter/Timer 9 Enable bit.                                               */
      __IOM uint32_t TMR9CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR9POL0   : 1;            /*!< Counter/Timer 9 output 0 polarity.                                        */
      __IOM uint32_t TMR9POL1   : 1;            /*!< Counter/Timer 9 output 1 polarity.                                        */
      __IOM uint32_t TMR9FN     : 4;            /*!< Counter/Timer 9 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR9CLK    : 9;            /*!< Counter/Timer 9 Clock Select. Note: Any GPIO can be used as
                                                     a clock source.                                                           */
      __IOM uint32_t TMR9TMODE  : 2;            /*!< Counter/Timer 9 Trigger Mode                                              */
            uint32_t            : 5;
      __IOM uint32_t TMR9LMT    : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     9. For Single/Repeat Patterns, it indicates number of bits
                                                     to be shifted out and so, max value is 63.                                */
    } CTRL9_b;
  } ;

  union {
    __IOM uint32_t TIMER9;                      /*!< This register holds the running time or event count for timer
                                                     9.                                                                        */

