AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t TXCMPMIC   : 1;            /*!< This bit holds the modem TXCMP interrupt clear.                           */
      __IOM uint32_t CTSMIC     : 1;            /*!< This bit holds the nUARTCTS modem interrupt clear. Clears the
                                                     UARTCTSINTR interrupt.                                                    */
      __IOM uint32_t DCDMIC     : 1;            /*!< This bit holds the nUARTDCD modem interrupt clear. Clears the
                                                     UARTDCDINTR interrupt.                                                    */
      __IOM uint32_t DSRMIC     : 1;            /*!< This bit holds the nUARTDSR modem interrupt clear. Clears the
                                                     UARTDSRINTR interrupt.                                                    */
      __IOM uint32_t RXIC       : 1;            /*!< This bit holds the receive interrupt clear. Clears the UARTRXINTR
                                                     interrupt.                                                                */
      __IOM uint32_t TXIC       : 1;            /*!< This bit holds the transmit interrupt clear. Clears the UARTTXINTR
                                                     interrupt.                                                                */
      __IOM uint32_t RTIC       : 1;            /*!< This bit holds the receive timeout interrupt clear. Clears the
                                                     UARTRTINTR interrupt.                                                     */
      __IOM uint32_t FEIC       : 1;            /*!< This bit holds the framing error interrupt clear. Clears the
                                                     UARTFEINTR interrupt.                                                     */
      __IOM uint32_t PEIC       : 1;            /*!< This bit holds the parity error interrupt clear. Clears the
                                                     UARTPEINTR interrupt.                                                     */
      __IOM uint32_t BEIC       : 1;            /*!< This bit holds the break error interrupt clear. Clears the UARTBEINTR
                                                     interrupt.                                                                */
      __IOM uint32_t OEIC       : 1;            /*!< This bit holds the overrun interrupt clear. Clears the UARTOEINTR
                                                     interrupt.                                                                */
      __IOM uint32_t DMACPIC    : 1;            /*!< This bit holds the DMA complete interrupt clear.                          */
      __IOM uint32_t DMAEIC     : 1;            /*!< This bit holds the DMA error interrupt clear.                             */
            uint32_t            : 19;
    } IEC_b;
  } ;

  union {
    __IOM uint32_t DCR;                         /*!< DMA Control                                                               */

    struct {
      __IOM uint32_t RXDMAE     : 1;            /*!< Enable DMA Function when Uart Receive. If this bit is set to
                                                     1, DMA for the receive FIFO is enabled.                                   */
      __IOM uint32_t TXDMAE     : 1;            /*!< Enable DMA Function when Uart transmit. If this bit is set to
                                                     1, DMA for the transmit FIFO is enabled.                                  */
      __IOM uint32_t RSVD       : 1;            /*!< This bitfield is reserved for future use.                                 */
      __IOM uint32_t DMAPRI     : 1;            /*!< This is DMA priority indicator.                                           */
            uint32_t            : 28;
    } DCR_b;
  } ;

  union {
    __IOM uint32_t TARGADDR;                    /*!< DMA target address                                                        */

    struct {
      __IOM uint32_t TARGADDR   : 32;           /*!< Bits [31:0] of the target byte address for source of DMA (either
                                                     read or write). The address can be any byte alignment,
                                                     and does not have to be word aligned. In cases of non-word
                                                     aligned addresses, the DMA logic will take care for ensuring
                                                     only the target bytes are read/written.                                   */
    } TARGADDR_b;
  } ;

  union {
    __IOM uint32_t COUNT;                       /*!< Contains the number of bytes to be transferred for this DMA
                                                     transaction.                                                              */

    struct {
      __IOM uint32_t TOTCOUNT   : 12;           /*!< Total Transfer Count in bytes.                                            */
            uint32_t            : 20;
    } COUNT_b;
  } ;
} UART0_Type;                                   /*!< Size = 84 (0x54)                                                          */



/* =========================================================================================================================== */
/* ================                                          USBPHY                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief USBPHY device register descriptions. (USBPHY)
  */

typedef struct {                                /*!< USBPHY Structure                                                          */

  union {
    __IOM uint32_t REG00;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF20       : 3;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF43       : 2;            /*!< BG observation enable signal. Active low. When enabled, vref
                                                     400mV can be observed through USB0PP/USB0PN                               */
      __IOM uint32_t BF75       : 3;            /*!< Manually set the Rx Clock phase select. These bits will tune
                                                     the HS RX path sample timing between digital and analog
                                                     inside PHY: 3'b000 represents the earliest phase 3'b111
                                                     represents the latest phase The delay associated with each
                                                     step is 256ps                                                             */
            uint32_t            : 24;
    } REG00_b;
  } ;

  union {
    __IOM uint32_t REG04;                       /*!< Register description here                                                 */

