AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t ADMAERR0   : 1;            /*!< ADMA Error for USB DMA request line 0 Interrupt                           */
      __IOM uint32_t ADMAERR1   : 1;            /*!< ADMA Error for USB DMA request line 1 Interrupt                           */
      __IOM uint32_t ADMAERR2   : 1;            /*!< ADMA Error for USB DMA request line 2 Interrupt                           */
      __IOM uint32_t ADMAERR3   : 1;            /*!< ADMA Error for USB DMA request line 3 Interrupt                           */
      __IOM uint32_t ADMAERR4   : 1;            /*!< ADMA Error for USB DMA request line 4 Interrupt                           */
      __IOM uint32_t ADMAERR5   : 1;            /*!< ADMA Error for USB DMA request line 5 Interrupt                           */
      __IOM uint32_t ADMAERR6   : 1;            /*!< ADMA Error for USB DMA request line 6 Interrupt                           */
      __IOM uint32_t ADMAERR7   : 1;            /*!< ADMA Error for USB DMA request line 7 Interrupt                           */
      __IOM uint32_t ADMAERR8   : 1;            /*!< ADMA Error for USB DMA request line 8 Interrupt                           */
      __IOM uint32_t ADMAERR9   : 1;            /*!< ADMA Error for USB DMA request line 9 Interrupt                           */
            uint32_t            : 22;
    } ADMAERRINTEN_b;
  } ;

  union {
    __IOM uint32_t ADMAERRINTSTAT;              /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t ADMAERR0   : 1;            /*!< ADMA Error for USB DMA request line 0 Interrupt                           */
      __IOM uint32_t ADMAERR1   : 1;            /*!< ADMA Error for USB DMA request line 1 Interrupt                           */
      __IOM uint32_t ADMAERR2   : 1;            /*!< ADMA Error for USB DMA request line 2 Interrupt                           */
      __IOM uint32_t ADMAERR3   : 1;            /*!< ADMA Error for USB DMA request line 3 Interrupt                           */
      __IOM uint32_t ADMAERR4   : 1;            /*!< ADMA Error for USB DMA request line 4 Interrupt                           */
      __IOM uint32_t ADMAERR5   : 1;            /*!< ADMA Error for USB DMA request line 5 Interrupt                           */
      __IOM uint32_t ADMAERR6   : 1;            /*!< ADMA Error for USB DMA request line 6 Interrupt                           */
      __IOM uint32_t ADMAERR7   : 1;            /*!< ADMA Error for USB DMA request line 7 Interrupt                           */
      __IOM uint32_t ADMAERR8   : 1;            /*!< ADMA Error for USB DMA request line 8 Interrupt                           */
      __IOM uint32_t ADMAERR9   : 1;            /*!< ADMA Error for USB DMA request line 9 Interrupt                           */
            uint32_t            : 22;
    } ADMAERRINTSTAT_b;
  } ;

  union {
    __IOM uint32_t ADMAERRINTCLR;               /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t ADMAERR0   : 1;            /*!< ADMA Error for USB DMA request line 0 Interrupt                           */
      __IOM uint32_t ADMAERR1   : 1;            /*!< ADMA Error for USB DMA request line 1 Interrupt                           */
      __IOM uint32_t ADMAERR2   : 1;            /*!< ADMA Error for USB DMA request line 2 Interrupt                           */
      __IOM uint32_t ADMAERR3   : 1;            /*!< ADMA Error for USB DMA request line 3 Interrupt                           */
      __IOM uint32_t ADMAERR4   : 1;            /*!< ADMA Error for USB DMA request line 4 Interrupt                           */
      __IOM uint32_t ADMAERR5   : 1;            /*!< ADMA Error for USB DMA request line 5 Interrupt                           */
      __IOM uint32_t ADMAERR6   : 1;            /*!< ADMA Error for USB DMA request line 6 Interrupt                           */
      __IOM uint32_t ADMAERR7   : 1;            /*!< ADMA Error for USB DMA request line 7 Interrupt                           */
      __IOM uint32_t ADMAERR8   : 1;            /*!< ADMA Error for USB DMA request line 8 Interrupt                           */
      __IOM uint32_t ADMAERR9   : 1;            /*!< ADMA Error for USB DMA request line 9 Interrupt                           */
            uint32_t            : 22;
    } ADMAERRINTCLR_b;
  } ;

  union {
    __IOM uint32_t ADMAERRINTSET;               /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t ADMAERR0   : 1;            /*!< ADMA Error for USB DMA request line 0 Interrupt                           */
      __IOM uint32_t ADMAERR1   : 1;            /*!< ADMA Error for USB DMA request line 1 Interrupt                           */
      __IOM uint32_t ADMAERR2   : 1;            /*!< ADMA Error for USB DMA request line 2 Interrupt                           */
      __IOM uint32_t ADMAERR3   : 1;            /*!< ADMA Error for USB DMA request line 3 Interrupt                           */
      __IOM uint32_t ADMAERR4   : 1;            /*!< ADMA Error for USB DMA request line 4 Interrupt                           */
      __IOM uint32_t ADMAERR5   : 1;            /*!< ADMA Error for USB DMA request line 5 Interrupt                           */
      __IOM uint32_t ADMAERR6   : 1;            /*!< ADMA Error for USB DMA request line 6 Interrupt                           */
      __IOM uint32_t ADMAERR7   : 1;            /*!< ADMA Error for USB DMA request line 7 Interrupt                           */
      __IOM uint32_t ADMAERR8   : 1;            /*!< ADMA Error for USB DMA request line 8 Interrupt                           */
      __IOM uint32_t ADMAERR9   : 1;            /*!< ADMA Error for USB DMA request line 9 Interrupt                           */
            uint32_t            : 22;
    } ADMAERRINTSET_b;
  } ;
  __IM  uint32_t  RESERVED6[32];

  union {
    __IOM uint32_t ADMATOTCOUNT0;               /*!< Auto DMA Enable Register                                                  */

