AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
    struct {
      __IOM uint32_t OUTLOW     : 1;            /*!< This bit is the vcompout low interrupt.                                   */
      __IOM uint32_t OUTHI      : 1;            /*!< This bit is the vcompout high interrupt.                                  */
            uint32_t            : 30;
    } INTSET_b;
  } ;
} VCOMP_Type;                                   /*!< Size = 528 (0x210)                                                        */



/* =========================================================================================================================== */
/* ================                                            WDT                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Watchdog Timer (WDT)
  */

typedef struct {                                /*!< WDT Structure                                                             */

  union {
    __IOM uint32_t CFG;                         /*!< This is the configuration register for the watch dog timer.
                                                     It controls the enable, interrupt set, clocks for the timer,
                                                     the compare values for the counters to trigger a reset
                                                     or interrupt. This register can only be written to if the
                                                     watch dog timer is unlocked (WDTLOCK is not set).                         */

    struct {
      __IOM uint32_t WDTEN      : 1;            /*!< This bitfield enables the WDT.                                            */
      __IOM uint32_t INTEN      : 1;            /*!< This bitfield enables the WDT interrupt. Note : This bit must
                                                     be set before the interrupt status bit will reflect a watchdog
                                                     timer expiration. The IER interrupt register must also
                                                     be enabled for a WDT interrupt to be sent to the NVIC.                    */
      __IOM uint32_t RESEN      : 1;            /*!< This bitfield enables the WDT reset. This needs to be set together
                                                     with the WDREN bit in REG_RSTGEN_CFG register (in reset
                                                     gen) to trigger the reset.                                                */
            uint32_t            : 5;
      __IOM uint32_t RESVAL     : 8;            /*!< This bitfield is the compare value for counter bits 7:0 to generate
                                                     a watchdog reset. This will cause a software reset.                       */
      __IOM uint32_t INTVAL     : 8;            /*!< This bitfield is the compare value for counter bits 7:0 to generate
                                                     a watchdog interrupt.                                                     */
      __IOM uint32_t CLKSEL     : 3;            /*!< Select the frequency for the WDT. All values not enumerated
                                                     below are undefined.                                                      */
            uint32_t            : 5;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t RSTRT;                       /*!< This register will Restart the watchdog timer. Writing a special
                                                     key value into this register will result in the watch dog
                                                     timer being reset, so that the count will start again.
                                                     It is expected that the software will periodically write
                                                     to this register to indicate that the system is functional.
                                                     The watch dog timer can continue running when the system
                                                     is in deep sleep, and the interrupt will trigger the wake.
                                                     After the wake, the core can reset the watch dog timer.                   */

    struct {
      __IOM uint32_t RSTRT      : 8;            /*!< Writing 0xB2 to WDTRSTRT restarts the watchdog timer. This is
                                                     a write only register. Reading this register will only
                                                     provide all 0.                                                            */
            uint32_t            : 24;
    } RSTRT_b;
  } ;

  union {
    __IOM uint32_t LOCK;                        /*!< This register locks the watch dog timer. Once it is locked,
                                                     the configuration register (WDTCFG) for watch dog timer
                                                     cannot be written to.                                                     */

    struct {
      __IOM uint32_t LOCK       : 8;            /*!< Writing 0x3A locks the watchdog timer. Once locked, the WDTCFG
                                                     reg cannot be written and WDTEN is set.                                   */
            uint32_t            : 24;
    } LOCK_b;
  } ;

  union {
    __IOM uint32_t COUNT;                       /*!< This register holds the current count for the watch dog timer.
                                                     This is a read only register. SW cannot set the value in
                                                     the counter, but can reset it.                                            */

    struct {
      __IOM uint32_t COUNT      : 8;            /*!< Read-Only current value of the WDT counter                                */
            uint32_t            : 24;
    } COUNT_b;
  } ;
  __IM  uint32_t  RESERVED[124];

  union {
    __IOM uint32_t WDTIEREN;                    /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

