AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
#define AUDADC_ZXLIM_LZXC_Msk             (0xfffUL)                 /*!< LZXC (Bitfield-Mask: 0xfff)                           */
/* ========================================================  GAINCFG  ======================================================== */
#define AUDADC_GAINCFG_UPDATEMODE_Pos     (4UL)                     /*!< UPDATEMODE (Bit 4)                                    */
#define AUDADC_GAINCFG_UPDATEMODE_Msk     (0x10UL)                  /*!< UPDATEMODE (Bitfield-Mask: 0x01)                      */
#define AUDADC_GAINCFG_PGACTRLEN_Pos      (0UL)                     /*!< PGACTRLEN (Bit 0)                                     */
#define AUDADC_GAINCFG_PGACTRLEN_Msk      (0x1UL)                   /*!< PGACTRLEN (Bitfield-Mask: 0x01)                       */
/* =========================================================  GAIN  ========================================================== */
#define AUDADC_GAIN_HGBDELTA_Pos          (24UL)                    /*!< HGBDELTA (Bit 24)                                     */
#define AUDADC_GAIN_HGBDELTA_Msk          (0x7f000000UL)            /*!< HGBDELTA (Bitfield-Mask: 0x7f)                        */
#define AUDADC_GAIN_LGB_Pos               (16UL)                    /*!< LGB (Bit 16)                                          */
#define AUDADC_GAIN_LGB_Msk               (0x7f0000UL)              /*!< LGB (Bitfield-Mask: 0x7f)                             */
#define AUDADC_GAIN_HGADELTA_Pos          (8UL)                     /*!< HGADELTA (Bit 8)                                      */
#define AUDADC_GAIN_HGADELTA_Msk          (0x7f00UL)                /*!< HGADELTA (Bitfield-Mask: 0x7f)                        */
#define AUDADC_GAIN_LGA_Pos               (0UL)                     /*!< LGA (Bit 0)                                           */
#define AUDADC_GAIN_LGA_Msk               (0x7fUL)                  /*!< LGA (Bitfield-Mask: 0x7f)                             */
/* ========================================================  SATCFG  ========================================================= */
#define AUDADC_SATCFG_SATCHANSEL_Pos      (4UL)                     /*!< SATCHANSEL (Bit 4)                                    */
#define AUDADC_SATCFG_SATCHANSEL_Msk      (0x10UL)                  /*!< SATCHANSEL (Bitfield-Mask: 0x01)                      */
#define AUDADC_SATCFG_SATEN_Pos           (0UL)                     /*!< SATEN (Bit 0)                                         */
#define AUDADC_SATCFG_SATEN_Msk           (0x1UL)                   /*!< SATEN (Bitfield-Mask: 0x01)                           */
/* ========================================================  SATLIM  ========================================================= */
#define AUDADC_SATLIM_USATC_Pos           (16UL)                    /*!< USATC (Bit 16)                                        */
#define AUDADC_SATLIM_USATC_Msk           (0xfff0000UL)             /*!< USATC (Bitfield-Mask: 0xfff)                          */
#define AUDADC_SATLIM_LSATC_Pos           (0UL)                     /*!< LSATC (Bit 0)                                         */
#define AUDADC_SATLIM_LSATC_Msk           (0xfffUL)                 /*!< LSATC (Bitfield-Mask: 0xfff)                          */
/* ========================================================  SATMAX  ========================================================= */
#define AUDADC_SATMAX_SATCBMAX_Pos        (16UL)                    /*!< SATCBMAX (Bit 16)                                     */
#define AUDADC_SATMAX_SATCBMAX_Msk        (0xfff0000UL)             /*!< SATCBMAX (Bitfield-Mask: 0xfff)                       */
#define AUDADC_SATMAX_SATCAMAX_Pos        (0UL)                     /*!< SATCAMAX (Bit 0)                                      */
#define AUDADC_SATMAX_SATCAMAX_Msk        (0xfffUL)                 /*!< SATCAMAX (Bitfield-Mask: 0xfff)                       */
/* ========================================================  SATCLR  ========================================================= */
#define AUDADC_SATCLR_SATCBCLR_Pos        (1UL)                     /*!< SATCBCLR (Bit 1)                                      */
#define AUDADC_SATCLR_SATCBCLR_Msk        (0x2UL)                   /*!< SATCBCLR (Bitfield-Mask: 0x01)                        */
#define AUDADC_SATCLR_SATCACLR_Pos        (0UL)                     /*!< SATCACLR (Bit 0)                                      */
#define AUDADC_SATCLR_SATCACLR_Msk        (0x1UL)                   /*!< SATCACLR (Bitfield-Mask: 0x01)                        */
/* =========================================================  INTEN  ========================================================= */
#define AUDADC_INTEN_SATCB_Pos            (11UL)                    /*!< SATCB (Bit 11)                                        */
#define AUDADC_INTEN_SATCB_Msk            (0x800UL)                 /*!< SATCB (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTEN_SATCA_Pos            (10UL)                    /*!< SATCA (Bit 10)                                        */
#define AUDADC_INTEN_SATCA_Msk            (0x400UL)                 /*!< SATCA (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTEN_ZXCB_Pos             (9UL)                     /*!< ZXCB (Bit 9)                                          */
#define AUDADC_INTEN_ZXCB_Msk             (0x200UL)                 /*!< ZXCB (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTEN_ZXCA_Pos             (8UL)                     /*!< ZXCA (Bit 8)                                          */
#define AUDADC_INTEN_ZXCA_Msk             (0x100UL)                 /*!< ZXCA (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTEN_DERR_Pos             (7UL)                     /*!< DERR (Bit 7)                                          */
#define AUDADC_INTEN_DERR_Msk             (0x80UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTEN_DCMP_Pos             (6UL)                     /*!< DCMP (Bit 6)                                          */
#define AUDADC_INTEN_DCMP_Msk             (0x40UL)                  /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTEN_WCINC_Pos            (5UL)                     /*!< WCINC (Bit 5)                                         */
#define AUDADC_INTEN_WCINC_Msk            (0x20UL)                  /*!< WCINC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTEN_WCEXC_Pos            (4UL)                     /*!< WCEXC (Bit 4)                                         */
#define AUDADC_INTEN_WCEXC_Msk            (0x10UL)                  /*!< WCEXC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTEN_FIFOOVR2_Pos         (3UL)                     /*!< FIFOOVR2 (Bit 3)                                      */
#define AUDADC_INTEN_FIFOOVR2_Msk         (0x8UL)                   /*!< FIFOOVR2 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTEN_FIFOOVR1_Pos         (2UL)                     /*!< FIFOOVR1 (Bit 2)                                      */
#define AUDADC_INTEN_FIFOOVR1_Msk         (0x4UL)                   /*!< FIFOOVR1 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTEN_SCNCMP_Pos           (1UL)                     /*!< SCNCMP (Bit 1)                                        */
#define AUDADC_INTEN_SCNCMP_Msk           (0x2UL)                   /*!< SCNCMP (Bitfield-Mask: 0x01)                          */
#define AUDADC_INTEN_CNVCMP_Pos           (0UL)                     /*!< CNVCMP (Bit 0)                                        */
#define AUDADC_INTEN_CNVCMP_Msk           (0x1UL)                   /*!< CNVCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSTAT  ======================================================== */
#define AUDADC_INTSTAT_SATCB_Pos          (11UL)                    /*!< SATCB (Bit 11)                                        */
#define AUDADC_INTSTAT_SATCB_Msk          (0x800UL)                 /*!< SATCB (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTSTAT_SATCA_Pos          (10UL)                    /*!< SATCA (Bit 10)                                        */
#define AUDADC_INTSTAT_SATCA_Msk          (0x400UL)                 /*!< SATCA (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTSTAT_ZXCB_Pos           (9UL)                     /*!< ZXCB (Bit 9)                                          */
#define AUDADC_INTSTAT_ZXCB_Msk           (0x200UL)                 /*!< ZXCB (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTSTAT_ZXCA_Pos           (8UL)                     /*!< ZXCA (Bit 8)                                          */
#define AUDADC_INTSTAT_ZXCA_Msk           (0x100UL)                 /*!< ZXCA (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTSTAT_DERR_Pos           (7UL)                     /*!< DERR (Bit 7)                                          */
#define AUDADC_INTSTAT_DERR_Msk           (0x80UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTSTAT_DCMP_Pos           (6UL)                     /*!< DCMP (Bit 6)                                          */
#define AUDADC_INTSTAT_DCMP_Msk           (0x40UL)                  /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTSTAT_WCINC_Pos          (5UL)                     /*!< WCINC (Bit 5)                                         */
#define AUDADC_INTSTAT_WCINC_Msk          (0x20UL)                  /*!< WCINC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTSTAT_WCEXC_Pos          (4UL)                     /*!< WCEXC (Bit 4)                                         */
#define AUDADC_INTSTAT_WCEXC_Msk          (0x10UL)                  /*!< WCEXC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTSTAT_FIFOOVR2_Pos       (3UL)                     /*!< FIFOOVR2 (Bit 3)                                      */
#define AUDADC_INTSTAT_FIFOOVR2_Msk       (0x8UL)                   /*!< FIFOOVR2 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTSTAT_FIFOOVR1_Pos       (2UL)                     /*!< FIFOOVR1 (Bit 2)                                      */
#define AUDADC_INTSTAT_FIFOOVR1_Msk       (0x4UL)                   /*!< FIFOOVR1 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTSTAT_SCNCMP_Pos         (1UL)                     /*!< SCNCMP (Bit 1)                                        */
#define AUDADC_INTSTAT_SCNCMP_Msk         (0x2UL)                   /*!< SCNCMP (Bitfield-Mask: 0x01)                          */
#define AUDADC_INTSTAT_CNVCMP_Pos         (0UL)                     /*!< CNVCMP (Bit 0)                                        */
#define AUDADC_INTSTAT_CNVCMP_Msk         (0x1UL)                   /*!< CNVCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTCLR  ========================================================= */
#define AUDADC_INTCLR_SATCB_Pos           (11UL)                    /*!< SATCB (Bit 11)                                        */
#define AUDADC_INTCLR_SATCB_Msk           (0x800UL)                 /*!< SATCB (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTCLR_SATCA_Pos           (10UL)                    /*!< SATCA (Bit 10)                                        */
#define AUDADC_INTCLR_SATCA_Msk           (0x400UL)                 /*!< SATCA (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTCLR_ZXCB_Pos            (9UL)                     /*!< ZXCB (Bit 9)                                          */
#define AUDADC_INTCLR_ZXCB_Msk            (0x200UL)                 /*!< ZXCB (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTCLR_ZXCA_Pos            (8UL)                     /*!< ZXCA (Bit 8)                                          */
#define AUDADC_INTCLR_ZXCA_Msk            (0x100UL)                 /*!< ZXCA (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTCLR_DERR_Pos            (7UL)                     /*!< DERR (Bit 7)                                          */
#define AUDADC_INTCLR_DERR_Msk            (0x80UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTCLR_DCMP_Pos            (6UL)                     /*!< DCMP (Bit 6)                                          */
#define AUDADC_INTCLR_DCMP_Msk            (0x40UL)                  /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTCLR_WCINC_Pos           (5UL)                     /*!< WCINC (Bit 5)                                         */
#define AUDADC_INTCLR_WCINC_Msk           (0x20UL)                  /*!< WCINC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTCLR_WCEXC_Pos           (4UL)                     /*!< WCEXC (Bit 4)                                         */
#define AUDADC_INTCLR_WCEXC_Msk           (0x10UL)                  /*!< WCEXC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTCLR_FIFOOVR2_Pos        (3UL)                     /*!< FIFOOVR2 (Bit 3)                                      */
#define AUDADC_INTCLR_FIFOOVR2_Msk        (0x8UL)                   /*!< FIFOOVR2 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTCLR_FIFOOVR1_Pos        (2UL)                     /*!< FIFOOVR1 (Bit 2)                                      */
#define AUDADC_INTCLR_FIFOOVR1_Msk        (0x4UL)                   /*!< FIFOOVR1 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTCLR_SCNCMP_Pos          (1UL)                     /*!< SCNCMP (Bit 1)                                        */
#define AUDADC_INTCLR_SCNCMP_Msk          (0x2UL)                   /*!< SCNCMP (Bitfield-Mask: 0x01)                          */
#define AUDADC_INTCLR_CNVCMP_Pos          (0UL)                     /*!< CNVCMP (Bit 0)                                        */
#define AUDADC_INTCLR_CNVCMP_Msk          (0x1UL)                   /*!< CNVCMP (Bitfield-Mask: 0x01)                          */
/* ========================================================  INTSET  ========================================================= */
#define AUDADC_INTSET_SATCB_Pos           (11UL)                    /*!< SATCB (Bit 11)                                        */
#define AUDADC_INTSET_SATCB_Msk           (0x800UL)                 /*!< SATCB (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTSET_SATCA_Pos           (10UL)                    /*!< SATCA (Bit 10)                                        */
#define AUDADC_INTSET_SATCA_Msk           (0x400UL)                 /*!< SATCA (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTSET_ZXCB_Pos            (9UL)                     /*!< ZXCB (Bit 9)                                          */
#define AUDADC_INTSET_ZXCB_Msk            (0x200UL)                 /*!< ZXCB (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTSET_ZXCA_Pos            (8UL)                     /*!< ZXCA (Bit 8)                                          */
#define AUDADC_INTSET_ZXCA_Msk            (0x100UL)                 /*!< ZXCA (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTSET_DERR_Pos            (7UL)                     /*!< DERR (Bit 7)                                          */
#define AUDADC_INTSET_DERR_Msk            (0x80UL)                  /*!< DERR (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTSET_DCMP_Pos            (6UL)                     /*!< DCMP (Bit 6)                                          */
#define AUDADC_INTSET_DCMP_Msk            (0x40UL)                  /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define AUDADC_INTSET_WCINC_Pos           (5UL)                     /*!< WCINC (Bit 5)                                         */
#define AUDADC_INTSET_WCINC_Msk           (0x20UL)                  /*!< WCINC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTSET_WCEXC_Pos           (4UL)                     /*!< WCEXC (Bit 4)                                         */
#define AUDADC_INTSET_WCEXC_Msk           (0x10UL)                  /*!< WCEXC (Bitfield-Mask: 0x01)                           */
#define AUDADC_INTSET_FIFOOVR2_Pos        (3UL)                     /*!< FIFOOVR2 (Bit 3)                                      */
#define AUDADC_INTSET_FIFOOVR2_Msk        (0x8UL)                   /*!< FIFOOVR2 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTSET_FIFOOVR1_Pos        (2UL)                     /*!< FIFOOVR1 (Bit 2)                                      */
#define AUDADC_INTSET_FIFOOVR1_Msk        (0x4UL)                   /*!< FIFOOVR1 (Bitfield-Mask: 0x01)                        */
#define AUDADC_INTSET_SCNCMP_Pos          (1UL)                     /*!< SCNCMP (Bit 1)                                        */
#define AUDADC_INTSET_SCNCMP_Msk          (0x2UL)                   /*!< SCNCMP (Bitfield-Mask: 0x01)                          */
#define AUDADC_INTSET_CNVCMP_Pos          (0UL)                     /*!< CNVCMP (Bit 0)                                        */
#define AUDADC_INTSET_CNVCMP_Msk          (0x1UL)                   /*!< CNVCMP (Bitfield-Mask: 0x01)                          */
/* =======================================================  DMATRIGEN  ======================================================= */
#define AUDADC_DMATRIGEN_DFIFOFULL_Pos    (1UL)                     /*!< DFIFOFULL (Bit 1)                                     */
#define AUDADC_DMATRIGEN_DFIFOFULL_Msk    (0x2UL)                   /*!< DFIFOFULL (Bitfield-Mask: 0x01)                       */
#define AUDADC_DMATRIGEN_DFIFO75_Pos      (0UL)                     /*!< DFIFO75 (Bit 0)                                       */
#define AUDADC_DMATRIGEN_DFIFO75_Msk      (0x1UL)                   /*!< DFIFO75 (Bitfield-Mask: 0x01)                         */
/* ======================================================  DMATRIGSTAT  ====================================================== */
#define AUDADC_DMATRIGSTAT_DFULLSTAT_Pos  (1UL)                     /*!< DFULLSTAT (Bit 1)                                     */
#define AUDADC_DMATRIGSTAT_DFULLSTAT_Msk  (0x2UL)                   /*!< DFULLSTAT (Bitfield-Mask: 0x01)                       */
#define AUDADC_DMATRIGSTAT_D75STAT_Pos    (0UL)                     /*!< D75STAT (Bit 0)                                       */
#define AUDADC_DMATRIGSTAT_D75STAT_Msk    (0x1UL)                   /*!< D75STAT (Bitfield-Mask: 0x01)                         */
/* ========================================================  DMACFG  ========================================================= */
#define AUDADC_DMACFG_NEXTDMAEN_Pos       (19UL)                    /*!< NEXTDMAEN (Bit 19)                                    */
#define AUDADC_DMACFG_NEXTDMAEN_Msk       (0x80000UL)               /*!< NEXTDMAEN (Bitfield-Mask: 0x01)                       */
#define AUDADC_DMACFG_DPWROFF_Pos         (18UL)                    /*!< DPWROFF (Bit 18)                                      */
#define AUDADC_DMACFG_DPWROFF_Msk         (0x40000UL)               /*!< DPWROFF (Bitfield-Mask: 0x01)                         */
#define AUDADC_DMACFG_DMADYNPRI_Pos       (9UL)                     /*!< DMADYNPRI (Bit 9)                                     */
#define AUDADC_DMACFG_DMADYNPRI_Msk       (0x200UL)                 /*!< DMADYNPRI (Bitfield-Mask: 0x01)                       */
#define AUDADC_DMACFG_DMAPRI_Pos          (8UL)                     /*!< DMAPRI (Bit 8)                                        */
#define AUDADC_DMACFG_DMAPRI_Msk          (0x100UL)                 /*!< DMAPRI (Bitfield-Mask: 0x01)                          */
#define AUDADC_DMACFG_DMADIR_Pos          (2UL)                     /*!< DMADIR (Bit 2)                                        */
#define AUDADC_DMACFG_DMADIR_Msk          (0x4UL)                   /*!< DMADIR (Bitfield-Mask: 0x01)                          */
#define AUDADC_DMACFG_DMAEN_Pos           (0UL)                     /*!< DMAEN (Bit 0)                                         */
#define AUDADC_DMACFG_DMAEN_Msk           (0x1UL)                   /*!< DMAEN (Bitfield-Mask: 0x01)                           */
/* ======================================================  DMATOTCOUNT  ====================================================== */
#define AUDADC_DMATOTCOUNT_TOTCOUNT_Pos   (2UL)                     /*!< TOTCOUNT (Bit 2)                                      */
#define AUDADC_DMATOTCOUNT_TOTCOUNT_Msk   (0x3fffcUL)               /*!< TOTCOUNT (Bitfield-Mask: 0xffff)                      */
/* ======================================================  DMATARGADDR  ====================================================== */
#define AUDADC_DMATARGADDR_LTARGADDR_Pos  (0UL)                     /*!< LTARGADDR (Bit 0)                                     */
#define AUDADC_DMATARGADDR_LTARGADDR_Msk  (0xffffffffUL)            /*!< LTARGADDR (Bitfield-Mask: 0xffffffff)                 */
/* ========================================================  DMASTAT  ======================================================== */
#define AUDADC_DMASTAT_DMAERR_Pos         (2UL)                     /*!< DMAERR (Bit 2)                                        */
#define AUDADC_DMASTAT_DMAERR_Msk         (0x4UL)                   /*!< DMAERR (Bitfield-Mask: 0x01)                          */
#define AUDADC_DMASTAT_DMACPL_Pos         (1UL)                     /*!< DMACPL (Bit 1)                                        */
#define AUDADC_DMASTAT_DMACPL_Msk         (0x2UL)                   /*!< DMACPL (Bitfield-Mask: 0x01)                          */
#define AUDADC_DMASTAT_DMATIP_Pos         (0UL)                     /*!< DMATIP (Bit 0)                                        */
#define AUDADC_DMASTAT_DMATIP_Msk         (0x1UL)                   /*!< DMATIP (Bitfield-Mask: 0x01)                          */
/* ====================================================  DMATARGADDRNEXT  ==================================================== */
#define AUDADC_DMATARGADDRNEXT_TARGADDRNEXT_Pos (0UL)               /*!< TARGADDRNEXT (Bit 0)                                  */
#define AUDADC_DMATARGADDRNEXT_TARGADDRNEXT_Msk (0xffffffffUL)      /*!< TARGADDRNEXT (Bitfield-Mask: 0xffffffff)              */
/* ====================================================  DMATOTCOUNTNEXT  ==================================================== */
#define AUDADC_DMATOTCOUNTNEXT_TOTCOUNTNEXT_Pos (2UL)               /*!< TOTCOUNTNEXT (Bit 2)                                  */
#define AUDADC_DMATOTCOUNTNEXT_TOTCOUNTNEXT_Msk (0x3fffcUL)         /*!< TOTCOUNTNEXT (Bitfield-Mask: 0xffff)                  */
/* =====================================================  DMAENNEXTCTRL  ===================================================== */
#define AUDADC_DMAENNEXTCTRL_DMAENNEXT_Pos (0UL)                    /*!< DMAENNEXT (Bit 0)                                     */
#define AUDADC_DMAENNEXTCTRL_DMAENNEXT_Msk (0x1UL)                  /*!< DMAENNEXT (Bitfield-Mask: 0x01)                       */


/* =========================================================================================================================== */
/* ================                                          CLKGEN                                           ================ */
/* =========================================================================================================================== */

