AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* =========================================================  OCTRL  ========================================================= */
#define CLKGEN_OCTRL_OSEL_Pos             (7UL)                     /*!< OSEL (Bit 7)                                          */
#define CLKGEN_OCTRL_OSEL_Msk             (0x80UL)                  /*!< OSEL (Bitfield-Mask: 0x01)                            */
/* ========================================================  CLKOUT  ========================================================= */
#define CLKGEN_CLKOUT_CKEN_Pos            (7UL)                     /*!< CKEN (Bit 7)                                          */
#define CLKGEN_CLKOUT_CKEN_Msk            (0x80UL)                  /*!< CKEN (Bitfield-Mask: 0x01)                            */
#define CLKGEN_CLKOUT_CKSEL_Pos           (0UL)                     /*!< CKSEL (Bit 0)                                         */
#define CLKGEN_CLKOUT_CKSEL_Msk           (0x3fUL)                  /*!< CKSEL (Bitfield-Mask: 0x3f)                           */
/* =========================================================  HFADJ  ========================================================= */
#define CLKGEN_HFADJ_HFADJMAXDELTA_Pos    (24UL)                    /*!< HFADJMAXDELTA (Bit 24)                                */
#define CLKGEN_HFADJ_HFADJMAXDELTA_Msk    (0x1f000000UL)            /*!< HFADJMAXDELTA (Bitfield-Mask: 0x1f)                   */
#define CLKGEN_HFADJ_HFADJGAIN_Pos        (21UL)                    /*!< HFADJGAIN (Bit 21)                                    */
#define CLKGEN_HFADJ_HFADJGAIN_Msk        (0xe00000UL)              /*!< HFADJGAIN (Bitfield-Mask: 0x07)                       */
#define CLKGEN_HFADJ_HFWARMUP_Pos         (20UL)                    /*!< HFWARMUP (Bit 20)                                     */
#define CLKGEN_HFADJ_HFWARMUP_Msk         (0x100000UL)              /*!< HFWARMUP (Bitfield-Mask: 0x01)                        */
#define CLKGEN_HFADJ_HFXTADJ_Pos          (8UL)                     /*!< HFXTADJ (Bit 8)                                       */
#define CLKGEN_HFADJ_HFXTADJ_Msk          (0xfff00UL)               /*!< HFXTADJ (Bitfield-Mask: 0xfff)                        */
#define CLKGEN_HFADJ_HFADJCK_Pos          (1UL)                     /*!< HFADJCK (Bit 1)                                       */
#define CLKGEN_HFADJ_HFADJCK_Msk          (0xeUL)                   /*!< HFADJCK (Bitfield-Mask: 0x07)                         */
#define CLKGEN_HFADJ_HFADJEN_Pos          (0UL)                     /*!< HFADJEN (Bit 0)                                       */
#define CLKGEN_HFADJ_HFADJEN_Msk          (0x1UL)                   /*!< HFADJEN (Bitfield-Mask: 0x01)                         */
/* ======================================================  CLOCKENSTAT  ====================================================== */
#define CLKGEN_CLOCKENSTAT_HFRC2CLKEN_Pos (31UL)                    /*!< HFRC2CLKEN (Bit 31)                                   */
#define CLKGEN_CLOCKENSTAT_HFRC2CLKEN_Msk (0x80000000UL)            /*!< HFRC2CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKENSTAT_HFRCCLKEN_Pos  (30UL)                    /*!< HFRCCLKEN (Bit 30)                                    */
#define CLKGEN_CLOCKENSTAT_HFRCCLKEN_Msk  (0x40000000UL)            /*!< HFRCCLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKENSTAT_XTALCLKOUTEN_Pos (29UL)                  /*!< XTALCLKOUTEN (Bit 29)                                 */
#define CLKGEN_CLOCKENSTAT_XTALCLKOUTEN_Msk (0x20000000UL)          /*!< XTALCLKOUTEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKENSTAT_OSEL_Pos       (28UL)                    /*!< OSEL (Bit 28)                                         */
#define CLKGEN_CLOCKENSTAT_OSEL_Msk       (0x10000000UL)            /*!< OSEL (Bitfield-Mask: 0x01)                            */
#define CLKGEN_CLOCKENSTAT_HFADJEN_Pos    (27UL)                    /*!< HFADJEN (Bit 27)                                      */
#define CLKGEN_CLOCKENSTAT_HFADJEN_Msk    (0x8000000UL)             /*!< HFADJEN (Bitfield-Mask: 0x01)                         */
#define CLKGEN_CLOCKENSTAT_PHFRCCLKEN_Pos (26UL)                    /*!< PHFRCCLKEN (Bit 26)                                   */
#define CLKGEN_CLOCKENSTAT_PHFRCCLKEN_Msk (0x4000000UL)             /*!< PHFRCCLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKENSTAT_PXTALCLKEN_Pos (25UL)                    /*!< PXTALCLKEN (Bit 25)                                   */
#define CLKGEN_CLOCKENSTAT_PXTALCLKEN_Msk (0x2000000UL)             /*!< PXTALCLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKENSTAT_HFRC2READY_Pos (24UL)                    /*!< HFRC2READY (Bit 24)                                   */
#define CLKGEN_CLOCKENSTAT_HFRC2READY_Msk (0x1000000UL)             /*!< HFRC2READY (Bitfield-Mask: 0x01)                      */
/* =====================================================  CLOCKEN2STAT  ====================================================== */
#define CLKGEN_CLOCKEN2STAT_IOM0CLKEN_Pos (31UL)                    /*!< IOM0CLKEN (Bit 31)                                    */
#define CLKGEN_CLOCKEN2STAT_IOM0CLKEN_Msk (0x80000000UL)            /*!< IOM0CLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN2STAT_GFXCLKEN_Pos  (30UL)                    /*!< GFXCLKEN (Bit 30)                                     */
#define CLKGEN_CLOCKEN2STAT_GFXCLKEN_Msk  (0x40000000UL)            /*!< GFXCLKEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_CLOCKEN2STAT_DSPPDMCLKEN_Pos (29UL)                  /*!< DSPPDMCLKEN (Bit 29)                                  */
#define CLKGEN_CLOCKEN2STAT_DSPPDMCLKEN_Msk (0x20000000UL)          /*!< DSPPDMCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_DSPI2S1REFCLKEN_Pos (28UL)              /*!< DSPI2S1REFCLKEN (Bit 28)                              */
#define CLKGEN_CLOCKEN2STAT_DSPI2S1REFCLKEN_Msk (0x10000000UL)      /*!< DSPI2S1REFCLKEN (Bitfield-Mask: 0x01)                 */
#define CLKGEN_CLOCKEN2STAT_DSPI2S1CLKEN_Pos (27UL)                 /*!< DSPI2S1CLKEN (Bit 27)                                 */
#define CLKGEN_CLOCKEN2STAT_DSPI2S1CLKEN_Msk (0x8000000UL)          /*!< DSPI2S1CLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKEN2STAT_DSPI2S0REFCLKEN_Pos (26UL)              /*!< DSPI2S0REFCLKEN (Bit 26)                              */
#define CLKGEN_CLOCKEN2STAT_DSPI2S0REFCLKEN_Msk (0x4000000UL)       /*!< DSPI2S0REFCLKEN (Bitfield-Mask: 0x01)                 */
#define CLKGEN_CLOCKEN2STAT_DSPI2S0CLKEN_Pos (25UL)                 /*!< DSPI2S0CLKEN (Bit 25)                                 */
#define CLKGEN_CLOCKEN2STAT_DSPI2S0CLKEN_Msk (0x2000000UL)          /*!< DSPI2S0CLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKEN2STAT_DPHYPLLCLKEN_Pos (24UL)                 /*!< DPHYPLLCLKEN (Bit 24)                                 */
#define CLKGEN_CLOCKEN2STAT_DPHYPLLCLKEN_Msk (0x1000000UL)          /*!< DPHYPLLCLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKEN2STAT_DISPCLKEN_Pos (23UL)                    /*!< DISPCLKEN (Bit 23)                                    */
#define CLKGEN_CLOCKEN2STAT_DISPCLKEN_Msk (0x800000UL)              /*!< DISPCLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN2STAT_AUDADCCLKEN_Pos (22UL)                  /*!< AUDADCCLKEN (Bit 22)                                  */
#define CLKGEN_CLOCKEN2STAT_AUDADCCLKEN_Msk (0x400000UL)            /*!< AUDADCCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBUSBCLKEN_Pos (21UL)                  /*!< APBUSBCLKEN (Bit 21)                                  */
#define CLKGEN_CLOCKEN2STAT_APBUSBCLKEN_Msk (0x200000UL)            /*!< APBUSBCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBSDIO1CLKEN_Pos (20UL)                /*!< APBSDIO1CLKEN (Bit 20)                                */
#define CLKGEN_CLOCKEN2STAT_APBSDIO1CLKEN_Msk (0x100000UL)          /*!< APBSDIO1CLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLOCKEN2STAT_APBSDIO0CLKEN_Pos (19UL)                /*!< APBSDIO0CLKEN (Bit 19)                                */
#define CLKGEN_CLOCKEN2STAT_APBSDIO0CLKEN_Msk (0x80000UL)           /*!< APBSDIO0CLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLOCKEN2STAT_APBMSPI3CLKEN_Pos (18UL)                /*!< APBMSPI3CLKEN (Bit 18)                                */
#define CLKGEN_CLOCKEN2STAT_APBMSPI3CLKEN_Msk (0x40000UL)           /*!< APBMSPI3CLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLOCKEN2STAT_APBMSPI2CLKEN_Pos (17UL)                /*!< APBMSPI2CLKEN (Bit 17)                                */
#define CLKGEN_CLOCKEN2STAT_APBMSPI2CLKEN_Msk (0x20000UL)           /*!< APBMSPI2CLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLOCKEN2STAT_APBMSPI1CLKEN_Pos (16UL)                /*!< APBMSPI1CLKEN (Bit 16)                                */
#define CLKGEN_CLOCKEN2STAT_APBMSPI1CLKEN_Msk (0x10000UL)           /*!< APBMSPI1CLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLOCKEN2STAT_APBMSPI0CLKEN_Pos (15UL)                /*!< APBMSPI0CLKEN (Bit 15)                                */
#define CLKGEN_CLOCKEN2STAT_APBMSPI0CLKEN_Msk (0x8000UL)            /*!< APBMSPI0CLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLOCKEN2STAT_APBIOSCLKEN_Pos (14UL)                  /*!< APBIOSCLKEN (Bit 14)                                  */
#define CLKGEN_CLOCKEN2STAT_APBIOSCLKEN_Msk (0x4000UL)              /*!< APBIOSCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBHCPCCLKEN_Pos (13UL)                 /*!< APBHCPCCLKEN (Bit 13)                                 */
#define CLKGEN_CLOCKEN2STAT_APBHCPCCLKEN_Msk (0x2000UL)             /*!< APBHCPCCLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKEN2STAT_APBHCPBCLKEN_Pos (12UL)                 /*!< APBHCPBCLKEN (Bit 12)                                 */
#define CLKGEN_CLOCKEN2STAT_APBHCPBCLKEN_Msk (0x1000UL)             /*!< APBHCPBCLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKEN2STAT_APBHCPACLKEN_Pos (11UL)                 /*!< APBHCPACLKEN (Bit 11)                                 */
#define CLKGEN_CLOCKEN2STAT_APBHCPACLKEN_Msk (0x800UL)              /*!< APBHCPACLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKEN2STAT_APBGFXCLKEN_Pos (10UL)                  /*!< APBGFXCLKEN (Bit 10)                                  */
#define CLKGEN_CLOCKEN2STAT_APBGFXCLKEN_Msk (0x400UL)               /*!< APBGFXCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBDISPPHYCLKEN_Pos (9UL)               /*!< APBDISPPHYCLKEN (Bit 9)                               */
#define CLKGEN_CLOCKEN2STAT_APBDISPPHYCLKEN_Msk (0x200UL)           /*!< APBDISPPHYCLKEN (Bitfield-Mask: 0x01)                 */
#define CLKGEN_CLOCKEN2STAT_APBDISPCLKEN_Pos (8UL)                  /*!< APBDISPCLKEN (Bit 8)                                  */
#define CLKGEN_CLOCKEN2STAT_APBDISPCLKEN_Msk (0x100UL)              /*!< APBDISPCLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKEN2STAT_APBCRYPTOCLKEN_Pos (7UL)                /*!< APBCRYPTOCLKEN (Bit 7)                                */
#define CLKGEN_CLOCKEN2STAT_APBCRYPTOCLKEN_Msk (0x80UL)             /*!< APBCRYPTOCLKEN (Bitfield-Mask: 0x01)                  */
#define CLKGEN_CLOCKEN2STAT_APBAUDCLKEN_Pos (6UL)                   /*!< APBAUDCLKEN (Bit 6)                                   */
#define CLKGEN_CLOCKEN2STAT_APBAUDCLKEN_Msk (0x40UL)                /*!< APBAUDCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBAPBCLKEN_Pos (5UL)                   /*!< APBAPBCLKEN (Bit 5)                                   */
#define CLKGEN_CLOCKEN2STAT_APBAPBCLKEN_Msk (0x20UL)                /*!< APBAPBCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBAOLCLKEN_Pos (4UL)                   /*!< APBAOLCLKEN (Bit 4)                                   */
#define CLKGEN_CLOCKEN2STAT_APBAOLCLKEN_Msk (0x10UL)                /*!< APBAOLCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBAOHCLKEN_Pos (3UL)                   /*!< APBAOHCLKEN (Bit 3)                                   */
#define CLKGEN_CLOCKEN2STAT_APBAOHCLKEN_Msk (0x8UL)                 /*!< APBAOHCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBACTIVITYCLKEN_Pos (2UL)              /*!< APBACTIVITYCLKEN (Bit 2)                              */
#define CLKGEN_CLOCKEN2STAT_APBACTIVITYCLKEN_Msk (0x4UL)            /*!< APBACTIVITYCLKEN (Bitfield-Mask: 0x01)                */
#define CLKGEN_CLOCKEN2STAT_ADCCLKEN_Pos  (1UL)                     /*!< ADCCLKEN (Bit 1)                                      */
#define CLKGEN_CLOCKEN2STAT_ADCCLKEN_Msk  (0x2UL)                   /*!< ADCCLKEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_CLOCKEN2STAT_TRACECLKEN_Pos (0UL)                    /*!< TRACECLKEN (Bit 0)                                    */
#define CLKGEN_CLOCKEN2STAT_TRACECLKEN_Msk (0x1UL)                  /*!< TRACECLKEN (Bitfield-Mask: 0x01)                      */
/* =====================================================  CLOCKEN3STAT  ====================================================== */
#define CLKGEN_CLOCKEN3STAT_XTALENABLED_Pos (23UL)                  /*!< XTALENABLED (Bit 23)                                  */
#define CLKGEN_CLOCKEN3STAT_XTALENABLED_Msk (0x800000UL)            /*!< XTALENABLED (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN3STAT_WDTCLKEN_Pos  (22UL)                    /*!< WDTCLKEN (Bit 22)                                     */
#define CLKGEN_CLOCKEN3STAT_WDTCLKEN_Msk  (0x400000UL)              /*!< WDTCLKEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_CLOCKEN3STAT_USBREFCLKEN_Pos (21UL)                  /*!< USBREFCLKEN (Bit 21)                                  */
#define CLKGEN_CLOCKEN3STAT_USBREFCLKEN_Msk (0x200000UL)            /*!< USBREFCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN3STAT_UART3CLKEN_Pos (20UL)                   /*!< UART3CLKEN (Bit 20)                                   */
#define CLKGEN_CLOCKEN3STAT_UART3CLKEN_Msk (0x100000UL)             /*!< UART3CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_UART2CLKEN_Pos (19UL)                   /*!< UART2CLKEN (Bit 19)                                   */
#define CLKGEN_CLOCKEN3STAT_UART2CLKEN_Msk (0x80000UL)              /*!< UART2CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_UART1CLKEN_Pos (18UL)                   /*!< UART1CLKEN (Bit 18)                                   */
#define CLKGEN_CLOCKEN3STAT_UART1CLKEN_Msk (0x40000UL)              /*!< UART1CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_UART0CLKEN_Pos (17UL)                   /*!< UART0CLKEN (Bit 17)                                   */
#define CLKGEN_CLOCKEN3STAT_UART0CLKEN_Msk (0x20000UL)              /*!< UART0CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_SDIO1CLKEN_Pos (16UL)                   /*!< SDIO1CLKEN (Bit 16)                                   */
#define CLKGEN_CLOCKEN3STAT_SDIO1CLKEN_Msk (0x10000UL)              /*!< SDIO1CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_SDIO0CLKEN_Pos (15UL)                   /*!< SDIO0CLKEN (Bit 15)                                   */
#define CLKGEN_CLOCKEN3STAT_SDIO0CLKEN_Msk (0x8000UL)               /*!< SDIO0CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_RTCCLKEN_Pos  (14UL)                    /*!< RTCCLKEN (Bit 14)                                     */
#define CLKGEN_CLOCKEN3STAT_RTCCLKEN_Msk  (0x4000UL)                /*!< RTCCLKEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_CLOCKEN3STAT_RSTGENPOSCLKEN_Pos (13UL)               /*!< RSTGENPOSCLKEN (Bit 13)                               */
#define CLKGEN_CLOCKEN3STAT_RSTGENPOSCLKEN_Msk (0x2000UL)           /*!< RSTGENPOSCLKEN (Bitfield-Mask: 0x01)                  */
#define CLKGEN_CLOCKEN3STAT_RSTGENCLKEN_Pos (12UL)                  /*!< RSTGENCLKEN (Bit 12)                                  */
#define CLKGEN_CLOCKEN3STAT_RSTGENCLKEN_Msk (0x1000UL)              /*!< RSTGENCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN3STAT_OTPXTLCLKEN_Pos (11UL)                  /*!< OTPXTLCLKEN (Bit 11)                                  */
#define CLKGEN_CLOCKEN3STAT_OTPXTLCLKEN_Msk (0x800UL)               /*!< OTPXTLCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN3STAT_MSPI3CLKEN_Pos (10UL)                   /*!< MSPI3CLKEN (Bit 10)                                   */
#define CLKGEN_CLOCKEN3STAT_MSPI3CLKEN_Msk (0x400UL)                /*!< MSPI3CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_MSPI2CLKEN_Pos (9UL)                    /*!< MSPI2CLKEN (Bit 9)                                    */
#define CLKGEN_CLOCKEN3STAT_MSPI2CLKEN_Msk (0x200UL)                /*!< MSPI2CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_MSPI1CLKEN_Pos (8UL)                    /*!< MSPI1CLKEN (Bit 8)                                    */
#define CLKGEN_CLOCKEN3STAT_MSPI1CLKEN_Msk (0x100UL)                /*!< MSPI1CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_MSPI0CLKEN_Pos (7UL)                    /*!< MSPI0CLKEN (Bit 7)                                    */
#define CLKGEN_CLOCKEN3STAT_MSPI0CLKEN_Msk (0x80UL)                 /*!< MSPI0CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_IOM7CLKEN_Pos (6UL)                     /*!< IOM7CLKEN (Bit 6)                                     */
#define CLKGEN_CLOCKEN3STAT_IOM7CLKEN_Msk (0x40UL)                  /*!< IOM7CLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN3STAT_IOM6CLKEN_Pos (5UL)                     /*!< IOM6CLKEN (Bit 5)                                     */
#define CLKGEN_CLOCKEN3STAT_IOM6CLKEN_Msk (0x20UL)                  /*!< IOM6CLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN3STAT_IOM5CLKEN_Pos (4UL)                     /*!< IOM5CLKEN (Bit 4)                                     */
#define CLKGEN_CLOCKEN3STAT_IOM5CLKEN_Msk (0x10UL)                  /*!< IOM5CLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN3STAT_IOM4CLKEN_Pos (3UL)                     /*!< IOM4CLKEN (Bit 3)                                     */
#define CLKGEN_CLOCKEN3STAT_IOM4CLKEN_Msk (0x8UL)                   /*!< IOM4CLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN3STAT_IOM3CLKEN_Pos (2UL)                     /*!< IOM3CLKEN (Bit 2)                                     */
#define CLKGEN_CLOCKEN3STAT_IOM3CLKEN_Msk (0x4UL)                   /*!< IOM3CLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN3STAT_IOM2CLKEN_Pos (1UL)                     /*!< IOM2CLKEN (Bit 1)                                     */
#define CLKGEN_CLOCKEN3STAT_IOM2CLKEN_Msk (0x2UL)                   /*!< IOM2CLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN3STAT_IOM1CLKEN_Pos (0UL)                     /*!< IOM1CLKEN (Bit 0)                                     */
#define CLKGEN_CLOCKEN3STAT_IOM1CLKEN_Msk (0x1UL)                   /*!< IOM1CLKEN (Bitfield-Mask: 0x01)                       */
/* =========================================================  MISC  ========================================================== */
#define CLKGEN_MISC_CLKGENMISCSPARE_Pos   (25UL)                    /*!< CLKGENMISCSPARE (Bit 25)                              */
#define CLKGEN_MISC_CLKGENMISCSPARE_Msk   (0x2000000UL)             /*!< CLKGENMISCSPARE (Bitfield-Mask: 0x01)                 */
#define CLKGEN_MISC_HFRC96TRUNKGATE_Pos   (24UL)                    /*!< HFRC96TRUNKGATE (Bit 24)                              */
#define CLKGEN_MISC_HFRC96TRUNKGATE_Msk   (0x1000000UL)             /*!< HFRC96TRUNKGATE (Bitfield-Mask: 0x01)                 */
#define CLKGEN_MISC_HFRCFUNCCLKGATEEN_Pos (23UL)                    /*!< HFRCFUNCCLKGATEEN (Bit 23)                            */
#define CLKGEN_MISC_HFRCFUNCCLKGATEEN_Msk (0x800000UL)              /*!< HFRCFUNCCLKGATEEN (Bitfield-Mask: 0x01)               */
#define CLKGEN_MISC_ETMTRACECLKCLKGATEEN_Pos (22UL)                 /*!< ETMTRACECLKCLKGATEEN (Bit 22)                         */
#define CLKGEN_MISC_ETMTRACECLKCLKGATEEN_Msk (0x400000UL)           /*!< ETMTRACECLKCLKGATEEN (Bitfield-Mask: 0x01)            */
#define CLKGEN_MISC_APBDMACPUCLKCLKGATEEN_Pos (21UL)                /*!< APBDMACPUCLKCLKGATEEN (Bit 21)                        */
#define CLKGEN_MISC_APBDMACPUCLKCLKGATEEN_Msk (0x200000UL)          /*!< APBDMACPUCLKCLKGATEEN (Bitfield-Mask: 0x01)           */
#define CLKGEN_MISC_GFXAXICLKCLKGATEEN_Pos (20UL)                   /*!< GFXAXICLKCLKGATEEN (Bit 20)                           */
#define CLKGEN_MISC_GFXAXICLKCLKGATEEN_Msk (0x100000UL)             /*!< GFXAXICLKCLKGATEEN (Bitfield-Mask: 0x01)              */
#define CLKGEN_MISC_GFXCLKCLKGATEEN_Pos   (19UL)                    /*!< GFXCLKCLKGATEEN (Bit 19)                              */
#define CLKGEN_MISC_GFXCLKCLKGATEEN_Msk   (0x80000UL)               /*!< GFXCLKCLKGATEEN (Bitfield-Mask: 0x01)                 */
#define CLKGEN_MISC_PWRONCLKENUSBREFCLK_Pos (17UL)                  /*!< PWRONCLKENUSBREFCLK (Bit 17)                          */
#define CLKGEN_MISC_PWRONCLKENUSBREFCLK_Msk (0x20000UL)             /*!< PWRONCLKENUSBREFCLK (Bitfield-Mask: 0x01)             */
#define CLKGEN_MISC_PWRONCLKENI2S1REFCLK_Pos (16UL)                 /*!< PWRONCLKENI2S1REFCLK (Bit 16)                         */
#define CLKGEN_MISC_PWRONCLKENI2S1REFCLK_Msk (0x10000UL)            /*!< PWRONCLKENI2S1REFCLK (Bitfield-Mask: 0x01)            */
#define CLKGEN_MISC_PWRONCLKENI2S0REFCLK_Pos (15UL)                 /*!< PWRONCLKENI2S0REFCLK (Bit 15)                         */
#define CLKGEN_MISC_PWRONCLKENI2S0REFCLK_Msk (0x8000UL)             /*!< PWRONCLKENI2S0REFCLK (Bitfield-Mask: 0x01)            */
#define CLKGEN_MISC_AXIXACLKENOVRRIDE_Pos (14UL)                    /*!< AXIXACLKENOVRRIDE (Bit 14)                            */
#define CLKGEN_MISC_AXIXACLKENOVRRIDE_Msk (0x4000UL)                /*!< AXIXACLKENOVRRIDE (Bitfield-Mask: 0x01)               */
#define CLKGEN_MISC_PWRONCLKENI2S1_Pos    (13UL)                    /*!< PWRONCLKENI2S1 (Bit 13)                               */
#define CLKGEN_MISC_PWRONCLKENI2S1_Msk    (0x2000UL)                /*!< PWRONCLKENI2S1 (Bitfield-Mask: 0x01)                  */
#define CLKGEN_MISC_PWRONCLKENI2S0_Pos    (12UL)                    /*!< PWRONCLKENI2S0 (Bit 12)                               */
#define CLKGEN_MISC_PWRONCLKENI2S0_Msk    (0x1000UL)                /*!< PWRONCLKENI2S0 (Bitfield-Mask: 0x01)                  */
#define CLKGEN_MISC_PWRONCLKENCRYPTO_Pos  (11UL)                    /*!< PWRONCLKENCRYPTO (Bit 11)                             */
#define CLKGEN_MISC_PWRONCLKENCRYPTO_Msk  (0x800UL)                 /*!< PWRONCLKENCRYPTO (Bitfield-Mask: 0x01)                */
#define CLKGEN_MISC_PWRONCLKENSDIO_Pos    (10UL)                    /*!< PWRONCLKENSDIO (Bit 10)                               */
#define CLKGEN_MISC_PWRONCLKENSDIO_Msk    (0x400UL)                 /*!< PWRONCLKENSDIO (Bitfield-Mask: 0x01)                  */
#define CLKGEN_MISC_PWRONCLKENUSB_Pos     (9UL)                     /*!< PWRONCLKENUSB (Bit 9)                                 */
