AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
#define GPIO_PINCFG125_FIEN125_Pos        (26UL)                    /*!< FIEN125 (Bit 26)                                      */
#define GPIO_PINCFG125_FIEN125_Msk        (0x4000000UL)             /*!< FIEN125 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG125_NCEPOL125_Pos      (22UL)                    /*!< NCEPOL125 (Bit 22)                                    */
#define GPIO_PINCFG125_NCEPOL125_Msk      (0x400000UL)              /*!< NCEPOL125 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG125_NCESRC125_Pos      (16UL)                    /*!< NCESRC125 (Bit 16)                                    */
#define GPIO_PINCFG125_NCESRC125_Msk      (0x3f0000UL)              /*!< NCESRC125 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG125_PULLCFG125_Pos     (13UL)                    /*!< PULLCFG125 (Bit 13)                                   */
#define GPIO_PINCFG125_PULLCFG125_Msk     (0xe000UL)                /*!< PULLCFG125 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG125_SR125_Pos          (12UL)                    /*!< SR125 (Bit 12)                                        */
#define GPIO_PINCFG125_SR125_Msk          (0x1000UL)                /*!< SR125 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG125_DS125_Pos          (10UL)                    /*!< DS125 (Bit 10)                                        */
#define GPIO_PINCFG125_DS125_Msk          (0xc00UL)                 /*!< DS125 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG125_OUTCFG125_Pos      (8UL)                     /*!< OUTCFG125 (Bit 8)                                     */
#define GPIO_PINCFG125_OUTCFG125_Msk      (0x300UL)                 /*!< OUTCFG125 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG125_IRPTEN125_Pos      (6UL)                     /*!< IRPTEN125 (Bit 6)                                     */
#define GPIO_PINCFG125_IRPTEN125_Msk      (0xc0UL)                  /*!< IRPTEN125 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG125_RDZERO125_Pos      (5UL)                     /*!< RDZERO125 (Bit 5)                                     */
#define GPIO_PINCFG125_RDZERO125_Msk      (0x20UL)                  /*!< RDZERO125 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG125_INPEN125_Pos       (4UL)                     /*!< INPEN125 (Bit 4)                                      */
#define GPIO_PINCFG125_INPEN125_Msk       (0x10UL)                  /*!< INPEN125 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG125_FNCSEL125_Pos      (0UL)                     /*!< FNCSEL125 (Bit 0)                                     */
#define GPIO_PINCFG125_FNCSEL125_Msk      (0xfUL)                   /*!< FNCSEL125 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG126  ======================================================= */
#define GPIO_PINCFG126_FOEN126_Pos        (27UL)                    /*!< FOEN126 (Bit 27)                                      */
#define GPIO_PINCFG126_FOEN126_Msk        (0x8000000UL)             /*!< FOEN126 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG126_FIEN126_Pos        (26UL)                    /*!< FIEN126 (Bit 26)                                      */
#define GPIO_PINCFG126_FIEN126_Msk        (0x4000000UL)             /*!< FIEN126 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG126_NCEPOL126_Pos      (22UL)                    /*!< NCEPOL126 (Bit 22)                                    */
#define GPIO_PINCFG126_NCEPOL126_Msk      (0x400000UL)              /*!< NCEPOL126 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG126_NCESRC126_Pos      (16UL)                    /*!< NCESRC126 (Bit 16)                                    */
#define GPIO_PINCFG126_NCESRC126_Msk      (0x3f0000UL)              /*!< NCESRC126 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG126_PULLCFG126_Pos     (13UL)                    /*!< PULLCFG126 (Bit 13)                                   */
#define GPIO_PINCFG126_PULLCFG126_Msk     (0xe000UL)                /*!< PULLCFG126 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG126_SR126_Pos          (12UL)                    /*!< SR126 (Bit 12)                                        */
#define GPIO_PINCFG126_SR126_Msk          (0x1000UL)                /*!< SR126 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG126_DS126_Pos          (10UL)                    /*!< DS126 (Bit 10)                                        */
#define GPIO_PINCFG126_DS126_Msk          (0xc00UL)                 /*!< DS126 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG126_OUTCFG126_Pos      (8UL)                     /*!< OUTCFG126 (Bit 8)                                     */
#define GPIO_PINCFG126_OUTCFG126_Msk      (0x300UL)                 /*!< OUTCFG126 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG126_IRPTEN126_Pos      (6UL)                     /*!< IRPTEN126 (Bit 6)                                     */
#define GPIO_PINCFG126_IRPTEN126_Msk      (0xc0UL)                  /*!< IRPTEN126 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG126_RDZERO126_Pos      (5UL)                     /*!< RDZERO126 (Bit 5)                                     */
#define GPIO_PINCFG126_RDZERO126_Msk      (0x20UL)                  /*!< RDZERO126 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG126_INPEN126_Pos       (4UL)                     /*!< INPEN126 (Bit 4)                                      */
#define GPIO_PINCFG126_INPEN126_Msk       (0x10UL)                  /*!< INPEN126 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG126_FNCSEL126_Pos      (0UL)                     /*!< FNCSEL126 (Bit 0)                                     */
#define GPIO_PINCFG126_FNCSEL126_Msk      (0xfUL)                   /*!< FNCSEL126 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG127  ======================================================= */
#define GPIO_PINCFG127_FOEN127_Pos        (27UL)                    /*!< FOEN127 (Bit 27)                                      */
#define GPIO_PINCFG127_FOEN127_Msk        (0x8000000UL)             /*!< FOEN127 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG127_FIEN127_Pos        (26UL)                    /*!< FIEN127 (Bit 26)                                      */
#define GPIO_PINCFG127_FIEN127_Msk        (0x4000000UL)             /*!< FIEN127 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG127_NCEPOL127_Pos      (22UL)                    /*!< NCEPOL127 (Bit 22)                                    */
#define GPIO_PINCFG127_NCEPOL127_Msk      (0x400000UL)              /*!< NCEPOL127 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG127_NCESRC127_Pos      (16UL)                    /*!< NCESRC127 (Bit 16)                                    */
#define GPIO_PINCFG127_NCESRC127_Msk      (0x3f0000UL)              /*!< NCESRC127 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG127_PULLCFG127_Pos     (13UL)                    /*!< PULLCFG127 (Bit 13)                                   */
#define GPIO_PINCFG127_PULLCFG127_Msk     (0xe000UL)                /*!< PULLCFG127 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG127_SR127_Pos          (12UL)                    /*!< SR127 (Bit 12)                                        */
#define GPIO_PINCFG127_SR127_Msk          (0x1000UL)                /*!< SR127 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG127_DS127_Pos          (10UL)                    /*!< DS127 (Bit 10)                                        */
#define GPIO_PINCFG127_DS127_Msk          (0xc00UL)                 /*!< DS127 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG127_OUTCFG127_Pos      (8UL)                     /*!< OUTCFG127 (Bit 8)                                     */
#define GPIO_PINCFG127_OUTCFG127_Msk      (0x300UL)                 /*!< OUTCFG127 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG127_IRPTEN127_Pos      (6UL)                     /*!< IRPTEN127 (Bit 6)                                     */
#define GPIO_PINCFG127_IRPTEN127_Msk      (0xc0UL)                  /*!< IRPTEN127 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG127_RDZERO127_Pos      (5UL)                     /*!< RDZERO127 (Bit 5)                                     */
#define GPIO_PINCFG127_RDZERO127_Msk      (0x20UL)                  /*!< RDZERO127 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG127_INPEN127_Pos       (4UL)                     /*!< INPEN127 (Bit 4)                                      */
#define GPIO_PINCFG127_INPEN127_Msk       (0x10UL)                  /*!< INPEN127 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG127_FNCSEL127_Pos      (0UL)                     /*!< FNCSEL127 (Bit 0)                                     */
#define GPIO_PINCFG127_FNCSEL127_Msk      (0xfUL)                   /*!< FNCSEL127 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG128  ======================================================= */
#define GPIO_PINCFG128_FOEN128_Pos        (27UL)                    /*!< FOEN128 (Bit 27)                                      */
#define GPIO_PINCFG128_FOEN128_Msk        (0x8000000UL)             /*!< FOEN128 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG128_FIEN128_Pos        (26UL)                    /*!< FIEN128 (Bit 26)                                      */
#define GPIO_PINCFG128_FIEN128_Msk        (0x4000000UL)             /*!< FIEN128 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG128_NCEPOL128_Pos      (22UL)                    /*!< NCEPOL128 (Bit 22)                                    */
#define GPIO_PINCFG128_NCEPOL128_Msk      (0x400000UL)              /*!< NCEPOL128 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG128_NCESRC128_Pos      (16UL)                    /*!< NCESRC128 (Bit 16)                                    */
#define GPIO_PINCFG128_NCESRC128_Msk      (0x3f0000UL)              /*!< NCESRC128 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG128_PULLCFG128_Pos     (13UL)                    /*!< PULLCFG128 (Bit 13)                                   */
#define GPIO_PINCFG128_PULLCFG128_Msk     (0xe000UL)                /*!< PULLCFG128 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG128_SR128_Pos          (12UL)                    /*!< SR128 (Bit 12)                                        */
#define GPIO_PINCFG128_SR128_Msk          (0x1000UL)                /*!< SR128 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG128_DS128_Pos          (10UL)                    /*!< DS128 (Bit 10)                                        */
#define GPIO_PINCFG128_DS128_Msk          (0xc00UL)                 /*!< DS128 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG128_OUTCFG128_Pos      (8UL)                     /*!< OUTCFG128 (Bit 8)                                     */
#define GPIO_PINCFG128_OUTCFG128_Msk      (0x300UL)                 /*!< OUTCFG128 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG128_IRPTEN128_Pos      (6UL)                     /*!< IRPTEN128 (Bit 6)                                     */
#define GPIO_PINCFG128_IRPTEN128_Msk      (0xc0UL)                  /*!< IRPTEN128 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG128_RDZERO128_Pos      (5UL)                     /*!< RDZERO128 (Bit 5)                                     */
#define GPIO_PINCFG128_RDZERO128_Msk      (0x20UL)                  /*!< RDZERO128 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG128_INPEN128_Pos       (4UL)                     /*!< INPEN128 (Bit 4)                                      */
#define GPIO_PINCFG128_INPEN128_Msk       (0x10UL)                  /*!< INPEN128 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG128_FNCSEL128_Pos      (0UL)                     /*!< FNCSEL128 (Bit 0)                                     */
#define GPIO_PINCFG128_FNCSEL128_Msk      (0xfUL)                   /*!< FNCSEL128 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG129  ======================================================= */
#define GPIO_PINCFG129_FOEN129_Pos        (27UL)                    /*!< FOEN129 (Bit 27)                                      */
#define GPIO_PINCFG129_FOEN129_Msk        (0x8000000UL)             /*!< FOEN129 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG129_FIEN129_Pos        (26UL)                    /*!< FIEN129 (Bit 26)                                      */
#define GPIO_PINCFG129_FIEN129_Msk        (0x4000000UL)             /*!< FIEN129 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG129_NCEPOL129_Pos      (22UL)                    /*!< NCEPOL129 (Bit 22)                                    */
#define GPIO_PINCFG129_NCEPOL129_Msk      (0x400000UL)              /*!< NCEPOL129 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG129_NCESRC129_Pos      (16UL)                    /*!< NCESRC129 (Bit 16)                                    */
#define GPIO_PINCFG129_NCESRC129_Msk      (0x3f0000UL)              /*!< NCESRC129 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG129_PULLCFG129_Pos     (13UL)                    /*!< PULLCFG129 (Bit 13)                                   */
#define GPIO_PINCFG129_PULLCFG129_Msk     (0xe000UL)                /*!< PULLCFG129 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG129_SR129_Pos          (12UL)                    /*!< SR129 (Bit 12)                                        */
#define GPIO_PINCFG129_SR129_Msk          (0x1000UL)                /*!< SR129 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG129_DS129_Pos          (10UL)                    /*!< DS129 (Bit 10)                                        */
#define GPIO_PINCFG129_DS129_Msk          (0xc00UL)                 /*!< DS129 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG129_OUTCFG129_Pos      (8UL)                     /*!< OUTCFG129 (Bit 8)                                     */
#define GPIO_PINCFG129_OUTCFG129_Msk      (0x300UL)                 /*!< OUTCFG129 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG129_IRPTEN129_Pos      (6UL)                     /*!< IRPTEN129 (Bit 6)                                     */
#define GPIO_PINCFG129_IRPTEN129_Msk      (0xc0UL)                  /*!< IRPTEN129 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG129_RDZERO129_Pos      (5UL)                     /*!< RDZERO129 (Bit 5)                                     */
#define GPIO_PINCFG129_RDZERO129_Msk      (0x20UL)                  /*!< RDZERO129 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG129_INPEN129_Pos       (4UL)                     /*!< INPEN129 (Bit 4)                                      */
#define GPIO_PINCFG129_INPEN129_Msk       (0x10UL)                  /*!< INPEN129 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG129_FNCSEL129_Pos      (0UL)                     /*!< FNCSEL129 (Bit 0)                                     */
#define GPIO_PINCFG129_FNCSEL129_Msk      (0xfUL)                   /*!< FNCSEL129 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG130  ======================================================= */
#define GPIO_PINCFG130_FOEN130_Pos        (27UL)                    /*!< FOEN130 (Bit 27)                                      */
#define GPIO_PINCFG130_FOEN130_Msk        (0x8000000UL)             /*!< FOEN130 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG130_FIEN130_Pos        (26UL)                    /*!< FIEN130 (Bit 26)                                      */
#define GPIO_PINCFG130_FIEN130_Msk        (0x4000000UL)             /*!< FIEN130 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG130_NCEPOL130_Pos      (22UL)                    /*!< NCEPOL130 (Bit 22)                                    */
#define GPIO_PINCFG130_NCEPOL130_Msk      (0x400000UL)              /*!< NCEPOL130 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG130_NCESRC130_Pos      (16UL)                    /*!< NCESRC130 (Bit 16)                                    */
#define GPIO_PINCFG130_NCESRC130_Msk      (0x3f0000UL)              /*!< NCESRC130 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG130_PULLCFG130_Pos     (13UL)                    /*!< PULLCFG130 (Bit 13)                                   */
#define GPIO_PINCFG130_PULLCFG130_Msk     (0xe000UL)                /*!< PULLCFG130 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG130_SR130_Pos          (12UL)                    /*!< SR130 (Bit 12)                                        */
#define GPIO_PINCFG130_SR130_Msk          (0x1000UL)                /*!< SR130 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG130_DS130_Pos          (10UL)                    /*!< DS130 (Bit 10)                                        */
#define GPIO_PINCFG130_DS130_Msk          (0xc00UL)                 /*!< DS130 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG130_OUTCFG130_Pos      (8UL)                     /*!< OUTCFG130 (Bit 8)                                     */
#define GPIO_PINCFG130_OUTCFG130_Msk      (0x300UL)                 /*!< OUTCFG130 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG130_IRPTEN130_Pos      (6UL)                     /*!< IRPTEN130 (Bit 6)                                     */
#define GPIO_PINCFG130_IRPTEN130_Msk      (0xc0UL)                  /*!< IRPTEN130 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG130_RDZERO130_Pos      (5UL)                     /*!< RDZERO130 (Bit 5)                                     */
#define GPIO_PINCFG130_RDZERO130_Msk      (0x20UL)                  /*!< RDZERO130 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG130_INPEN130_Pos       (4UL)                     /*!< INPEN130 (Bit 4)                                      */
#define GPIO_PINCFG130_INPEN130_Msk       (0x10UL)                  /*!< INPEN130 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG130_FNCSEL130_Pos      (0UL)                     /*!< FNCSEL130 (Bit 0)                                     */
#define GPIO_PINCFG130_FNCSEL130_Msk      (0xfUL)                   /*!< FNCSEL130 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG131  ======================================================= */
#define GPIO_PINCFG131_FOEN131_Pos        (27UL)                    /*!< FOEN131 (Bit 27)                                      */
#define GPIO_PINCFG131_FOEN131_Msk        (0x8000000UL)             /*!< FOEN131 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG131_FIEN131_Pos        (26UL)                    /*!< FIEN131 (Bit 26)                                      */
#define GPIO_PINCFG131_FIEN131_Msk        (0x4000000UL)             /*!< FIEN131 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG131_NCEPOL131_Pos      (22UL)                    /*!< NCEPOL131 (Bit 22)                                    */
#define GPIO_PINCFG131_NCEPOL131_Msk      (0x400000UL)              /*!< NCEPOL131 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG131_NCESRC131_Pos      (16UL)                    /*!< NCESRC131 (Bit 16)                                    */
#define GPIO_PINCFG131_NCESRC131_Msk      (0x3f0000UL)              /*!< NCESRC131 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG131_PULLCFG131_Pos     (13UL)                    /*!< PULLCFG131 (Bit 13)                                   */
#define GPIO_PINCFG131_PULLCFG131_Msk     (0xe000UL)                /*!< PULLCFG131 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG131_SR131_Pos          (12UL)                    /*!< SR131 (Bit 12)                                        */
#define GPIO_PINCFG131_SR131_Msk          (0x1000UL)                /*!< SR131 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG131_DS131_Pos          (10UL)                    /*!< DS131 (Bit 10)                                        */
#define GPIO_PINCFG131_DS131_Msk          (0xc00UL)                 /*!< DS131 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG131_OUTCFG131_Pos      (8UL)                     /*!< OUTCFG131 (Bit 8)                                     */
#define GPIO_PINCFG131_OUTCFG131_Msk      (0x300UL)                 /*!< OUTCFG131 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG131_IRPTEN131_Pos      (6UL)                     /*!< IRPTEN131 (Bit 6)                                     */
#define GPIO_PINCFG131_IRPTEN131_Msk      (0xc0UL)                  /*!< IRPTEN131 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG131_RDZERO131_Pos      (5UL)                     /*!< RDZERO131 (Bit 5)                                     */
#define GPIO_PINCFG131_RDZERO131_Msk      (0x20UL)                  /*!< RDZERO131 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG131_INPEN131_Pos       (4UL)                     /*!< INPEN131 (Bit 4)                                      */
#define GPIO_PINCFG131_INPEN131_Msk       (0x10UL)                  /*!< INPEN131 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG131_FNCSEL131_Pos      (0UL)                     /*!< FNCSEL131 (Bit 0)                                     */
#define GPIO_PINCFG131_FNCSEL131_Msk      (0xfUL)                   /*!< FNCSEL131 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG132  ======================================================= */
#define GPIO_PINCFG132_FOEN132_Pos        (27UL)                    /*!< FOEN132 (Bit 27)                                      */
#define GPIO_PINCFG132_FOEN132_Msk        (0x8000000UL)             /*!< FOEN132 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG132_FIEN132_Pos        (26UL)                    /*!< FIEN132 (Bit 26)                                      */
#define GPIO_PINCFG132_FIEN132_Msk        (0x4000000UL)             /*!< FIEN132 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG132_NCEPOL132_Pos      (22UL)                    /*!< NCEPOL132 (Bit 22)                                    */
#define GPIO_PINCFG132_NCEPOL132_Msk      (0x400000UL)              /*!< NCEPOL132 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG132_NCESRC132_Pos      (16UL)                    /*!< NCESRC132 (Bit 16)                                    */
#define GPIO_PINCFG132_NCESRC132_Msk      (0x3f0000UL)              /*!< NCESRC132 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG132_PULLCFG132_Pos     (13UL)                    /*!< PULLCFG132 (Bit 13)                                   */
#define GPIO_PINCFG132_PULLCFG132_Msk     (0xe000UL)                /*!< PULLCFG132 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG132_SR132_Pos          (12UL)                    /*!< SR132 (Bit 12)                                        */
