AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
#define GPIO_PINCFG132_SR132_Msk          (0x1000UL)                /*!< SR132 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG132_DS132_Pos          (10UL)                    /*!< DS132 (Bit 10)                                        */
#define GPIO_PINCFG132_DS132_Msk          (0xc00UL)                 /*!< DS132 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG132_OUTCFG132_Pos      (8UL)                     /*!< OUTCFG132 (Bit 8)                                     */
#define GPIO_PINCFG132_OUTCFG132_Msk      (0x300UL)                 /*!< OUTCFG132 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG132_IRPTEN132_Pos      (6UL)                     /*!< IRPTEN132 (Bit 6)                                     */
#define GPIO_PINCFG132_IRPTEN132_Msk      (0xc0UL)                  /*!< IRPTEN132 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG132_RDZERO132_Pos      (5UL)                     /*!< RDZERO132 (Bit 5)                                     */
#define GPIO_PINCFG132_RDZERO132_Msk      (0x20UL)                  /*!< RDZERO132 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG132_INPEN132_Pos       (4UL)                     /*!< INPEN132 (Bit 4)                                      */
#define GPIO_PINCFG132_INPEN132_Msk       (0x10UL)                  /*!< INPEN132 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG132_FNCSEL132_Pos      (0UL)                     /*!< FNCSEL132 (Bit 0)                                     */
#define GPIO_PINCFG132_FNCSEL132_Msk      (0xfUL)                   /*!< FNCSEL132 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG133  ======================================================= */
#define GPIO_PINCFG133_FOEN133_Pos        (27UL)                    /*!< FOEN133 (Bit 27)                                      */
#define GPIO_PINCFG133_FOEN133_Msk        (0x8000000UL)             /*!< FOEN133 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG133_FIEN133_Pos        (26UL)                    /*!< FIEN133 (Bit 26)                                      */
#define GPIO_PINCFG133_FIEN133_Msk        (0x4000000UL)             /*!< FIEN133 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG133_NCEPOL133_Pos      (22UL)                    /*!< NCEPOL133 (Bit 22)                                    */
#define GPIO_PINCFG133_NCEPOL133_Msk      (0x400000UL)              /*!< NCEPOL133 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG133_NCESRC133_Pos      (16UL)                    /*!< NCESRC133 (Bit 16)                                    */
#define GPIO_PINCFG133_NCESRC133_Msk      (0x3f0000UL)              /*!< NCESRC133 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG133_PULLCFG133_Pos     (13UL)                    /*!< PULLCFG133 (Bit 13)                                   */
#define GPIO_PINCFG133_PULLCFG133_Msk     (0xe000UL)                /*!< PULLCFG133 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG133_SR133_Pos          (12UL)                    /*!< SR133 (Bit 12)                                        */
#define GPIO_PINCFG133_SR133_Msk          (0x1000UL)                /*!< SR133 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG133_DS133_Pos          (10UL)                    /*!< DS133 (Bit 10)                                        */
#define GPIO_PINCFG133_DS133_Msk          (0xc00UL)                 /*!< DS133 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG133_OUTCFG133_Pos      (8UL)                     /*!< OUTCFG133 (Bit 8)                                     */
#define GPIO_PINCFG133_OUTCFG133_Msk      (0x300UL)                 /*!< OUTCFG133 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG133_IRPTEN133_Pos      (6UL)                     /*!< IRPTEN133 (Bit 6)                                     */
#define GPIO_PINCFG133_IRPTEN133_Msk      (0xc0UL)                  /*!< IRPTEN133 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG133_RDZERO133_Pos      (5UL)                     /*!< RDZERO133 (Bit 5)                                     */
#define GPIO_PINCFG133_RDZERO133_Msk      (0x20UL)                  /*!< RDZERO133 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG133_INPEN133_Pos       (4UL)                     /*!< INPEN133 (Bit 4)                                      */
#define GPIO_PINCFG133_INPEN133_Msk       (0x10UL)                  /*!< INPEN133 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG133_FNCSEL133_Pos      (0UL)                     /*!< FNCSEL133 (Bit 0)                                     */
#define GPIO_PINCFG133_FNCSEL133_Msk      (0xfUL)                   /*!< FNCSEL133 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG134  ======================================================= */
#define GPIO_PINCFG134_FOEN134_Pos        (27UL)                    /*!< FOEN134 (Bit 27)                                      */
#define GPIO_PINCFG134_FOEN134_Msk        (0x8000000UL)             /*!< FOEN134 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG134_FIEN134_Pos        (26UL)                    /*!< FIEN134 (Bit 26)                                      */
#define GPIO_PINCFG134_FIEN134_Msk        (0x4000000UL)             /*!< FIEN134 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG134_NCEPOL134_Pos      (22UL)                    /*!< NCEPOL134 (Bit 22)                                    */
#define GPIO_PINCFG134_NCEPOL134_Msk      (0x400000UL)              /*!< NCEPOL134 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG134_NCESRC134_Pos      (16UL)                    /*!< NCESRC134 (Bit 16)                                    */
#define GPIO_PINCFG134_NCESRC134_Msk      (0x3f0000UL)              /*!< NCESRC134 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG134_PULLCFG134_Pos     (13UL)                    /*!< PULLCFG134 (Bit 13)                                   */
#define GPIO_PINCFG134_PULLCFG134_Msk     (0xe000UL)                /*!< PULLCFG134 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG134_SR134_Pos          (12UL)                    /*!< SR134 (Bit 12)                                        */
#define GPIO_PINCFG134_SR134_Msk          (0x1000UL)                /*!< SR134 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG134_DS134_Pos          (10UL)                    /*!< DS134 (Bit 10)                                        */
#define GPIO_PINCFG134_DS134_Msk          (0xc00UL)                 /*!< DS134 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG134_OUTCFG134_Pos      (8UL)                     /*!< OUTCFG134 (Bit 8)                                     */
#define GPIO_PINCFG134_OUTCFG134_Msk      (0x300UL)                 /*!< OUTCFG134 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG134_IRPTEN134_Pos      (6UL)                     /*!< IRPTEN134 (Bit 6)                                     */
#define GPIO_PINCFG134_IRPTEN134_Msk      (0xc0UL)                  /*!< IRPTEN134 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG134_RDZERO134_Pos      (5UL)                     /*!< RDZERO134 (Bit 5)                                     */
#define GPIO_PINCFG134_RDZERO134_Msk      (0x20UL)                  /*!< RDZERO134 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG134_INPEN134_Pos       (4UL)                     /*!< INPEN134 (Bit 4)                                      */
#define GPIO_PINCFG134_INPEN134_Msk       (0x10UL)                  /*!< INPEN134 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG134_FNCSEL134_Pos      (0UL)                     /*!< FNCSEL134 (Bit 0)                                     */
#define GPIO_PINCFG134_FNCSEL134_Msk      (0xfUL)                   /*!< FNCSEL134 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG135  ======================================================= */
#define GPIO_PINCFG135_FOEN135_Pos        (27UL)                    /*!< FOEN135 (Bit 27)                                      */
#define GPIO_PINCFG135_FOEN135_Msk        (0x8000000UL)             /*!< FOEN135 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG135_FIEN135_Pos        (26UL)                    /*!< FIEN135 (Bit 26)                                      */
#define GPIO_PINCFG135_FIEN135_Msk        (0x4000000UL)             /*!< FIEN135 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG135_NCEPOL135_Pos      (22UL)                    /*!< NCEPOL135 (Bit 22)                                    */
#define GPIO_PINCFG135_NCEPOL135_Msk      (0x400000UL)              /*!< NCEPOL135 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG135_NCESRC135_Pos      (16UL)                    /*!< NCESRC135 (Bit 16)                                    */
#define GPIO_PINCFG135_NCESRC135_Msk      (0x3f0000UL)              /*!< NCESRC135 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG135_PULLCFG135_Pos     (13UL)                    /*!< PULLCFG135 (Bit 13)                                   */
#define GPIO_PINCFG135_PULLCFG135_Msk     (0xe000UL)                /*!< PULLCFG135 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG135_SR135_Pos          (12UL)                    /*!< SR135 (Bit 12)                                        */
#define GPIO_PINCFG135_SR135_Msk          (0x1000UL)                /*!< SR135 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG135_DS135_Pos          (10UL)                    /*!< DS135 (Bit 10)                                        */
#define GPIO_PINCFG135_DS135_Msk          (0xc00UL)                 /*!< DS135 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG135_OUTCFG135_Pos      (8UL)                     /*!< OUTCFG135 (Bit 8)                                     */
#define GPIO_PINCFG135_OUTCFG135_Msk      (0x300UL)                 /*!< OUTCFG135 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG135_IRPTEN135_Pos      (6UL)                     /*!< IRPTEN135 (Bit 6)                                     */
#define GPIO_PINCFG135_IRPTEN135_Msk      (0xc0UL)                  /*!< IRPTEN135 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG135_RDZERO135_Pos      (5UL)                     /*!< RDZERO135 (Bit 5)                                     */
#define GPIO_PINCFG135_RDZERO135_Msk      (0x20UL)                  /*!< RDZERO135 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG135_INPEN135_Pos       (4UL)                     /*!< INPEN135 (Bit 4)                                      */
#define GPIO_PINCFG135_INPEN135_Msk       (0x10UL)                  /*!< INPEN135 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG135_FNCSEL135_Pos      (0UL)                     /*!< FNCSEL135 (Bit 0)                                     */
#define GPIO_PINCFG135_FNCSEL135_Msk      (0xfUL)                   /*!< FNCSEL135 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG136  ======================================================= */
#define GPIO_PINCFG136_FOEN136_Pos        (27UL)                    /*!< FOEN136 (Bit 27)                                      */
#define GPIO_PINCFG136_FOEN136_Msk        (0x8000000UL)             /*!< FOEN136 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG136_FIEN136_Pos        (26UL)                    /*!< FIEN136 (Bit 26)                                      */
#define GPIO_PINCFG136_FIEN136_Msk        (0x4000000UL)             /*!< FIEN136 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG136_NCEPOL136_Pos      (22UL)                    /*!< NCEPOL136 (Bit 22)                                    */
#define GPIO_PINCFG136_NCEPOL136_Msk      (0x400000UL)              /*!< NCEPOL136 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG136_NCESRC136_Pos      (16UL)                    /*!< NCESRC136 (Bit 16)                                    */
#define GPIO_PINCFG136_NCESRC136_Msk      (0x3f0000UL)              /*!< NCESRC136 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG136_PULLCFG136_Pos     (13UL)                    /*!< PULLCFG136 (Bit 13)                                   */
#define GPIO_PINCFG136_PULLCFG136_Msk     (0xe000UL)                /*!< PULLCFG136 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG136_SR136_Pos          (12UL)                    /*!< SR136 (Bit 12)                                        */
#define GPIO_PINCFG136_SR136_Msk          (0x1000UL)                /*!< SR136 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG136_DS136_Pos          (10UL)                    /*!< DS136 (Bit 10)                                        */
#define GPIO_PINCFG136_DS136_Msk          (0xc00UL)                 /*!< DS136 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG136_OUTCFG136_Pos      (8UL)                     /*!< OUTCFG136 (Bit 8)                                     */
#define GPIO_PINCFG136_OUTCFG136_Msk      (0x300UL)                 /*!< OUTCFG136 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG136_IRPTEN136_Pos      (6UL)                     /*!< IRPTEN136 (Bit 6)                                     */
#define GPIO_PINCFG136_IRPTEN136_Msk      (0xc0UL)                  /*!< IRPTEN136 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG136_RDZERO136_Pos      (5UL)                     /*!< RDZERO136 (Bit 5)                                     */
#define GPIO_PINCFG136_RDZERO136_Msk      (0x20UL)                  /*!< RDZERO136 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG136_INPEN136_Pos       (4UL)                     /*!< INPEN136 (Bit 4)                                      */
#define GPIO_PINCFG136_INPEN136_Msk       (0x10UL)                  /*!< INPEN136 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG136_FNCSEL136_Pos      (0UL)                     /*!< FNCSEL136 (Bit 0)                                     */
#define GPIO_PINCFG136_FNCSEL136_Msk      (0xfUL)                   /*!< FNCSEL136 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG137  ======================================================= */
#define GPIO_PINCFG137_FOEN137_Pos        (27UL)                    /*!< FOEN137 (Bit 27)                                      */
#define GPIO_PINCFG137_FOEN137_Msk        (0x8000000UL)             /*!< FOEN137 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG137_FIEN137_Pos        (26UL)                    /*!< FIEN137 (Bit 26)                                      */
#define GPIO_PINCFG137_FIEN137_Msk        (0x4000000UL)             /*!< FIEN137 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG137_NCEPOL137_Pos      (22UL)                    /*!< NCEPOL137 (Bit 22)                                    */
#define GPIO_PINCFG137_NCEPOL137_Msk      (0x400000UL)              /*!< NCEPOL137 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG137_NCESRC137_Pos      (16UL)                    /*!< NCESRC137 (Bit 16)                                    */
#define GPIO_PINCFG137_NCESRC137_Msk      (0x3f0000UL)              /*!< NCESRC137 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG137_PULLCFG137_Pos     (13UL)                    /*!< PULLCFG137 (Bit 13)                                   */
#define GPIO_PINCFG137_PULLCFG137_Msk     (0xe000UL)                /*!< PULLCFG137 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG137_SR137_Pos          (12UL)                    /*!< SR137 (Bit 12)                                        */
#define GPIO_PINCFG137_SR137_Msk          (0x1000UL)                /*!< SR137 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG137_DS137_Pos          (10UL)                    /*!< DS137 (Bit 10)                                        */
#define GPIO_PINCFG137_DS137_Msk          (0xc00UL)                 /*!< DS137 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG137_OUTCFG137_Pos      (8UL)                     /*!< OUTCFG137 (Bit 8)                                     */
#define GPIO_PINCFG137_OUTCFG137_Msk      (0x300UL)                 /*!< OUTCFG137 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG137_IRPTEN137_Pos      (6UL)                     /*!< IRPTEN137 (Bit 6)                                     */
#define GPIO_PINCFG137_IRPTEN137_Msk      (0xc0UL)                  /*!< IRPTEN137 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG137_RDZERO137_Pos      (5UL)                     /*!< RDZERO137 (Bit 5)                                     */
#define GPIO_PINCFG137_RDZERO137_Msk      (0x20UL)                  /*!< RDZERO137 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG137_INPEN137_Pos       (4UL)                     /*!< INPEN137 (Bit 4)                                      */
#define GPIO_PINCFG137_INPEN137_Msk       (0x10UL)                  /*!< INPEN137 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG137_FNCSEL137_Pos      (0UL)                     /*!< FNCSEL137 (Bit 0)                                     */
#define GPIO_PINCFG137_FNCSEL137_Msk      (0xfUL)                   /*!< FNCSEL137 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG138  ======================================================= */
#define GPIO_PINCFG138_FOEN138_Pos        (27UL)                    /*!< FOEN138 (Bit 27)                                      */
#define GPIO_PINCFG138_FOEN138_Msk        (0x8000000UL)             /*!< FOEN138 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG138_FIEN138_Pos        (26UL)                    /*!< FIEN138 (Bit 26)                                      */
#define GPIO_PINCFG138_FIEN138_Msk        (0x4000000UL)             /*!< FIEN138 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG138_NCEPOL138_Pos      (22UL)                    /*!< NCEPOL138 (Bit 22)                                    */
#define GPIO_PINCFG138_NCEPOL138_Msk      (0x400000UL)              /*!< NCEPOL138 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG138_NCESRC138_Pos      (16UL)                    /*!< NCESRC138 (Bit 16)                                    */
#define GPIO_PINCFG138_NCESRC138_Msk      (0x3f0000UL)              /*!< NCESRC138 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG138_PULLCFG138_Pos     (13UL)                    /*!< PULLCFG138 (Bit 13)                                   */
#define GPIO_PINCFG138_PULLCFG138_Msk     (0xe000UL)                /*!< PULLCFG138 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG138_SR138_Pos          (12UL)                    /*!< SR138 (Bit 12)                                        */
#define GPIO_PINCFG138_SR138_Msk          (0x1000UL)                /*!< SR138 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG138_DS138_Pos          (10UL)                    /*!< DS138 (Bit 10)                                        */
#define GPIO_PINCFG138_DS138_Msk          (0xc00UL)                 /*!< DS138 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG138_OUTCFG138_Pos      (8UL)                     /*!< OUTCFG138 (Bit 8)                                     */
#define GPIO_PINCFG138_OUTCFG138_Msk      (0x300UL)                 /*!< OUTCFG138 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG138_IRPTEN138_Pos      (6UL)                     /*!< IRPTEN138 (Bit 6)                                     */
#define GPIO_PINCFG138_IRPTEN138_Msk      (0xc0UL)                  /*!< IRPTEN138 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG138_RDZERO138_Pos      (5UL)                     /*!< RDZERO138 (Bit 5)                                     */
#define GPIO_PINCFG138_RDZERO138_Msk      (0x20UL)                  /*!< RDZERO138 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG138_INPEN138_Pos       (4UL)                     /*!< INPEN138 (Bit 4)                                      */
#define GPIO_PINCFG138_INPEN138_Msk       (0x10UL)                  /*!< INPEN138 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG138_FNCSEL138_Pos      (0UL)                     /*!< FNCSEL138 (Bit 0)                                     */
#define GPIO_PINCFG138_FNCSEL138_Msk      (0xfUL)                   /*!< FNCSEL138 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG139  ======================================================= */
#define GPIO_PINCFG139_FOEN139_Pos        (27UL)                    /*!< FOEN139 (Bit 27)                                      */
#define GPIO_PINCFG139_FOEN139_Msk        (0x8000000UL)             /*!< FOEN139 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG139_FIEN139_Pos        (26UL)                    /*!< FIEN139 (Bit 26)                                      */
#define GPIO_PINCFG139_FIEN139_Msk        (0x4000000UL)             /*!< FIEN139 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG139_NCEPOL139_Pos      (22UL)                    /*!< NCEPOL139 (Bit 22)                                    */
#define GPIO_PINCFG139_NCEPOL139_Msk      (0x400000UL)              /*!< NCEPOL139 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG139_NCESRC139_Pos      (16UL)                    /*!< NCESRC139 (Bit 16)                                    */
#define GPIO_PINCFG139_NCESRC139_Msk      (0x3f0000UL)              /*!< NCESRC139 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG139_PULLCFG139_Pos     (13UL)                    /*!< PULLCFG139 (Bit 13)                                   */
#define GPIO_PINCFG139_PULLCFG139_Msk     (0xe000UL)                /*!< PULLCFG139 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG139_SR139_Pos          (12UL)                    /*!< SR139 (Bit 12)                                        */
#define GPIO_PINCFG139_SR139_Msk          (0x1000UL)                /*!< SR139 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG139_DS139_Pos          (10UL)                    /*!< DS139 (Bit 10)                                        */
#define GPIO_PINCFG139_DS139_Msk          (0xc00UL)                 /*!< DS139 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG139_OUTCFG139_Pos      (8UL)                     /*!< OUTCFG139 (Bit 8)                                     */
#define GPIO_PINCFG139_OUTCFG139_Msk      (0x300UL)                 /*!< OUTCFG139 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG139_IRPTEN139_Pos      (6UL)                     /*!< IRPTEN139 (Bit 6)                                     */
#define GPIO_PINCFG139_IRPTEN139_Msk      (0xc0UL)                  /*!< IRPTEN139 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG139_RDZERO139_Pos      (5UL)                     /*!< RDZERO139 (Bit 5)                                     */
#define GPIO_PINCFG139_RDZERO139_Msk      (0x20UL)                  /*!< RDZERO139 (Bitfield-Mask: 0x01)                       */
