AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
#define GPIO_PINCFG161_FNCSEL161_Pos      (0UL)                     /*!< FNCSEL161 (Bit 0)                                     */
#define GPIO_PINCFG161_FNCSEL161_Msk      (0xfUL)                   /*!< FNCSEL161 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG162  ======================================================= */
#define GPIO_PINCFG162_FOEN162_Pos        (27UL)                    /*!< FOEN162 (Bit 27)                                      */
#define GPIO_PINCFG162_FOEN162_Msk        (0x8000000UL)             /*!< FOEN162 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG162_FIEN162_Pos        (26UL)                    /*!< FIEN162 (Bit 26)                                      */
#define GPIO_PINCFG162_FIEN162_Msk        (0x4000000UL)             /*!< FIEN162 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG162_NCEPOL162_Pos      (22UL)                    /*!< NCEPOL162 (Bit 22)                                    */
#define GPIO_PINCFG162_NCEPOL162_Msk      (0x400000UL)              /*!< NCEPOL162 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG162_NCESRC162_Pos      (16UL)                    /*!< NCESRC162 (Bit 16)                                    */
#define GPIO_PINCFG162_NCESRC162_Msk      (0x3f0000UL)              /*!< NCESRC162 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG162_PULLCFG162_Pos     (13UL)                    /*!< PULLCFG162 (Bit 13)                                   */
#define GPIO_PINCFG162_PULLCFG162_Msk     (0xe000UL)                /*!< PULLCFG162 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG162_SR162_Pos          (12UL)                    /*!< SR162 (Bit 12)                                        */
#define GPIO_PINCFG162_SR162_Msk          (0x1000UL)                /*!< SR162 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG162_DS162_Pos          (10UL)                    /*!< DS162 (Bit 10)                                        */
#define GPIO_PINCFG162_DS162_Msk          (0xc00UL)                 /*!< DS162 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG162_OUTCFG162_Pos      (8UL)                     /*!< OUTCFG162 (Bit 8)                                     */
#define GPIO_PINCFG162_OUTCFG162_Msk      (0x300UL)                 /*!< OUTCFG162 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG162_IRPTEN162_Pos      (6UL)                     /*!< IRPTEN162 (Bit 6)                                     */
#define GPIO_PINCFG162_IRPTEN162_Msk      (0xc0UL)                  /*!< IRPTEN162 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG162_RDZERO162_Pos      (5UL)                     /*!< RDZERO162 (Bit 5)                                     */
#define GPIO_PINCFG162_RDZERO162_Msk      (0x20UL)                  /*!< RDZERO162 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG162_INPEN162_Pos       (4UL)                     /*!< INPEN162 (Bit 4)                                      */
#define GPIO_PINCFG162_INPEN162_Msk       (0x10UL)                  /*!< INPEN162 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG162_FNCSEL162_Pos      (0UL)                     /*!< FNCSEL162 (Bit 0)                                     */
#define GPIO_PINCFG162_FNCSEL162_Msk      (0xfUL)                   /*!< FNCSEL162 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG163  ======================================================= */
#define GPIO_PINCFG163_FOEN163_Pos        (27UL)                    /*!< FOEN163 (Bit 27)                                      */
#define GPIO_PINCFG163_FOEN163_Msk        (0x8000000UL)             /*!< FOEN163 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG163_FIEN163_Pos        (26UL)                    /*!< FIEN163 (Bit 26)                                      */
#define GPIO_PINCFG163_FIEN163_Msk        (0x4000000UL)             /*!< FIEN163 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG163_NCEPOL163_Pos      (22UL)                    /*!< NCEPOL163 (Bit 22)                                    */
#define GPIO_PINCFG163_NCEPOL163_Msk      (0x400000UL)              /*!< NCEPOL163 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG163_NCESRC163_Pos      (16UL)                    /*!< NCESRC163 (Bit 16)                                    */
#define GPIO_PINCFG163_NCESRC163_Msk      (0x3f0000UL)              /*!< NCESRC163 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG163_PULLCFG163_Pos     (13UL)                    /*!< PULLCFG163 (Bit 13)                                   */
#define GPIO_PINCFG163_PULLCFG163_Msk     (0xe000UL)                /*!< PULLCFG163 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG163_SR163_Pos          (12UL)                    /*!< SR163 (Bit 12)                                        */
#define GPIO_PINCFG163_SR163_Msk          (0x1000UL)                /*!< SR163 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG163_DS163_Pos          (10UL)                    /*!< DS163 (Bit 10)                                        */
#define GPIO_PINCFG163_DS163_Msk          (0xc00UL)                 /*!< DS163 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG163_OUTCFG163_Pos      (8UL)                     /*!< OUTCFG163 (Bit 8)                                     */
#define GPIO_PINCFG163_OUTCFG163_Msk      (0x300UL)                 /*!< OUTCFG163 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG163_IRPTEN163_Pos      (6UL)                     /*!< IRPTEN163 (Bit 6)                                     */
#define GPIO_PINCFG163_IRPTEN163_Msk      (0xc0UL)                  /*!< IRPTEN163 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG163_RDZERO163_Pos      (5UL)                     /*!< RDZERO163 (Bit 5)                                     */
#define GPIO_PINCFG163_RDZERO163_Msk      (0x20UL)                  /*!< RDZERO163 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG163_INPEN163_Pos       (4UL)                     /*!< INPEN163 (Bit 4)                                      */
#define GPIO_PINCFG163_INPEN163_Msk       (0x10UL)                  /*!< INPEN163 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG163_FNCSEL163_Pos      (0UL)                     /*!< FNCSEL163 (Bit 0)                                     */
#define GPIO_PINCFG163_FNCSEL163_Msk      (0xfUL)                   /*!< FNCSEL163 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG164  ======================================================= */
#define GPIO_PINCFG164_FOEN164_Pos        (27UL)                    /*!< FOEN164 (Bit 27)                                      */
#define GPIO_PINCFG164_FOEN164_Msk        (0x8000000UL)             /*!< FOEN164 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG164_FIEN164_Pos        (26UL)                    /*!< FIEN164 (Bit 26)                                      */
#define GPIO_PINCFG164_FIEN164_Msk        (0x4000000UL)             /*!< FIEN164 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG164_NCEPOL164_Pos      (22UL)                    /*!< NCEPOL164 (Bit 22)                                    */
#define GPIO_PINCFG164_NCEPOL164_Msk      (0x400000UL)              /*!< NCEPOL164 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG164_NCESRC164_Pos      (16UL)                    /*!< NCESRC164 (Bit 16)                                    */
#define GPIO_PINCFG164_NCESRC164_Msk      (0x3f0000UL)              /*!< NCESRC164 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG164_PULLCFG164_Pos     (13UL)                    /*!< PULLCFG164 (Bit 13)                                   */
#define GPIO_PINCFG164_PULLCFG164_Msk     (0xe000UL)                /*!< PULLCFG164 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG164_SR164_Pos          (12UL)                    /*!< SR164 (Bit 12)                                        */
#define GPIO_PINCFG164_SR164_Msk          (0x1000UL)                /*!< SR164 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG164_DS164_Pos          (10UL)                    /*!< DS164 (Bit 10)                                        */
#define GPIO_PINCFG164_DS164_Msk          (0xc00UL)                 /*!< DS164 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG164_OUTCFG164_Pos      (8UL)                     /*!< OUTCFG164 (Bit 8)                                     */
#define GPIO_PINCFG164_OUTCFG164_Msk      (0x300UL)                 /*!< OUTCFG164 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG164_IRPTEN164_Pos      (6UL)                     /*!< IRPTEN164 (Bit 6)                                     */
#define GPIO_PINCFG164_IRPTEN164_Msk      (0xc0UL)                  /*!< IRPTEN164 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG164_RDZERO164_Pos      (5UL)                     /*!< RDZERO164 (Bit 5)                                     */
#define GPIO_PINCFG164_RDZERO164_Msk      (0x20UL)                  /*!< RDZERO164 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG164_INPEN164_Pos       (4UL)                     /*!< INPEN164 (Bit 4)                                      */
#define GPIO_PINCFG164_INPEN164_Msk       (0x10UL)                  /*!< INPEN164 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG164_FNCSEL164_Pos      (0UL)                     /*!< FNCSEL164 (Bit 0)                                     */
#define GPIO_PINCFG164_FNCSEL164_Msk      (0xfUL)                   /*!< FNCSEL164 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG165  ======================================================= */
#define GPIO_PINCFG165_FOEN165_Pos        (27UL)                    /*!< FOEN165 (Bit 27)                                      */
#define GPIO_PINCFG165_FOEN165_Msk        (0x8000000UL)             /*!< FOEN165 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG165_FIEN165_Pos        (26UL)                    /*!< FIEN165 (Bit 26)                                      */
#define GPIO_PINCFG165_FIEN165_Msk        (0x4000000UL)             /*!< FIEN165 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG165_NCEPOL165_Pos      (22UL)                    /*!< NCEPOL165 (Bit 22)                                    */
#define GPIO_PINCFG165_NCEPOL165_Msk      (0x400000UL)              /*!< NCEPOL165 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG165_NCESRC165_Pos      (16UL)                    /*!< NCESRC165 (Bit 16)                                    */
#define GPIO_PINCFG165_NCESRC165_Msk      (0x3f0000UL)              /*!< NCESRC165 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG165_PULLCFG165_Pos     (13UL)                    /*!< PULLCFG165 (Bit 13)                                   */
#define GPIO_PINCFG165_PULLCFG165_Msk     (0xe000UL)                /*!< PULLCFG165 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG165_SR165_Pos          (12UL)                    /*!< SR165 (Bit 12)                                        */
#define GPIO_PINCFG165_SR165_Msk          (0x1000UL)                /*!< SR165 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG165_DS165_Pos          (10UL)                    /*!< DS165 (Bit 10)                                        */
#define GPIO_PINCFG165_DS165_Msk          (0xc00UL)                 /*!< DS165 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG165_OUTCFG165_Pos      (8UL)                     /*!< OUTCFG165 (Bit 8)                                     */
#define GPIO_PINCFG165_OUTCFG165_Msk      (0x300UL)                 /*!< OUTCFG165 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG165_IRPTEN165_Pos      (6UL)                     /*!< IRPTEN165 (Bit 6)                                     */
#define GPIO_PINCFG165_IRPTEN165_Msk      (0xc0UL)                  /*!< IRPTEN165 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG165_RDZERO165_Pos      (5UL)                     /*!< RDZERO165 (Bit 5)                                     */
#define GPIO_PINCFG165_RDZERO165_Msk      (0x20UL)                  /*!< RDZERO165 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG165_INPEN165_Pos       (4UL)                     /*!< INPEN165 (Bit 4)                                      */
#define GPIO_PINCFG165_INPEN165_Msk       (0x10UL)                  /*!< INPEN165 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG165_FNCSEL165_Pos      (0UL)                     /*!< FNCSEL165 (Bit 0)                                     */
#define GPIO_PINCFG165_FNCSEL165_Msk      (0xfUL)                   /*!< FNCSEL165 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG166  ======================================================= */
#define GPIO_PINCFG166_FOEN166_Pos        (27UL)                    /*!< FOEN166 (Bit 27)                                      */
#define GPIO_PINCFG166_FOEN166_Msk        (0x8000000UL)             /*!< FOEN166 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG166_FIEN166_Pos        (26UL)                    /*!< FIEN166 (Bit 26)                                      */
#define GPIO_PINCFG166_FIEN166_Msk        (0x4000000UL)             /*!< FIEN166 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG166_NCEPOL166_Pos      (22UL)                    /*!< NCEPOL166 (Bit 22)                                    */
#define GPIO_PINCFG166_NCEPOL166_Msk      (0x400000UL)              /*!< NCEPOL166 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG166_NCESRC166_Pos      (16UL)                    /*!< NCESRC166 (Bit 16)                                    */
#define GPIO_PINCFG166_NCESRC166_Msk      (0x3f0000UL)              /*!< NCESRC166 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG166_PULLCFG166_Pos     (13UL)                    /*!< PULLCFG166 (Bit 13)                                   */
#define GPIO_PINCFG166_PULLCFG166_Msk     (0xe000UL)                /*!< PULLCFG166 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG166_SR166_Pos          (12UL)                    /*!< SR166 (Bit 12)                                        */
#define GPIO_PINCFG166_SR166_Msk          (0x1000UL)                /*!< SR166 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG166_DS166_Pos          (10UL)                    /*!< DS166 (Bit 10)                                        */
#define GPIO_PINCFG166_DS166_Msk          (0xc00UL)                 /*!< DS166 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG166_OUTCFG166_Pos      (8UL)                     /*!< OUTCFG166 (Bit 8)                                     */
#define GPIO_PINCFG166_OUTCFG166_Msk      (0x300UL)                 /*!< OUTCFG166 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG166_IRPTEN166_Pos      (6UL)                     /*!< IRPTEN166 (Bit 6)                                     */
#define GPIO_PINCFG166_IRPTEN166_Msk      (0xc0UL)                  /*!< IRPTEN166 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG166_RDZERO166_Pos      (5UL)                     /*!< RDZERO166 (Bit 5)                                     */
#define GPIO_PINCFG166_RDZERO166_Msk      (0x20UL)                  /*!< RDZERO166 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG166_INPEN166_Pos       (4UL)                     /*!< INPEN166 (Bit 4)                                      */
#define GPIO_PINCFG166_INPEN166_Msk       (0x10UL)                  /*!< INPEN166 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG166_FNCSEL166_Pos      (0UL)                     /*!< FNCSEL166 (Bit 0)                                     */
#define GPIO_PINCFG166_FNCSEL166_Msk      (0xfUL)                   /*!< FNCSEL166 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG167  ======================================================= */
#define GPIO_PINCFG167_FOEN167_Pos        (27UL)                    /*!< FOEN167 (Bit 27)                                      */
#define GPIO_PINCFG167_FOEN167_Msk        (0x8000000UL)             /*!< FOEN167 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG167_FIEN167_Pos        (26UL)                    /*!< FIEN167 (Bit 26)                                      */
#define GPIO_PINCFG167_FIEN167_Msk        (0x4000000UL)             /*!< FIEN167 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG167_NCEPOL167_Pos      (22UL)                    /*!< NCEPOL167 (Bit 22)                                    */
#define GPIO_PINCFG167_NCEPOL167_Msk      (0x400000UL)              /*!< NCEPOL167 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG167_NCESRC167_Pos      (16UL)                    /*!< NCESRC167 (Bit 16)                                    */
#define GPIO_PINCFG167_NCESRC167_Msk      (0x3f0000UL)              /*!< NCESRC167 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG167_PULLCFG167_Pos     (13UL)                    /*!< PULLCFG167 (Bit 13)                                   */
#define GPIO_PINCFG167_PULLCFG167_Msk     (0xe000UL)                /*!< PULLCFG167 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG167_SR167_Pos          (12UL)                    /*!< SR167 (Bit 12)                                        */
#define GPIO_PINCFG167_SR167_Msk          (0x1000UL)                /*!< SR167 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG167_DS167_Pos          (10UL)                    /*!< DS167 (Bit 10)                                        */
#define GPIO_PINCFG167_DS167_Msk          (0xc00UL)                 /*!< DS167 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG167_OUTCFG167_Pos      (8UL)                     /*!< OUTCFG167 (Bit 8)                                     */
#define GPIO_PINCFG167_OUTCFG167_Msk      (0x300UL)                 /*!< OUTCFG167 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG167_IRPTEN167_Pos      (6UL)                     /*!< IRPTEN167 (Bit 6)                                     */
#define GPIO_PINCFG167_IRPTEN167_Msk      (0xc0UL)                  /*!< IRPTEN167 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG167_RDZERO167_Pos      (5UL)                     /*!< RDZERO167 (Bit 5)                                     */
#define GPIO_PINCFG167_RDZERO167_Msk      (0x20UL)                  /*!< RDZERO167 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG167_INPEN167_Pos       (4UL)                     /*!< INPEN167 (Bit 4)                                      */
#define GPIO_PINCFG167_INPEN167_Msk       (0x10UL)                  /*!< INPEN167 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG167_FNCSEL167_Pos      (0UL)                     /*!< FNCSEL167 (Bit 0)                                     */
#define GPIO_PINCFG167_FNCSEL167_Msk      (0xfUL)                   /*!< FNCSEL167 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG168  ======================================================= */
#define GPIO_PINCFG168_FOEN168_Pos        (27UL)                    /*!< FOEN168 (Bit 27)                                      */
#define GPIO_PINCFG168_FOEN168_Msk        (0x8000000UL)             /*!< FOEN168 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG168_FIEN168_Pos        (26UL)                    /*!< FIEN168 (Bit 26)                                      */
#define GPIO_PINCFG168_FIEN168_Msk        (0x4000000UL)             /*!< FIEN168 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG168_NCEPOL168_Pos      (22UL)                    /*!< NCEPOL168 (Bit 22)                                    */
#define GPIO_PINCFG168_NCEPOL168_Msk      (0x400000UL)              /*!< NCEPOL168 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG168_NCESRC168_Pos      (16UL)                    /*!< NCESRC168 (Bit 16)                                    */
#define GPIO_PINCFG168_NCESRC168_Msk      (0x3f0000UL)              /*!< NCESRC168 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG168_PULLCFG168_Pos     (13UL)                    /*!< PULLCFG168 (Bit 13)                                   */
#define GPIO_PINCFG168_PULLCFG168_Msk     (0xe000UL)                /*!< PULLCFG168 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG168_SR168_Pos          (12UL)                    /*!< SR168 (Bit 12)                                        */
#define GPIO_PINCFG168_SR168_Msk          (0x1000UL)                /*!< SR168 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG168_DS168_Pos          (10UL)                    /*!< DS168 (Bit 10)                                        */
#define GPIO_PINCFG168_DS168_Msk          (0xc00UL)                 /*!< DS168 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG168_OUTCFG168_Pos      (8UL)                     /*!< OUTCFG168 (Bit 8)                                     */
#define GPIO_PINCFG168_OUTCFG168_Msk      (0x300UL)                 /*!< OUTCFG168 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG168_IRPTEN168_Pos      (6UL)                     /*!< IRPTEN168 (Bit 6)                                     */
#define GPIO_PINCFG168_IRPTEN168_Msk      (0xc0UL)                  /*!< IRPTEN168 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG168_RDZERO168_Pos      (5UL)                     /*!< RDZERO168 (Bit 5)                                     */
#define GPIO_PINCFG168_RDZERO168_Msk      (0x20UL)                  /*!< RDZERO168 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG168_INPEN168_Pos       (4UL)                     /*!< INPEN168 (Bit 4)                                      */
#define GPIO_PINCFG168_INPEN168_Msk       (0x10UL)                  /*!< INPEN168 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG168_FNCSEL168_Pos      (0UL)                     /*!< FNCSEL168 (Bit 0)                                     */
#define GPIO_PINCFG168_FNCSEL168_Msk      (0xfUL)                   /*!< FNCSEL168 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG169  ======================================================= */
#define GPIO_PINCFG169_FOEN169_Pos        (27UL)                    /*!< FOEN169 (Bit 27)                                      */
#define GPIO_PINCFG169_FOEN169_Msk        (0x8000000UL)             /*!< FOEN169 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG169_FIEN169_Pos        (26UL)                    /*!< FIEN169 (Bit 26)                                      */
#define GPIO_PINCFG169_FIEN169_Msk        (0x4000000UL)             /*!< FIEN169 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG169_NCEPOL169_Pos      (22UL)                    /*!< NCEPOL169 (Bit 22)                                    */
#define GPIO_PINCFG169_NCEPOL169_Msk      (0x400000UL)              /*!< NCEPOL169 (Bitfield-Mask: 0x01)                       */
