AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
#define GPIO_PINCFG191_PULLCFG191_Pos     (13UL)                    /*!< PULLCFG191 (Bit 13)                                   */
#define GPIO_PINCFG191_PULLCFG191_Msk     (0xe000UL)                /*!< PULLCFG191 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG191_SR191_Pos          (12UL)                    /*!< SR191 (Bit 12)                                        */
#define GPIO_PINCFG191_SR191_Msk          (0x1000UL)                /*!< SR191 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG191_DS191_Pos          (10UL)                    /*!< DS191 (Bit 10)                                        */
#define GPIO_PINCFG191_DS191_Msk          (0xc00UL)                 /*!< DS191 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG191_OUTCFG191_Pos      (8UL)                     /*!< OUTCFG191 (Bit 8)                                     */
#define GPIO_PINCFG191_OUTCFG191_Msk      (0x300UL)                 /*!< OUTCFG191 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG191_IRPTEN191_Pos      (6UL)                     /*!< IRPTEN191 (Bit 6)                                     */
#define GPIO_PINCFG191_IRPTEN191_Msk      (0xc0UL)                  /*!< IRPTEN191 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG191_RDZERO191_Pos      (5UL)                     /*!< RDZERO191 (Bit 5)                                     */
#define GPIO_PINCFG191_RDZERO191_Msk      (0x20UL)                  /*!< RDZERO191 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG191_INPEN191_Pos       (4UL)                     /*!< INPEN191 (Bit 4)                                      */
#define GPIO_PINCFG191_INPEN191_Msk       (0x10UL)                  /*!< INPEN191 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG191_FNCSEL191_Pos      (0UL)                     /*!< FNCSEL191 (Bit 0)                                     */
#define GPIO_PINCFG191_FNCSEL191_Msk      (0xfUL)                   /*!< FNCSEL191 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG192  ======================================================= */
#define GPIO_PINCFG192_FOEN192_Pos        (27UL)                    /*!< FOEN192 (Bit 27)                                      */
#define GPIO_PINCFG192_FOEN192_Msk        (0x8000000UL)             /*!< FOEN192 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG192_FIEN192_Pos        (26UL)                    /*!< FIEN192 (Bit 26)                                      */
#define GPIO_PINCFG192_FIEN192_Msk        (0x4000000UL)             /*!< FIEN192 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG192_NCEPOL192_Pos      (22UL)                    /*!< NCEPOL192 (Bit 22)                                    */
#define GPIO_PINCFG192_NCEPOL192_Msk      (0x400000UL)              /*!< NCEPOL192 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG192_NCESRC192_Pos      (16UL)                    /*!< NCESRC192 (Bit 16)                                    */
#define GPIO_PINCFG192_NCESRC192_Msk      (0x3f0000UL)              /*!< NCESRC192 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG192_PULLCFG192_Pos     (13UL)                    /*!< PULLCFG192 (Bit 13)                                   */
#define GPIO_PINCFG192_PULLCFG192_Msk     (0xe000UL)                /*!< PULLCFG192 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG192_SR192_Pos          (12UL)                    /*!< SR192 (Bit 12)                                        */
#define GPIO_PINCFG192_SR192_Msk          (0x1000UL)                /*!< SR192 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG192_DS192_Pos          (10UL)                    /*!< DS192 (Bit 10)                                        */
#define GPIO_PINCFG192_DS192_Msk          (0xc00UL)                 /*!< DS192 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG192_OUTCFG192_Pos      (8UL)                     /*!< OUTCFG192 (Bit 8)                                     */
#define GPIO_PINCFG192_OUTCFG192_Msk      (0x300UL)                 /*!< OUTCFG192 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG192_IRPTEN192_Pos      (6UL)                     /*!< IRPTEN192 (Bit 6)                                     */
#define GPIO_PINCFG192_IRPTEN192_Msk      (0xc0UL)                  /*!< IRPTEN192 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG192_RDZERO192_Pos      (5UL)                     /*!< RDZERO192 (Bit 5)                                     */
#define GPIO_PINCFG192_RDZERO192_Msk      (0x20UL)                  /*!< RDZERO192 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG192_INPEN192_Pos       (4UL)                     /*!< INPEN192 (Bit 4)                                      */
#define GPIO_PINCFG192_INPEN192_Msk       (0x10UL)                  /*!< INPEN192 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG192_FNCSEL192_Pos      (0UL)                     /*!< FNCSEL192 (Bit 0)                                     */
#define GPIO_PINCFG192_FNCSEL192_Msk      (0xfUL)                   /*!< FNCSEL192 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG193  ======================================================= */
#define GPIO_PINCFG193_FOEN193_Pos        (27UL)                    /*!< FOEN193 (Bit 27)                                      */
#define GPIO_PINCFG193_FOEN193_Msk        (0x8000000UL)             /*!< FOEN193 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG193_FIEN193_Pos        (26UL)                    /*!< FIEN193 (Bit 26)                                      */
#define GPIO_PINCFG193_FIEN193_Msk        (0x4000000UL)             /*!< FIEN193 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG193_NCEPOL193_Pos      (22UL)                    /*!< NCEPOL193 (Bit 22)                                    */
#define GPIO_PINCFG193_NCEPOL193_Msk      (0x400000UL)              /*!< NCEPOL193 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG193_NCESRC193_Pos      (16UL)                    /*!< NCESRC193 (Bit 16)                                    */
#define GPIO_PINCFG193_NCESRC193_Msk      (0x3f0000UL)              /*!< NCESRC193 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG193_PULLCFG193_Pos     (13UL)                    /*!< PULLCFG193 (Bit 13)                                   */
#define GPIO_PINCFG193_PULLCFG193_Msk     (0xe000UL)                /*!< PULLCFG193 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG193_SR193_Pos          (12UL)                    /*!< SR193 (Bit 12)                                        */
#define GPIO_PINCFG193_SR193_Msk          (0x1000UL)                /*!< SR193 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG193_DS193_Pos          (10UL)                    /*!< DS193 (Bit 10)                                        */
#define GPIO_PINCFG193_DS193_Msk          (0xc00UL)                 /*!< DS193 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG193_OUTCFG193_Pos      (8UL)                     /*!< OUTCFG193 (Bit 8)                                     */
#define GPIO_PINCFG193_OUTCFG193_Msk      (0x300UL)                 /*!< OUTCFG193 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG193_IRPTEN193_Pos      (6UL)                     /*!< IRPTEN193 (Bit 6)                                     */
#define GPIO_PINCFG193_IRPTEN193_Msk      (0xc0UL)                  /*!< IRPTEN193 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG193_RDZERO193_Pos      (5UL)                     /*!< RDZERO193 (Bit 5)                                     */
#define GPIO_PINCFG193_RDZERO193_Msk      (0x20UL)                  /*!< RDZERO193 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG193_INPEN193_Pos       (4UL)                     /*!< INPEN193 (Bit 4)                                      */
#define GPIO_PINCFG193_INPEN193_Msk       (0x10UL)                  /*!< INPEN193 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG193_FNCSEL193_Pos      (0UL)                     /*!< FNCSEL193 (Bit 0)                                     */
#define GPIO_PINCFG193_FNCSEL193_Msk      (0xfUL)                   /*!< FNCSEL193 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG194  ======================================================= */
#define GPIO_PINCFG194_FOEN194_Pos        (27UL)                    /*!< FOEN194 (Bit 27)                                      */
#define GPIO_PINCFG194_FOEN194_Msk        (0x8000000UL)             /*!< FOEN194 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG194_FIEN194_Pos        (26UL)                    /*!< FIEN194 (Bit 26)                                      */
#define GPIO_PINCFG194_FIEN194_Msk        (0x4000000UL)             /*!< FIEN194 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG194_NCEPOL194_Pos      (22UL)                    /*!< NCEPOL194 (Bit 22)                                    */
#define GPIO_PINCFG194_NCEPOL194_Msk      (0x400000UL)              /*!< NCEPOL194 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG194_NCESRC194_Pos      (16UL)                    /*!< NCESRC194 (Bit 16)                                    */
#define GPIO_PINCFG194_NCESRC194_Msk      (0x3f0000UL)              /*!< NCESRC194 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG194_PULLCFG194_Pos     (13UL)                    /*!< PULLCFG194 (Bit 13)                                   */
#define GPIO_PINCFG194_PULLCFG194_Msk     (0xe000UL)                /*!< PULLCFG194 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG194_SR194_Pos          (12UL)                    /*!< SR194 (Bit 12)                                        */
#define GPIO_PINCFG194_SR194_Msk          (0x1000UL)                /*!< SR194 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG194_DS194_Pos          (10UL)                    /*!< DS194 (Bit 10)                                        */
#define GPIO_PINCFG194_DS194_Msk          (0xc00UL)                 /*!< DS194 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG194_OUTCFG194_Pos      (8UL)                     /*!< OUTCFG194 (Bit 8)                                     */
#define GPIO_PINCFG194_OUTCFG194_Msk      (0x300UL)                 /*!< OUTCFG194 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG194_IRPTEN194_Pos      (6UL)                     /*!< IRPTEN194 (Bit 6)                                     */
#define GPIO_PINCFG194_IRPTEN194_Msk      (0xc0UL)                  /*!< IRPTEN194 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG194_RDZERO194_Pos      (5UL)                     /*!< RDZERO194 (Bit 5)                                     */
#define GPIO_PINCFG194_RDZERO194_Msk      (0x20UL)                  /*!< RDZERO194 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG194_INPEN194_Pos       (4UL)                     /*!< INPEN194 (Bit 4)                                      */
#define GPIO_PINCFG194_INPEN194_Msk       (0x10UL)                  /*!< INPEN194 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG194_FNCSEL194_Pos      (0UL)                     /*!< FNCSEL194 (Bit 0)                                     */
#define GPIO_PINCFG194_FNCSEL194_Msk      (0xfUL)                   /*!< FNCSEL194 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG195  ======================================================= */
#define GPIO_PINCFG195_FOEN195_Pos        (27UL)                    /*!< FOEN195 (Bit 27)                                      */
#define GPIO_PINCFG195_FOEN195_Msk        (0x8000000UL)             /*!< FOEN195 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG195_FIEN195_Pos        (26UL)                    /*!< FIEN195 (Bit 26)                                      */
#define GPIO_PINCFG195_FIEN195_Msk        (0x4000000UL)             /*!< FIEN195 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG195_NCEPOL195_Pos      (22UL)                    /*!< NCEPOL195 (Bit 22)                                    */
#define GPIO_PINCFG195_NCEPOL195_Msk      (0x400000UL)              /*!< NCEPOL195 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG195_NCESRC195_Pos      (16UL)                    /*!< NCESRC195 (Bit 16)                                    */
#define GPIO_PINCFG195_NCESRC195_Msk      (0x3f0000UL)              /*!< NCESRC195 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG195_PULLCFG195_Pos     (13UL)                    /*!< PULLCFG195 (Bit 13)                                   */
#define GPIO_PINCFG195_PULLCFG195_Msk     (0xe000UL)                /*!< PULLCFG195 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG195_SR195_Pos          (12UL)                    /*!< SR195 (Bit 12)                                        */
#define GPIO_PINCFG195_SR195_Msk          (0x1000UL)                /*!< SR195 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG195_DS195_Pos          (10UL)                    /*!< DS195 (Bit 10)                                        */
#define GPIO_PINCFG195_DS195_Msk          (0xc00UL)                 /*!< DS195 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG195_OUTCFG195_Pos      (8UL)                     /*!< OUTCFG195 (Bit 8)                                     */
#define GPIO_PINCFG195_OUTCFG195_Msk      (0x300UL)                 /*!< OUTCFG195 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG195_IRPTEN195_Pos      (6UL)                     /*!< IRPTEN195 (Bit 6)                                     */
#define GPIO_PINCFG195_IRPTEN195_Msk      (0xc0UL)                  /*!< IRPTEN195 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG195_RDZERO195_Pos      (5UL)                     /*!< RDZERO195 (Bit 5)                                     */
#define GPIO_PINCFG195_RDZERO195_Msk      (0x20UL)                  /*!< RDZERO195 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG195_INPEN195_Pos       (4UL)                     /*!< INPEN195 (Bit 4)                                      */
#define GPIO_PINCFG195_INPEN195_Msk       (0x10UL)                  /*!< INPEN195 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG195_FNCSEL195_Pos      (0UL)                     /*!< FNCSEL195 (Bit 0)                                     */
#define GPIO_PINCFG195_FNCSEL195_Msk      (0xfUL)                   /*!< FNCSEL195 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG196  ======================================================= */
#define GPIO_PINCFG196_FOEN196_Pos        (27UL)                    /*!< FOEN196 (Bit 27)                                      */
#define GPIO_PINCFG196_FOEN196_Msk        (0x8000000UL)             /*!< FOEN196 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG196_FIEN196_Pos        (26UL)                    /*!< FIEN196 (Bit 26)                                      */
#define GPIO_PINCFG196_FIEN196_Msk        (0x4000000UL)             /*!< FIEN196 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG196_NCEPOL196_Pos      (22UL)                    /*!< NCEPOL196 (Bit 22)                                    */
#define GPIO_PINCFG196_NCEPOL196_Msk      (0x400000UL)              /*!< NCEPOL196 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG196_NCESRC196_Pos      (16UL)                    /*!< NCESRC196 (Bit 16)                                    */
#define GPIO_PINCFG196_NCESRC196_Msk      (0x3f0000UL)              /*!< NCESRC196 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG196_PULLCFG196_Pos     (13UL)                    /*!< PULLCFG196 (Bit 13)                                   */
#define GPIO_PINCFG196_PULLCFG196_Msk     (0xe000UL)                /*!< PULLCFG196 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG196_SR196_Pos          (12UL)                    /*!< SR196 (Bit 12)                                        */
#define GPIO_PINCFG196_SR196_Msk          (0x1000UL)                /*!< SR196 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG196_DS196_Pos          (10UL)                    /*!< DS196 (Bit 10)                                        */
#define GPIO_PINCFG196_DS196_Msk          (0xc00UL)                 /*!< DS196 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG196_OUTCFG196_Pos      (8UL)                     /*!< OUTCFG196 (Bit 8)                                     */
#define GPIO_PINCFG196_OUTCFG196_Msk      (0x300UL)                 /*!< OUTCFG196 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG196_IRPTEN196_Pos      (6UL)                     /*!< IRPTEN196 (Bit 6)                                     */
#define GPIO_PINCFG196_IRPTEN196_Msk      (0xc0UL)                  /*!< IRPTEN196 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG196_RDZERO196_Pos      (5UL)                     /*!< RDZERO196 (Bit 5)                                     */
#define GPIO_PINCFG196_RDZERO196_Msk      (0x20UL)                  /*!< RDZERO196 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG196_INPEN196_Pos       (4UL)                     /*!< INPEN196 (Bit 4)                                      */
#define GPIO_PINCFG196_INPEN196_Msk       (0x10UL)                  /*!< INPEN196 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG196_FNCSEL196_Pos      (0UL)                     /*!< FNCSEL196 (Bit 0)                                     */
#define GPIO_PINCFG196_FNCSEL196_Msk      (0xfUL)                   /*!< FNCSEL196 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG197  ======================================================= */
#define GPIO_PINCFG197_FOEN197_Pos        (27UL)                    /*!< FOEN197 (Bit 27)                                      */
#define GPIO_PINCFG197_FOEN197_Msk        (0x8000000UL)             /*!< FOEN197 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG197_FIEN197_Pos        (26UL)                    /*!< FIEN197 (Bit 26)                                      */
#define GPIO_PINCFG197_FIEN197_Msk        (0x4000000UL)             /*!< FIEN197 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG197_NCEPOL197_Pos      (22UL)                    /*!< NCEPOL197 (Bit 22)                                    */
#define GPIO_PINCFG197_NCEPOL197_Msk      (0x400000UL)              /*!< NCEPOL197 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG197_NCESRC197_Pos      (16UL)                    /*!< NCESRC197 (Bit 16)                                    */
#define GPIO_PINCFG197_NCESRC197_Msk      (0x3f0000UL)              /*!< NCESRC197 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG197_PULLCFG197_Pos     (13UL)                    /*!< PULLCFG197 (Bit 13)                                   */
#define GPIO_PINCFG197_PULLCFG197_Msk     (0xe000UL)                /*!< PULLCFG197 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG197_SR197_Pos          (12UL)                    /*!< SR197 (Bit 12)                                        */
#define GPIO_PINCFG197_SR197_Msk          (0x1000UL)                /*!< SR197 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG197_DS197_Pos          (10UL)                    /*!< DS197 (Bit 10)                                        */
#define GPIO_PINCFG197_DS197_Msk          (0xc00UL)                 /*!< DS197 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG197_OUTCFG197_Pos      (8UL)                     /*!< OUTCFG197 (Bit 8)                                     */
#define GPIO_PINCFG197_OUTCFG197_Msk      (0x300UL)                 /*!< OUTCFG197 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG197_IRPTEN197_Pos      (6UL)                     /*!< IRPTEN197 (Bit 6)                                     */
#define GPIO_PINCFG197_IRPTEN197_Msk      (0xc0UL)                  /*!< IRPTEN197 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG197_RDZERO197_Pos      (5UL)                     /*!< RDZERO197 (Bit 5)                                     */
#define GPIO_PINCFG197_RDZERO197_Msk      (0x20UL)                  /*!< RDZERO197 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG197_INPEN197_Pos       (4UL)                     /*!< INPEN197 (Bit 4)                                      */
#define GPIO_PINCFG197_INPEN197_Msk       (0x10UL)                  /*!< INPEN197 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG197_FNCSEL197_Pos      (0UL)                     /*!< FNCSEL197 (Bit 0)                                     */
#define GPIO_PINCFG197_FNCSEL197_Msk      (0xfUL)                   /*!< FNCSEL197 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG198  ======================================================= */
#define GPIO_PINCFG198_FOEN198_Pos        (27UL)                    /*!< FOEN198 (Bit 27)                                      */
#define GPIO_PINCFG198_FOEN198_Msk        (0x8000000UL)             /*!< FOEN198 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG198_FIEN198_Pos        (26UL)                    /*!< FIEN198 (Bit 26)                                      */
#define GPIO_PINCFG198_FIEN198_Msk        (0x4000000UL)             /*!< FIEN198 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG198_NCEPOL198_Pos      (22UL)                    /*!< NCEPOL198 (Bit 22)                                    */
#define GPIO_PINCFG198_NCEPOL198_Msk      (0x400000UL)              /*!< NCEPOL198 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG198_NCESRC198_Pos      (16UL)                    /*!< NCESRC198 (Bit 16)                                    */
#define GPIO_PINCFG198_NCESRC198_Msk      (0x3f0000UL)              /*!< NCESRC198 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG198_PULLCFG198_Pos     (13UL)                    /*!< PULLCFG198 (Bit 13)                                   */
#define GPIO_PINCFG198_PULLCFG198_Msk     (0xe000UL)                /*!< PULLCFG198 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG198_SR198_Pos          (12UL)                    /*!< SR198 (Bit 12)                                        */
#define GPIO_PINCFG198_SR198_Msk          (0x1000UL)                /*!< SR198 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG198_DS198_Pos          (10UL)                    /*!< DS198 (Bit 10)                                        */
#define GPIO_PINCFG198_DS198_Msk          (0xc00UL)                 /*!< DS198 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG198_OUTCFG198_Pos      (8UL)                     /*!< OUTCFG198 (Bit 8)                                     */
#define GPIO_PINCFG198_OUTCFG198_Msk      (0x300UL)                 /*!< OUTCFG198 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG198_IRPTEN198_Pos      (6UL)                     /*!< IRPTEN198 (Bit 6)                                     */
