AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
#define GPIO_PINCFG220_RDZERO220_Msk      (0x20UL)                  /*!< RDZERO220 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG220_INPEN220_Pos       (4UL)                     /*!< INPEN220 (Bit 4)                                      */
#define GPIO_PINCFG220_INPEN220_Msk       (0x10UL)                  /*!< INPEN220 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG220_FNCSEL220_Pos      (0UL)                     /*!< FNCSEL220 (Bit 0)                                     */
#define GPIO_PINCFG220_FNCSEL220_Msk      (0xfUL)                   /*!< FNCSEL220 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG221  ======================================================= */
#define GPIO_PINCFG221_FOEN221_Pos        (27UL)                    /*!< FOEN221 (Bit 27)                                      */
#define GPIO_PINCFG221_FOEN221_Msk        (0x8000000UL)             /*!< FOEN221 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG221_FIEN221_Pos        (26UL)                    /*!< FIEN221 (Bit 26)                                      */
#define GPIO_PINCFG221_FIEN221_Msk        (0x4000000UL)             /*!< FIEN221 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG221_NCEPOL221_Pos      (22UL)                    /*!< NCEPOL221 (Bit 22)                                    */
#define GPIO_PINCFG221_NCEPOL221_Msk      (0x400000UL)              /*!< NCEPOL221 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG221_NCESRC221_Pos      (16UL)                    /*!< NCESRC221 (Bit 16)                                    */
#define GPIO_PINCFG221_NCESRC221_Msk      (0x3f0000UL)              /*!< NCESRC221 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG221_PULLCFG221_Pos     (13UL)                    /*!< PULLCFG221 (Bit 13)                                   */
#define GPIO_PINCFG221_PULLCFG221_Msk     (0xe000UL)                /*!< PULLCFG221 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG221_SR221_Pos          (12UL)                    /*!< SR221 (Bit 12)                                        */
#define GPIO_PINCFG221_SR221_Msk          (0x1000UL)                /*!< SR221 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG221_DS221_Pos          (10UL)                    /*!< DS221 (Bit 10)                                        */
#define GPIO_PINCFG221_DS221_Msk          (0xc00UL)                 /*!< DS221 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG221_OUTCFG221_Pos      (8UL)                     /*!< OUTCFG221 (Bit 8)                                     */
#define GPIO_PINCFG221_OUTCFG221_Msk      (0x300UL)                 /*!< OUTCFG221 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG221_IRPTEN221_Pos      (6UL)                     /*!< IRPTEN221 (Bit 6)                                     */
#define GPIO_PINCFG221_IRPTEN221_Msk      (0xc0UL)                  /*!< IRPTEN221 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG221_RDZERO221_Pos      (5UL)                     /*!< RDZERO221 (Bit 5)                                     */
#define GPIO_PINCFG221_RDZERO221_Msk      (0x20UL)                  /*!< RDZERO221 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG221_INPEN221_Pos       (4UL)                     /*!< INPEN221 (Bit 4)                                      */
#define GPIO_PINCFG221_INPEN221_Msk       (0x10UL)                  /*!< INPEN221 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG221_FNCSEL221_Pos      (0UL)                     /*!< FNCSEL221 (Bit 0)                                     */
#define GPIO_PINCFG221_FNCSEL221_Msk      (0xfUL)                   /*!< FNCSEL221 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG222  ======================================================= */
#define GPIO_PINCFG222_FOEN222_Pos        (27UL)                    /*!< FOEN222 (Bit 27)                                      */
#define GPIO_PINCFG222_FOEN222_Msk        (0x8000000UL)             /*!< FOEN222 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG222_FIEN222_Pos        (26UL)                    /*!< FIEN222 (Bit 26)                                      */
#define GPIO_PINCFG222_FIEN222_Msk        (0x4000000UL)             /*!< FIEN222 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG222_NCEPOL222_Pos      (22UL)                    /*!< NCEPOL222 (Bit 22)                                    */
#define GPIO_PINCFG222_NCEPOL222_Msk      (0x400000UL)              /*!< NCEPOL222 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG222_NCESRC222_Pos      (16UL)                    /*!< NCESRC222 (Bit 16)                                    */
#define GPIO_PINCFG222_NCESRC222_Msk      (0x3f0000UL)              /*!< NCESRC222 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG222_PULLCFG222_Pos     (13UL)                    /*!< PULLCFG222 (Bit 13)                                   */
#define GPIO_PINCFG222_PULLCFG222_Msk     (0xe000UL)                /*!< PULLCFG222 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG222_SR222_Pos          (12UL)                    /*!< SR222 (Bit 12)                                        */
#define GPIO_PINCFG222_SR222_Msk          (0x1000UL)                /*!< SR222 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG222_DS222_Pos          (10UL)                    /*!< DS222 (Bit 10)                                        */
#define GPIO_PINCFG222_DS222_Msk          (0xc00UL)                 /*!< DS222 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG222_OUTCFG222_Pos      (8UL)                     /*!< OUTCFG222 (Bit 8)                                     */
#define GPIO_PINCFG222_OUTCFG222_Msk      (0x300UL)                 /*!< OUTCFG222 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG222_IRPTEN222_Pos      (6UL)                     /*!< IRPTEN222 (Bit 6)                                     */
#define GPIO_PINCFG222_IRPTEN222_Msk      (0xc0UL)                  /*!< IRPTEN222 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG222_RDZERO222_Pos      (5UL)                     /*!< RDZERO222 (Bit 5)                                     */
#define GPIO_PINCFG222_RDZERO222_Msk      (0x20UL)                  /*!< RDZERO222 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG222_INPEN222_Pos       (4UL)                     /*!< INPEN222 (Bit 4)                                      */
#define GPIO_PINCFG222_INPEN222_Msk       (0x10UL)                  /*!< INPEN222 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG222_FNCSEL222_Pos      (0UL)                     /*!< FNCSEL222 (Bit 0)                                     */
#define GPIO_PINCFG222_FNCSEL222_Msk      (0xfUL)                   /*!< FNCSEL222 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG223  ======================================================= */
#define GPIO_PINCFG223_FOEN223_Pos        (27UL)                    /*!< FOEN223 (Bit 27)                                      */
#define GPIO_PINCFG223_FOEN223_Msk        (0x8000000UL)             /*!< FOEN223 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG223_FIEN223_Pos        (26UL)                    /*!< FIEN223 (Bit 26)                                      */
#define GPIO_PINCFG223_FIEN223_Msk        (0x4000000UL)             /*!< FIEN223 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG223_NCEPOL223_Pos      (22UL)                    /*!< NCEPOL223 (Bit 22)                                    */
#define GPIO_PINCFG223_NCEPOL223_Msk      (0x400000UL)              /*!< NCEPOL223 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG223_NCESRC223_Pos      (16UL)                    /*!< NCESRC223 (Bit 16)                                    */
#define GPIO_PINCFG223_NCESRC223_Msk      (0x3f0000UL)              /*!< NCESRC223 (Bitfield-Mask: 0x3f)                       */
#define GPIO_PINCFG223_PULLCFG223_Pos     (13UL)                    /*!< PULLCFG223 (Bit 13)                                   */
#define GPIO_PINCFG223_PULLCFG223_Msk     (0xe000UL)                /*!< PULLCFG223 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG223_SR223_Pos          (12UL)                    /*!< SR223 (Bit 12)                                        */
#define GPIO_PINCFG223_SR223_Msk          (0x1000UL)                /*!< SR223 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG223_DS223_Pos          (10UL)                    /*!< DS223 (Bit 10)                                        */
#define GPIO_PINCFG223_DS223_Msk          (0xc00UL)                 /*!< DS223 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG223_OUTCFG223_Pos      (8UL)                     /*!< OUTCFG223 (Bit 8)                                     */
#define GPIO_PINCFG223_OUTCFG223_Msk      (0x300UL)                 /*!< OUTCFG223 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG223_IRPTEN223_Pos      (6UL)                     /*!< IRPTEN223 (Bit 6)                                     */
#define GPIO_PINCFG223_IRPTEN223_Msk      (0xc0UL)                  /*!< IRPTEN223 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG223_RDZERO223_Pos      (5UL)                     /*!< RDZERO223 (Bit 5)                                     */
#define GPIO_PINCFG223_RDZERO223_Msk      (0x20UL)                  /*!< RDZERO223 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG223_INPEN223_Pos       (4UL)                     /*!< INPEN223 (Bit 4)                                      */
#define GPIO_PINCFG223_INPEN223_Msk       (0x10UL)                  /*!< INPEN223 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG223_FNCSEL223_Pos      (0UL)                     /*!< FNCSEL223 (Bit 0)                                     */
#define GPIO_PINCFG223_FNCSEL223_Msk      (0xfUL)                   /*!< FNCSEL223 (Bitfield-Mask: 0x0f)                       */
/* ========================================================  PADKEY  ========================================================= */
#define GPIO_PADKEY_PADKEY_Pos            (0UL)                     /*!< PADKEY (Bit 0)                                        */
#define GPIO_PADKEY_PADKEY_Msk            (0xffffffffUL)            /*!< PADKEY (Bitfield-Mask: 0xffffffff)                    */
/* ==========================================================  RD0  ========================================================== */
#define GPIO_RD0_RD0_Pos                  (0UL)                     /*!< RD0 (Bit 0)                                           */
#define GPIO_RD0_RD0_Msk                  (0xffffffffUL)            /*!< RD0 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD1  ========================================================== */
#define GPIO_RD1_RD1_Pos                  (0UL)                     /*!< RD1 (Bit 0)                                           */
#define GPIO_RD1_RD1_Msk                  (0xffffffffUL)            /*!< RD1 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD2  ========================================================== */
#define GPIO_RD2_RD2_Pos                  (0UL)                     /*!< RD2 (Bit 0)                                           */
#define GPIO_RD2_RD2_Msk                  (0xffffffffUL)            /*!< RD2 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD3  ========================================================== */
#define GPIO_RD3_RD3_Pos                  (0UL)                     /*!< RD3 (Bit 0)                                           */
#define GPIO_RD3_RD3_Msk                  (0xffffffffUL)            /*!< RD3 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD4  ========================================================== */
#define GPIO_RD4_RD4_Pos                  (0UL)                     /*!< RD4 (Bit 0)                                           */
#define GPIO_RD4_RD4_Msk                  (0xffffffffUL)            /*!< RD4 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD5  ========================================================== */
#define GPIO_RD5_RD5_Pos                  (0UL)                     /*!< RD5 (Bit 0)                                           */
#define GPIO_RD5_RD5_Msk                  (0xffffffffUL)            /*!< RD5 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD6  ========================================================== */
#define GPIO_RD6_RD6_Pos                  (0UL)                     /*!< RD6 (Bit 0)                                           */
#define GPIO_RD6_RD6_Msk                  (0xffffffffUL)            /*!< RD6 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT0  ========================================================== */
#define GPIO_WT0_WT0_Pos                  (0UL)                     /*!< WT0 (Bit 0)                                           */
#define GPIO_WT0_WT0_Msk                  (0xffffffffUL)            /*!< WT0 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT1  ========================================================== */
#define GPIO_WT1_WT1_Pos                  (0UL)                     /*!< WT1 (Bit 0)                                           */
#define GPIO_WT1_WT1_Msk                  (0xffffffffUL)            /*!< WT1 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT2  ========================================================== */
#define GPIO_WT2_WT2_Pos                  (0UL)                     /*!< WT2 (Bit 0)                                           */
#define GPIO_WT2_WT2_Msk                  (0xffffffffUL)            /*!< WT2 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT3  ========================================================== */
#define GPIO_WT3_WT3_Pos                  (0UL)                     /*!< WT3 (Bit 0)                                           */
#define GPIO_WT3_WT3_Msk                  (0xffffffffUL)            /*!< WT3 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT4  ========================================================== */
#define GPIO_WT4_WT4_Pos                  (0UL)                     /*!< WT4 (Bit 0)                                           */
#define GPIO_WT4_WT4_Msk                  (0xffffffffUL)            /*!< WT4 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT5  ========================================================== */
#define GPIO_WT5_WT5_Pos                  (0UL)                     /*!< WT5 (Bit 0)                                           */
#define GPIO_WT5_WT5_Msk                  (0xffffffffUL)            /*!< WT5 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT6  ========================================================== */
#define GPIO_WT6_WT6_Pos                  (0UL)                     /*!< WT6 (Bit 0)                                           */
#define GPIO_WT6_WT6_Msk                  (0xffffffffUL)            /*!< WT6 (Bitfield-Mask: 0xffffffff)                       */
/* =========================================================  WTS0  ========================================================== */
#define GPIO_WTS0_WTS0_Pos                (0UL)                     /*!< WTS0 (Bit 0)                                          */
#define GPIO_WTS0_WTS0_Msk                (0xffffffffUL)            /*!< WTS0 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS1  ========================================================== */
#define GPIO_WTS1_WTS1_Pos                (0UL)                     /*!< WTS1 (Bit 0)                                          */
#define GPIO_WTS1_WTS1_Msk                (0xffffffffUL)            /*!< WTS1 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS2  ========================================================== */
#define GPIO_WTS2_WTS2_Pos                (0UL)                     /*!< WTS2 (Bit 0)                                          */
#define GPIO_WTS2_WTS2_Msk                (0xffffffffUL)            /*!< WTS2 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS3  ========================================================== */
#define GPIO_WTS3_WTS3_Pos                (0UL)                     /*!< WTS3 (Bit 0)                                          */
#define GPIO_WTS3_WTS3_Msk                (0xffffffffUL)            /*!< WTS3 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS4  ========================================================== */
#define GPIO_WTS4_WTS4_Pos                (0UL)                     /*!< WTS4 (Bit 0)                                          */
#define GPIO_WTS4_WTS4_Msk                (0xffffffffUL)            /*!< WTS4 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS5  ========================================================== */
#define GPIO_WTS5_WTS5_Pos                (0UL)                     /*!< WTS5 (Bit 0)                                          */
#define GPIO_WTS5_WTS5_Msk                (0xffffffffUL)            /*!< WTS5 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS6  ========================================================== */
#define GPIO_WTS6_WTS6_Pos                (0UL)                     /*!< WTS6 (Bit 0)                                          */
#define GPIO_WTS6_WTS6_Msk                (0xffffffffUL)            /*!< WTS6 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC0  ========================================================== */
#define GPIO_WTC0_WTC0_Pos                (0UL)                     /*!< WTC0 (Bit 0)                                          */
#define GPIO_WTC0_WTC0_Msk                (0xffffffffUL)            /*!< WTC0 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC1  ========================================================== */
#define GPIO_WTC1_WTC1_Pos                (0UL)                     /*!< WTC1 (Bit 0)                                          */
#define GPIO_WTC1_WTC1_Msk                (0xffffffffUL)            /*!< WTC1 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC2  ========================================================== */
#define GPIO_WTC2_WTC2_Pos                (0UL)                     /*!< WTC2 (Bit 0)                                          */
#define GPIO_WTC2_WTC2_Msk                (0xffffffffUL)            /*!< WTC2 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC3  ========================================================== */
#define GPIO_WTC3_WTC3_Pos                (0UL)                     /*!< WTC3 (Bit 0)                                          */
#define GPIO_WTC3_WTC3_Msk                (0xffffffffUL)            /*!< WTC3 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC4  ========================================================== */
#define GPIO_WTC4_WTC4_Pos                (0UL)                     /*!< WTC4 (Bit 0)                                          */
#define GPIO_WTC4_WTC4_Msk                (0xffffffffUL)            /*!< WTC4 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC5  ========================================================== */
#define GPIO_WTC5_WTC5_Pos                (0UL)                     /*!< WTC5 (Bit 0)                                          */
#define GPIO_WTC5_WTC5_Msk                (0xffffffffUL)            /*!< WTC5 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC6  ========================================================== */
#define GPIO_WTC6_WTC6_Pos                (0UL)                     /*!< WTC6 (Bit 0)                                          */
#define GPIO_WTC6_WTC6_Msk                (0xffffffffUL)            /*!< WTC6 (Bitfield-Mask: 0xffffffff)                      */
/* ==========================================================  EN0  ========================================================== */
#define GPIO_EN0_EN0_Pos                  (0UL)                     /*!< EN0 (Bit 0)                                           */
#define GPIO_EN0_EN0_Msk                  (0xffffffffUL)            /*!< EN0 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  EN1  ========================================================== */
#define GPIO_EN1_EN1_Pos                  (0UL)                     /*!< EN1 (Bit 0)                                           */
#define GPIO_EN1_EN1_Msk                  (0xffffffffUL)            /*!< EN1 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  EN2  ========================================================== */
#define GPIO_EN2_EN2_Pos                  (0UL)                     /*!< EN2 (Bit 0)                                           */
#define GPIO_EN2_EN2_Msk                  (0xffffffffUL)            /*!< EN2 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  EN3  ========================================================== */
#define GPIO_EN3_EN3_Pos                  (0UL)                     /*!< EN3 (Bit 0)                                           */
#define GPIO_EN3_EN3_Msk                  (0xffffffffUL)            /*!< EN3 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  EN4  ========================================================== */
#define GPIO_EN4_EN4_Pos                  (0UL)                     /*!< EN4 (Bit 0)                                           */
#define GPIO_EN4_EN4_Msk                  (0xffffffffUL)            /*!< EN4 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  EN5  ========================================================== */
#define GPIO_EN5_EN5_Pos                  (0UL)                     /*!< EN5 (Bit 0)                                           */
