AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ========================================================  FIFOPTR  ======================================================== */
#define IOSLAVEFD0_FIFOPTR_FIFOSIZ_Pos    (8UL)                     /*!< FIFOSIZ (Bit 8)                                       */
#define IOSLAVEFD0_FIFOPTR_FIFOSIZ_Msk    (0xff00UL)                /*!< FIFOSIZ (Bitfield-Mask: 0xff)                         */
#define IOSLAVEFD0_FIFOPTR_FIFOPTR_Pos    (0UL)                     /*!< FIFOPTR (Bit 0)                                       */
#define IOSLAVEFD0_FIFOPTR_FIFOPTR_Msk    (0xffUL)                  /*!< FIFOPTR (Bitfield-Mask: 0xff)                         */
/* ========================================================  FIFOCFG  ======================================================== */
#define IOSLAVEFD0_FIFOCFG_ROBASE_Pos     (24UL)                    /*!< ROBASE (Bit 24)                                       */
#define IOSLAVEFD0_FIFOCFG_ROBASE_Msk     (0x3f000000UL)            /*!< ROBASE (Bitfield-Mask: 0x3f)                          */
#define IOSLAVEFD0_FIFOCFG_FIFOMAX_Pos    (8UL)                     /*!< FIFOMAX (Bit 8)                                       */
#define IOSLAVEFD0_FIFOCFG_FIFOMAX_Msk    (0x3f00UL)                /*!< FIFOMAX (Bitfield-Mask: 0x3f)                         */
#define IOSLAVEFD0_FIFOCFG_FIFOBASE_Pos   (0UL)                     /*!< FIFOBASE (Bit 0)                                      */
#define IOSLAVEFD0_FIFOCFG_FIFOBASE_Msk   (0x1fUL)                  /*!< FIFOBASE (Bitfield-Mask: 0x1f)                        */
/* ========================================================  FIFOTHR  ======================================================== */
#define IOSLAVEFD0_FIFOTHR_FIFOTHR_Pos    (0UL)                     /*!< FIFOTHR (Bit 0)                                       */
#define IOSLAVEFD0_FIFOTHR_FIFOTHR_Msk    (0xffUL)                  /*!< FIFOTHR (Bitfield-Mask: 0xff)                         */
/* =========================================================  FUPD  ========================================================== */
#define IOSLAVEFD0_FUPD_IOREAD_Pos        (1UL)                     /*!< IOREAD (Bit 1)                                        */
#define IOSLAVEFD0_FUPD_IOREAD_Msk        (0x2UL)                   /*!< IOREAD (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_FUPD_FIFOUPD_Pos       (0UL)                     /*!< FIFOUPD (Bit 0)                                       */
#define IOSLAVEFD0_FUPD_FIFOUPD_Msk       (0x1UL)                   /*!< FIFOUPD (Bitfield-Mask: 0x01)                         */
/* ========================================================  FIFOCTR  ======================================================== */
#define IOSLAVEFD0_FIFOCTR_FIFOCTR_Pos    (0UL)                     /*!< FIFOCTR (Bit 0)                                       */
#define IOSLAVEFD0_FIFOCTR_FIFOCTR_Msk    (0x3ffUL)                 /*!< FIFOCTR (Bitfield-Mask: 0x3ff)                        */
/* ========================================================  FIFOINC  ======================================================== */
#define IOSLAVEFD0_FIFOINC_FIFOINC_Pos    (0UL)                     /*!< FIFOINC (Bit 0)                                       */
#define IOSLAVEFD0_FIFOINC_FIFOINC_Msk    (0x3ffUL)                 /*!< FIFOINC (Bitfield-Mask: 0x3ff)                        */
/* ==========================================================  CFG  ========================================================== */
#define IOSLAVEFD0_CFG_IFCEN_Pos          (31UL)                    /*!< IFCEN (Bit 31)                                        */
#define IOSLAVEFD0_CFG_IFCEN_Msk          (0x80000000UL)            /*!< IFCEN (Bitfield-Mask: 0x01)                           */
#define IOSLAVEFD0_CFG_WRAPPTR_Pos        (20UL)                    /*!< WRAPPTR (Bit 20)                                      */
#define IOSLAVEFD0_CFG_WRAPPTR_Msk        (0x100000UL)              /*!< WRAPPTR (Bitfield-Mask: 0x01)                         */
#define IOSLAVEFD0_CFG_STARTRD_Pos        (4UL)                     /*!< STARTRD (Bit 4)                                       */
#define IOSLAVEFD0_CFG_STARTRD_Msk        (0x10UL)                  /*!< STARTRD (Bitfield-Mask: 0x01)                         */
#define IOSLAVEFD0_CFG_LSB_Pos            (2UL)                     /*!< LSB (Bit 2)                                           */
#define IOSLAVEFD0_CFG_LSB_Msk            (0x4UL)                   /*!< LSB (Bitfield-Mask: 0x01)                             */
#define IOSLAVEFD0_CFG_SPOL_Pos           (1UL)                     /*!< SPOL (Bit 1)                                          */
#define IOSLAVEFD0_CFG_SPOL_Msk           (0x2UL)                   /*!< SPOL (Bitfield-Mask: 0x01)                            */
/* =========================================================  PRENC  ========================================================= */
#define IOSLAVEFD0_PRENC_PRENC_Pos        (0UL)                     /*!< PRENC (Bit 0)                                         */
#define IOSLAVEFD0_PRENC_PRENC_Msk        (0x1fUL)                  /*!< PRENC (Bitfield-Mask: 0x1f)                           */
/* =======================================================  IOINTCTL  ======================================================== */
#define IOSLAVEFD0_IOINTCTL_IOINTSET_Pos  (24UL)                    /*!< IOINTSET (Bit 24)                                     */
#define IOSLAVEFD0_IOINTCTL_IOINTSET_Msk  (0xff000000UL)            /*!< IOINTSET (Bitfield-Mask: 0xff)                        */
#define IOSLAVEFD0_IOINTCTL_IOINTCLR_Pos  (16UL)                    /*!< IOINTCLR (Bit 16)                                     */
#define IOSLAVEFD0_IOINTCTL_IOINTCLR_Msk  (0x10000UL)               /*!< IOINTCLR (Bitfield-Mask: 0x01)                        */
#define IOSLAVEFD0_IOINTCTL_IOINT_Pos     (8UL)                     /*!< IOINT (Bit 8)                                         */
#define IOSLAVEFD0_IOINTCTL_IOINT_Msk     (0xff00UL)                /*!< IOINT (Bitfield-Mask: 0xff)                           */
#define IOSLAVEFD0_IOINTCTL_IOINTEN_Pos   (0UL)                     /*!< IOINTEN (Bit 0)                                       */
#define IOSLAVEFD0_IOINTCTL_IOINTEN_Msk   (0xffUL)                  /*!< IOINTEN (Bitfield-Mask: 0xff)                         */
/* ========================================================  GENADD  ========================================================= */
#define IOSLAVEFD0_GENADD_GADATA_Pos      (0UL)                     /*!< GADATA (Bit 0)                                        */
#define IOSLAVEFD0_GENADD_GADATA_Msk      (0xffUL)                  /*!< GADATA (Bitfield-Mask: 0xff)                          */
/* ========================================================  ADDPTR  ========================================================= */
#define IOSLAVEFD0_ADDPTR_ADDPTR_Pos      (0UL)                     /*!< ADDPTR (Bit 0)                                        */
#define IOSLAVEFD0_ADDPTR_ADDPTR_Msk      (0xffUL)                  /*!< ADDPTR (Bitfield-Mask: 0xff)                          */
/* ========================================================  DMACFG  ========================================================= */
#define IOSLAVEFD0_DMACFG_FRCRDWRT_Pos    (26UL)                    /*!< FRCRDWRT (Bit 26)                                     */
#define IOSLAVEFD0_DMACFG_FRCRDWRT_Msk    (0x4000000UL)             /*!< FRCRDWRT (Bitfield-Mask: 0x01)                        */
#define IOSLAVEFD0_DMACFG_FRCDMA_Pos      (25UL)                    /*!< FRCDMA (Bit 25)                                       */
#define IOSLAVEFD0_DMACFG_FRCDMA_Msk      (0x2000000UL)             /*!< FRCDMA (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_DMACFG_PADBYTEEN_Pos   (24UL)                    /*!< PADBYTEEN (Bit 24)                                    */
#define IOSLAVEFD0_DMACFG_PADBYTEEN_Msk   (0x1000000UL)             /*!< PADBYTEEN (Bitfield-Mask: 0x01)                       */
#define IOSLAVEFD0_DMACFG_PADBYTE_Pos     (16UL)                    /*!< PADBYTE (Bit 16)                                      */
#define IOSLAVEFD0_DMACFG_PADBYTE_Msk     (0xff0000UL)              /*!< PADBYTE (Bitfield-Mask: 0xff)                         */
#define IOSLAVEFD0_DMACFG_DMAQUAD_Pos     (10UL)                    /*!< DMAQUAD (Bit 10)                                      */
#define IOSLAVEFD0_DMACFG_DMAQUAD_Msk     (0x400UL)                 /*!< DMAQUAD (Bitfield-Mask: 0x01)                         */
#define IOSLAVEFD0_DMACFG_DPWROFF_Pos     (9UL)                     /*!< DPWROFF (Bit 9)                                       */
#define IOSLAVEFD0_DMACFG_DPWROFF_Msk     (0x200UL)                 /*!< DPWROFF (Bitfield-Mask: 0x01)                         */
#define IOSLAVEFD0_DMACFG_DMAPRI_Pos      (8UL)                     /*!< DMAPRI (Bit 8)                                        */
#define IOSLAVEFD0_DMACFG_DMAPRI_Msk      (0x100UL)                 /*!< DMAPRI (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_DMACFG_DMADIR_Pos      (1UL)                     /*!< DMADIR (Bit 1)                                        */
#define IOSLAVEFD0_DMACFG_DMADIR_Msk      (0x2UL)                   /*!< DMADIR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_DMACFG_DMAEN_Pos       (0UL)                     /*!< DMAEN (Bit 0)                                         */
#define IOSLAVEFD0_DMACFG_DMAEN_Msk       (0x1UL)                   /*!< DMAEN (Bitfield-Mask: 0x01)                           */
/* ======================================================  DMATOTCOUNT  ====================================================== */
#define IOSLAVEFD0_DMATOTCOUNT_XFRCOUNT_Pos (16UL)                  /*!< XFRCOUNT (Bit 16)                                     */
#define IOSLAVEFD0_DMATOTCOUNT_XFRCOUNT_Msk (0xffff0000UL)          /*!< XFRCOUNT (Bitfield-Mask: 0xffff)                      */
#define IOSLAVEFD0_DMATOTCOUNT_TOTCOUNT_Pos (0UL)                   /*!< TOTCOUNT (Bit 0)                                      */
#define IOSLAVEFD0_DMATOTCOUNT_TOTCOUNT_Msk (0xffffUL)              /*!< TOTCOUNT (Bitfield-Mask: 0xffff)                      */
/* ======================================================  DMATARGADDR  ====================================================== */
#define IOSLAVEFD0_DMATARGADDR_TARGADDR_Pos (0UL)                   /*!< TARGADDR (Bit 0)                                      */
#define IOSLAVEFD0_DMATARGADDR_TARGADDR_Msk (0xffffffffUL)          /*!< TARGADDR (Bitfield-Mask: 0xffffffff)                  */
/* ========================================================  DMASTAT  ======================================================== */
#define IOSLAVEFD0_DMASTAT_DMAFOVF_Pos    (16UL)                    /*!< DMAFOVF (Bit 16)                                      */
#define IOSLAVEFD0_DMASTAT_DMAFOVF_Msk    (0x10000UL)               /*!< DMAFOVF (Bitfield-Mask: 0x01)                         */
#define IOSLAVEFD0_DMASTAT_DMAFSIZE_Pos   (8UL)                     /*!< DMAFSIZE (Bit 8)                                      */
#define IOSLAVEFD0_DMASTAT_DMAFSIZE_Msk   (0xff00UL)                /*!< DMAFSIZE (Bitfield-Mask: 0xff)                        */
#define IOSLAVEFD0_DMASTAT_DMAUNDFL_Pos   (4UL)                     /*!< DMAUNDFL (Bit 4)                                      */
#define IOSLAVEFD0_DMASTAT_DMAUNDFL_Msk   (0x10UL)                  /*!< DMAUNDFL (Bitfield-Mask: 0x01)                        */
#define IOSLAVEFD0_DMASTAT_DMAERR_Pos     (3UL)                     /*!< DMAERR (Bit 3)                                        */
#define IOSLAVEFD0_DMASTAT_DMAERR_Msk     (0x8UL)                   /*!< DMAERR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_DMASTAT_XFRCMP_Pos     (2UL)                     /*!< XFRCMP (Bit 2)                                        */
#define IOSLAVEFD0_DMASTAT_XFRCMP_Msk     (0x4UL)                   /*!< XFRCMP (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_DMASTAT_DMACPL_Pos     (1UL)                     /*!< DMACPL (Bit 1)                                        */
#define IOSLAVEFD0_DMASTAT_DMACPL_Msk     (0x2UL)                   /*!< DMACPL (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_DMASTAT_DMATIP_Pos     (0UL)                     /*!< DMATIP (Bit 0)                                        */
#define IOSLAVEFD0_DMASTAT_DMATIP_Msk     (0x1UL)                   /*!< DMATIP (Bitfield-Mask: 0x01)                          */
/* =========================================================  INTEN  ========================================================= */
#define IOSLAVEFD0_INTEN_DERR_Pos         (11UL)                    /*!< DERR (Bit 11)                                         */
#define IOSLAVEFD0_INTEN_DERR_Msk         (0x800UL)                 /*!< DERR (Bitfield-Mask: 0x01)                            */
#define IOSLAVEFD0_INTEN_DCMP_Pos         (10UL)                    /*!< DCMP (Bit 10)                                         */
#define IOSLAVEFD0_INTEN_DCMP_Msk         (0x400UL)                 /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define IOSLAVEFD0_INTEN_XCMPWR_Pos       (9UL)                     /*!< XCMPWR (Bit 9)                                        */
#define IOSLAVEFD0_INTEN_XCMPWR_Msk       (0x200UL)                 /*!< XCMPWR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTEN_XCMPWF_Pos       (8UL)                     /*!< XCMPWF (Bit 8)                                        */
#define IOSLAVEFD0_INTEN_XCMPWF_Msk       (0x100UL)                 /*!< XCMPWF (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTEN_XCMPRR_Pos       (7UL)                     /*!< XCMPRR (Bit 7)                                        */
#define IOSLAVEFD0_INTEN_XCMPRR_Msk       (0x80UL)                  /*!< XCMPRR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTEN_XCMPRF_Pos       (6UL)                     /*!< XCMPRF (Bit 6)                                        */
#define IOSLAVEFD0_INTEN_XCMPRF_Msk       (0x40UL)                  /*!< XCMPRF (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTEN_IOINTW_Pos       (5UL)                     /*!< IOINTW (Bit 5)                                        */
#define IOSLAVEFD0_INTEN_IOINTW_Msk       (0x20UL)                  /*!< IOINTW (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTEN_FRDERR_Pos       (3UL)                     /*!< FRDERR (Bit 3)                                        */
#define IOSLAVEFD0_INTEN_FRDERR_Msk       (0x8UL)                   /*!< FRDERR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTEN_FUNDFL_Pos       (2UL)                     /*!< FUNDFL (Bit 2)                                        */
#define IOSLAVEFD0_INTEN_FUNDFL_Msk       (0x4UL)                   /*!< FUNDFL (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTEN_FOVFL_Pos        (1UL)                     /*!< FOVFL (Bit 1)                                         */
#define IOSLAVEFD0_INTEN_FOVFL_Msk        (0x2UL)                   /*!< FOVFL (Bitfield-Mask: 0x01)                           */
#define IOSLAVEFD0_INTEN_FSIZE_Pos        (0UL)                     /*!< FSIZE (Bit 0)                                         */
#define IOSLAVEFD0_INTEN_FSIZE_Msk        (0x1UL)                   /*!< FSIZE (Bitfield-Mask: 0x01)                           */
/* ========================================================  INTSTAT  ======================================================== */
#define IOSLAVEFD0_INTSTAT_DERR_Pos       (11UL)                    /*!< DERR (Bit 11)                                         */
#define IOSLAVEFD0_INTSTAT_DERR_Msk       (0x800UL)                 /*!< DERR (Bitfield-Mask: 0x01)                            */
#define IOSLAVEFD0_INTSTAT_DCMP_Pos       (10UL)                    /*!< DCMP (Bit 10)                                         */
#define IOSLAVEFD0_INTSTAT_DCMP_Msk       (0x400UL)                 /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define IOSLAVEFD0_INTSTAT_XCMPWR_Pos     (9UL)                     /*!< XCMPWR (Bit 9)                                        */
#define IOSLAVEFD0_INTSTAT_XCMPWR_Msk     (0x200UL)                 /*!< XCMPWR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSTAT_XCMPWF_Pos     (8UL)                     /*!< XCMPWF (Bit 8)                                        */
#define IOSLAVEFD0_INTSTAT_XCMPWF_Msk     (0x100UL)                 /*!< XCMPWF (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSTAT_XCMPRR_Pos     (7UL)                     /*!< XCMPRR (Bit 7)                                        */
#define IOSLAVEFD0_INTSTAT_XCMPRR_Msk     (0x80UL)                  /*!< XCMPRR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSTAT_XCMPRF_Pos     (6UL)                     /*!< XCMPRF (Bit 6)                                        */
#define IOSLAVEFD0_INTSTAT_XCMPRF_Msk     (0x40UL)                  /*!< XCMPRF (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSTAT_IOINTW_Pos     (5UL)                     /*!< IOINTW (Bit 5)                                        */
#define IOSLAVEFD0_INTSTAT_IOINTW_Msk     (0x20UL)                  /*!< IOINTW (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSTAT_FRDERR_Pos     (3UL)                     /*!< FRDERR (Bit 3)                                        */
#define IOSLAVEFD0_INTSTAT_FRDERR_Msk     (0x8UL)                   /*!< FRDERR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSTAT_FUNDFL_Pos     (2UL)                     /*!< FUNDFL (Bit 2)                                        */
#define IOSLAVEFD0_INTSTAT_FUNDFL_Msk     (0x4UL)                   /*!< FUNDFL (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSTAT_FOVFL_Pos      (1UL)                     /*!< FOVFL (Bit 1)                                         */
#define IOSLAVEFD0_INTSTAT_FOVFL_Msk      (0x2UL)                   /*!< FOVFL (Bitfield-Mask: 0x01)                           */
#define IOSLAVEFD0_INTSTAT_FSIZE_Pos      (0UL)                     /*!< FSIZE (Bit 0)                                         */
#define IOSLAVEFD0_INTSTAT_FSIZE_Msk      (0x1UL)                   /*!< FSIZE (Bitfield-Mask: 0x01)                           */
/* ========================================================  INTCLR  ========================================================= */
#define IOSLAVEFD0_INTCLR_DERR_Pos        (11UL)                    /*!< DERR (Bit 11)                                         */
#define IOSLAVEFD0_INTCLR_DERR_Msk        (0x800UL)                 /*!< DERR (Bitfield-Mask: 0x01)                            */
#define IOSLAVEFD0_INTCLR_DCMP_Pos        (10UL)                    /*!< DCMP (Bit 10)                                         */
#define IOSLAVEFD0_INTCLR_DCMP_Msk        (0x400UL)                 /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define IOSLAVEFD0_INTCLR_XCMPWR_Pos      (9UL)                     /*!< XCMPWR (Bit 9)                                        */
#define IOSLAVEFD0_INTCLR_XCMPWR_Msk      (0x200UL)                 /*!< XCMPWR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTCLR_XCMPWF_Pos      (8UL)                     /*!< XCMPWF (Bit 8)                                        */
#define IOSLAVEFD0_INTCLR_XCMPWF_Msk      (0x100UL)                 /*!< XCMPWF (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTCLR_XCMPRR_Pos      (7UL)                     /*!< XCMPRR (Bit 7)                                        */
#define IOSLAVEFD0_INTCLR_XCMPRR_Msk      (0x80UL)                  /*!< XCMPRR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTCLR_XCMPRF_Pos      (6UL)                     /*!< XCMPRF (Bit 6)                                        */
#define IOSLAVEFD0_INTCLR_XCMPRF_Msk      (0x40UL)                  /*!< XCMPRF (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTCLR_IOINTW_Pos      (5UL)                     /*!< IOINTW (Bit 5)                                        */
#define IOSLAVEFD0_INTCLR_IOINTW_Msk      (0x20UL)                  /*!< IOINTW (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTCLR_FRDERR_Pos      (3UL)                     /*!< FRDERR (Bit 3)                                        */
#define IOSLAVEFD0_INTCLR_FRDERR_Msk      (0x8UL)                   /*!< FRDERR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTCLR_FUNDFL_Pos      (2UL)                     /*!< FUNDFL (Bit 2)                                        */
#define IOSLAVEFD0_INTCLR_FUNDFL_Msk      (0x4UL)                   /*!< FUNDFL (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTCLR_FOVFL_Pos       (1UL)                     /*!< FOVFL (Bit 1)                                         */
#define IOSLAVEFD0_INTCLR_FOVFL_Msk       (0x2UL)                   /*!< FOVFL (Bitfield-Mask: 0x01)                           */
#define IOSLAVEFD0_INTCLR_FSIZE_Pos       (0UL)                     /*!< FSIZE (Bit 0)                                         */
#define IOSLAVEFD0_INTCLR_FSIZE_Msk       (0x1UL)                   /*!< FSIZE (Bitfield-Mask: 0x01)                           */
/* ========================================================  INTSET  ========================================================= */
#define IOSLAVEFD0_INTSET_DERR_Pos        (11UL)                    /*!< DERR (Bit 11)                                         */
#define IOSLAVEFD0_INTSET_DERR_Msk        (0x800UL)                 /*!< DERR (Bitfield-Mask: 0x01)                            */
#define IOSLAVEFD0_INTSET_DCMP_Pos        (10UL)                    /*!< DCMP (Bit 10)                                         */
#define IOSLAVEFD0_INTSET_DCMP_Msk        (0x400UL)                 /*!< DCMP (Bitfield-Mask: 0x01)                            */
#define IOSLAVEFD0_INTSET_XCMPWR_Pos      (9UL)                     /*!< XCMPWR (Bit 9)                                        */
#define IOSLAVEFD0_INTSET_XCMPWR_Msk      (0x200UL)                 /*!< XCMPWR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSET_XCMPWF_Pos      (8UL)                     /*!< XCMPWF (Bit 8)                                        */
#define IOSLAVEFD0_INTSET_XCMPWF_Msk      (0x100UL)                 /*!< XCMPWF (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSET_XCMPRR_Pos      (7UL)                     /*!< XCMPRR (Bit 7)                                        */
#define IOSLAVEFD0_INTSET_XCMPRR_Msk      (0x80UL)                  /*!< XCMPRR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSET_XCMPRF_Pos      (6UL)                     /*!< XCMPRF (Bit 6)                                        */
#define IOSLAVEFD0_INTSET_XCMPRF_Msk      (0x40UL)                  /*!< XCMPRF (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSET_IOINTW_Pos      (5UL)                     /*!< IOINTW (Bit 5)                                        */
#define IOSLAVEFD0_INTSET_IOINTW_Msk      (0x20UL)                  /*!< IOINTW (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSET_FRDERR_Pos      (3UL)                     /*!< FRDERR (Bit 3)                                        */
#define IOSLAVEFD0_INTSET_FRDERR_Msk      (0x8UL)                   /*!< FRDERR (Bitfield-Mask: 0x01)                          */
#define IOSLAVEFD0_INTSET_FUNDFL_Pos      (2UL)                     /*!< FUNDFL (Bit 2)                                        */
