AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
#define MCUCTRL_SIMOBUCK14_VDDFBRNOUTTRIM_Msk (0xffc00UL)           /*!< VDDFBRNOUTTRIM (Bitfield-Mask: 0x3ff)                 */
#define MCUCTRL_SIMOBUCK14_VDDFCOMPTRIMPLUS_Pos (5UL)               /*!< VDDFCOMPTRIMPLUS (Bit 5)                              */
#define MCUCTRL_SIMOBUCK14_VDDFCOMPTRIMPLUS_Msk (0x3e0UL)           /*!< VDDFCOMPTRIMPLUS (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK14_VDDFCOMPTRIMMINUS_Pos (0UL)              /*!< VDDFCOMPTRIMMINUS (Bit 0)                             */
#define MCUCTRL_SIMOBUCK14_VDDFCOMPTRIMMINUS_Msk (0x1fUL)           /*!< VDDFCOMPTRIMMINUS (Bitfield-Mask: 0x1f)               */
/* ======================================================  SIMOBUCK15  ======================================================= */
#define MCUCTRL_SIMOBUCK15_TRIMLATCHOVER_Pos (31UL)                 /*!< TRIMLATCHOVER (Bit 31)                                */
#define MCUCTRL_SIMOBUCK15_TRIMLATCHOVER_Msk (0x80000000UL)         /*!< TRIMLATCHOVER (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK15_ZXCOMPOFFSETTRIM_Pos (24UL)              /*!< ZXCOMPOFFSETTRIM (Bit 24)                             */
#define MCUCTRL_SIMOBUCK15_ZXCOMPOFFSETTRIM_Msk (0x1f000000UL)      /*!< ZXCOMPOFFSETTRIM (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK15_VDDCRXCOMPTRIMEN_Pos (23UL)              /*!< VDDCRXCOMPTRIMEN (Bit 23)                             */
#define MCUCTRL_SIMOBUCK15_VDDCRXCOMPTRIMEN_Msk (0x800000UL)        /*!< VDDCRXCOMPTRIMEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK15_VDDFRXCOMPTRIMEN_Pos (22UL)              /*!< VDDFRXCOMPTRIMEN (Bit 22)                             */
#define MCUCTRL_SIMOBUCK15_VDDFRXCOMPTRIMEN_Msk (0x400000UL)        /*!< VDDFRXCOMPTRIMEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK15_VDDSRXCOMPTRIMEN_Pos (21UL)              /*!< VDDSRXCOMPTRIMEN (Bit 21)                             */
#define MCUCTRL_SIMOBUCK15_VDDSRXCOMPTRIMEN_Msk (0x200000UL)        /*!< VDDSRXCOMPTRIMEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK15_VDDCLVRXCOMPTRIMEN_Pos (20UL)            /*!< VDDCLVRXCOMPTRIMEN (Bit 20)                           */
#define MCUCTRL_SIMOBUCK15_VDDCLVRXCOMPTRIMEN_Msk (0x100000UL)      /*!< VDDCLVRXCOMPTRIMEN (Bitfield-Mask: 0x01)              */
#define MCUCTRL_SIMOBUCK15_VDDCBRNOUTTRIM_Pos (10UL)                /*!< VDDCBRNOUTTRIM (Bit 10)                               */
#define MCUCTRL_SIMOBUCK15_VDDCBRNOUTTRIM_Msk (0xffc00UL)           /*!< VDDCBRNOUTTRIM (Bitfield-Mask: 0x3ff)                 */
#define MCUCTRL_SIMOBUCK15_VDDCCOMPTRIMPLUS_Pos (5UL)               /*!< VDDCCOMPTRIMPLUS (Bit 5)                              */
#define MCUCTRL_SIMOBUCK15_VDDCCOMPTRIMPLUS_Msk (0x3e0UL)           /*!< VDDCCOMPTRIMPLUS (Bitfield-Mask: 0x1f)                */
#define MCUCTRL_SIMOBUCK15_VDDCCOMPTRIMMINUS_Pos (0UL)              /*!< VDDCCOMPTRIMMINUS (Bit 0)                             */
#define MCUCTRL_SIMOBUCK15_VDDCCOMPTRIMMINUS_Msk (0x1fUL)           /*!< VDDCCOMPTRIMMINUS (Bitfield-Mask: 0x1f)               */
/* ========================================================  PWRSW0  ========================================================= */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUOVERRIDE_Pos (31UL)              /*!< PWRSWVDDRCPUOVERRIDE (Bit 31)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUOVERRIDE_Msk (0x80000000UL)      /*!< PWRSWVDDRCPUOVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_Pos (30UL)               /*!< PWRSWVDDRCPUSTATSEL (Bit 30)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_Msk (0x40000000UL)       /*!< PWRSWVDDRCPUSTATSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUPGN_Pos (29UL)                   /*!< PWRSWVDDRCPUPGN (Bit 29)                              */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUPGN_Msk (0x20000000UL)           /*!< PWRSWVDDRCPUPGN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSEL_Pos (27UL)                /*!< PWRSWVDDRCPUDYNSEL (Bit 27)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSEL_Msk (0x8000000UL)         /*!< PWRSWVDDRCPUDYNSEL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDMLOVERRIDE_Pos (26UL)                /*!< PWRSWVDDMLOVERRIDE (Bit 26)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDMLOVERRIDE_Msk (0x4000000UL)         /*!< PWRSWVDDMLOVERRIDE (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_Pos (25UL)                 /*!< PWRSWVDDMLSTATSEL (Bit 25)                            */
#define MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_Msk (0x2000000UL)          /*!< PWRSWVDDMLSTATSEL (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW0_PWRSWVDDMLDYNSEL_Pos (24UL)                  /*!< PWRSWVDDMLDYNSEL (Bit 24)                             */
#define MCUCTRL_PWRSW0_PWRSWVDDMLDYNSEL_Msk (0x1000000UL)           /*!< PWRSWVDDMLDYNSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUOVERRIDE_Pos (17UL)              /*!< PWRSWVDDMCPUOVERRIDE (Bit 17)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUOVERRIDE_Msk (0x20000UL)         /*!< PWRSWVDDMCPUOVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Pos (16UL)               /*!< PWRSWVDDMCPUSTATSEL (Bit 16)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Msk (0x10000UL)          /*!< PWRSWVDDMCPUSTATSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUDYNSEL_Pos (15UL)                /*!< PWRSWVDDMCPUDYNSEL (Bit 15)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUDYNSEL_Msk (0x8000UL)            /*!< PWRSWVDDMCPUDYNSEL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORPGN_Pos (7UL)                    /*!< PWRSWVDDCAORPGN (Bit 7)                               */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORPGN_Msk (0x80UL)                 /*!< PWRSWVDDCAORPGN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_PWRSW0_PWRSWVDDCAOROVERRIDE_Pos (6UL)               /*!< PWRSWVDDCAOROVERRIDE (Bit 6)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDCAOROVERRIDE_Msk (0x40UL)            /*!< PWRSWVDDCAOROVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORDYNSEL_Pos (4UL)                 /*!< PWRSWVDDCAORDYNSEL (Bit 4)                            */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORDYNSEL_Msk (0x30UL)              /*!< PWRSWVDDCAORDYNSEL (Bitfield-Mask: 0x03)              */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUOVERRIDE_Pos (3UL)                /*!< PWRSWVDDCPUOVERRIDE (Bit 3)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUOVERRIDE_Msk (0x8UL)              /*!< PWRSWVDDCPUOVERRIDE (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUPGN_Pos (2UL)                     /*!< PWRSWVDDCPUPGN (Bit 2)                                */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUPGN_Msk (0x4UL)                   /*!< PWRSWVDDCPUPGN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSEL_Pos (0UL)                  /*!< PWRSWVDDCPUDYNSEL (Bit 0)                             */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSEL_Msk (0x3UL)                /*!< PWRSWVDDCPUDYNSEL (Bitfield-Mask: 0x03)               */
/* ========================================================  PWRSW1  ========================================================= */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSORVAL_Pos (31UL)                /*!< SHORTVDDFVDDSORVAL (Bit 31)                           */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSORVAL_Msk (0x80000000UL)        /*!< SHORTVDDFVDDSORVAL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSOREN_Pos (30UL)                 /*!< SHORTVDDFVDDSOREN (Bit 30)                            */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSOREN_Msk (0x40000000UL)         /*!< SHORTVDDFVDDSOREN (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVORVAL_Pos (29UL)              /*!< SHORTVDDCVDDCLVORVAL (Bit 29)                         */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVORVAL_Msk (0x20000000UL)      /*!< SHORTVDDCVDDCLVORVAL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVOREN_Pos (28UL)               /*!< SHORTVDDCVDDCLVOREN (Bit 28)                          */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVOREN_Msk (0x10000000UL)       /*!< SHORTVDDCVDDCLVOREN (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW1_FORCEVDDRMOFF_Pos  (27UL)                    /*!< FORCEVDDRMOFF (Bit 27)                                */
#define MCUCTRL_PWRSW1_FORCEVDDRMOFF_Msk  (0x8000000UL)             /*!< FORCEVDDRMOFF (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_FORCEVDDRMVDDF_Pos (26UL)                    /*!< FORCEVDDRMVDDF (Bit 26)                               */
#define MCUCTRL_PWRSW1_FORCEVDDRMVDDF_Msk (0x4000000UL)             /*!< FORCEVDDRMVDDF (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_PWRSW1_PWRSWVDDLOVERRIDE_Pos (19UL)                 /*!< PWRSWVDDLOVERRIDE (Bit 19)                            */
#define MCUCTRL_PWRSW1_PWRSWVDDLOVERRIDE_Msk (0x80000UL)            /*!< PWRSWVDDLOVERRIDE (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_PWRSWVDDLPGN_Pos   (18UL)                    /*!< PWRSWVDDLPGN (Bit 18)                                 */
#define MCUCTRL_PWRSW1_PWRSWVDDLPGN_Msk   (0x40000UL)               /*!< PWRSWVDDLPGN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_PWRSW1_PWRSWVDDRMOVERRIDE_Pos (17UL)                /*!< PWRSWVDDRMOVERRIDE (Bit 17)                           */
#define MCUCTRL_PWRSW1_PWRSWVDDRMOVERRIDE_Msk (0x20000UL)           /*!< PWRSWVDDRMOVERRIDE (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_Pos (16UL)                 /*!< PWRSWVDDRMSTATSEL (Bit 16)                            */
#define MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_Msk (0x10000UL)            /*!< PWRSWVDDRMSTATSEL (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_PWRSWVDDRMPGN_Pos  (15UL)                    /*!< PWRSWVDDRMPGN (Bit 15)                                */
#define MCUCTRL_PWRSW1_PWRSWVDDRMPGN_Msk  (0x8000UL)                /*!< PWRSWVDDRMPGN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_PWRSWVDDRMDYNSEL_Pos (14UL)                  /*!< PWRSWVDDRMDYNSEL (Bit 14)                             */
#define MCUCTRL_PWRSW1_PWRSWVDDRMDYNSEL_Msk (0x4000UL)              /*!< PWRSWVDDRMDYNSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW1_PWRSWVDDRLOVERRIDE_Pos (13UL)                /*!< PWRSWVDDRLOVERRIDE (Bit 13)                           */
#define MCUCTRL_PWRSW1_PWRSWVDDRLOVERRIDE_Msk (0x2000UL)            /*!< PWRSWVDDRLOVERRIDE (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_Pos (12UL)                 /*!< PWRSWVDDRLSTATSEL (Bit 12)                            */
#define MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_Msk (0x1000UL)             /*!< PWRSWVDDRLSTATSEL (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_PWRSWVDDRLPGN_Pos  (11UL)                    /*!< PWRSWVDDRLPGN (Bit 11)                                */
#define MCUCTRL_PWRSW1_PWRSWVDDRLPGN_Msk  (0x800UL)                 /*!< PWRSWVDDRLPGN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_PWRSWVDDRLDYNSEL_Pos (10UL)                  /*!< PWRSWVDDRLDYNSEL (Bit 10)                             */
#define MCUCTRL_PWRSW1_PWRSWVDDRLDYNSEL_Msk (0x400UL)               /*!< PWRSWVDDRLDYNSEL (Bitfield-Mask: 0x01)                */
/* ======================================================  USBRSTCTRL  ======================================================= */
#define MCUCTRL_USBRSTCTRL_USBUTMIRSTRELEASE_Pos (2UL)              /*!< USBUTMIRSTRELEASE (Bit 2)                             */
#define MCUCTRL_USBRSTCTRL_USBUTMIRSTRELEASE_Msk (0x4UL)            /*!< USBUTMIRSTRELEASE (Bitfield-Mask: 0x01)               */
#define MCUCTRL_USBRSTCTRL_USBPORRSTRELEASE_Pos (1UL)               /*!< USBPORRSTRELEASE (Bit 1)                              */
#define MCUCTRL_USBRSTCTRL_USBPORRSTRELEASE_Msk (0x2UL)             /*!< USBPORRSTRELEASE (Bitfield-Mask: 0x01)                */
#define MCUCTRL_USBRSTCTRL_USBRSTENABLE_Pos (0UL)                   /*!< USBRSTENABLE (Bit 0)                                  */
#define MCUCTRL_USBRSTCTRL_USBRSTENABLE_Msk (0x1UL)                 /*!< USBRSTENABLE (Bitfield-Mask: 0x01)                    */
/* ======================================================  FLASHWPROT0  ====================================================== */
#define MCUCTRL_FLASHWPROT0_FW0BITS_Pos   (0UL)                     /*!< FW0BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT0_FW0BITS_Msk   (0xffffffffUL)            /*!< FW0BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT1  ====================================================== */
#define MCUCTRL_FLASHWPROT1_FW1BITS_Pos   (0UL)                     /*!< FW1BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT1_FW1BITS_Msk   (0xffffffffUL)            /*!< FW1BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT2  ====================================================== */
#define MCUCTRL_FLASHWPROT2_FW2BITS_Pos   (0UL)                     /*!< FW2BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT2_FW2BITS_Msk   (0xffffffffUL)            /*!< FW2BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT3  ====================================================== */
#define MCUCTRL_FLASHWPROT3_FW3BITS_Pos   (0UL)                     /*!< FW3BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT3_FW3BITS_Msk   (0xffffffffUL)            /*!< FW3BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT0  ====================================================== */
#define MCUCTRL_FLASHRPROT0_FR0BITS_Pos   (0UL)                     /*!< FR0BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT0_FR0BITS_Msk   (0xffffffffUL)            /*!< FR0BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT1  ====================================================== */
#define MCUCTRL_FLASHRPROT1_FR1BITS_Pos   (0UL)                     /*!< FR1BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT1_FR1BITS_Msk   (0xffffffffUL)            /*!< FR1BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT2  ====================================================== */
#define MCUCTRL_FLASHRPROT2_FR2BITS_Pos   (0UL)                     /*!< FR2BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT2_FR2BITS_Msk   (0xffffffffUL)            /*!< FR2BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT3  ====================================================== */
#define MCUCTRL_FLASHRPROT3_FR3BITS_Pos   (0UL)                     /*!< FR3BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT3_FR3BITS_Msk   (0xffffffffUL)            /*!< FR3BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  SRAMWPROT0  ======================================================= */
#define MCUCTRL_SRAMWPROT0_SRAMWPROT0_Pos (0UL)                     /*!< SRAMWPROT0 (Bit 0)                                    */
#define MCUCTRL_SRAMWPROT0_SRAMWPROT0_Msk (0xffffffffUL)            /*!< SRAMWPROT0 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMWPROT1  ======================================================= */
#define MCUCTRL_SRAMWPROT1_SRAMWPROT1_Pos (0UL)                     /*!< SRAMWPROT1 (Bit 0)                                    */
#define MCUCTRL_SRAMWPROT1_SRAMWPROT1_Msk (0xffffffffUL)            /*!< SRAMWPROT1 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMWPROT2  ======================================================= */
#define MCUCTRL_SRAMWPROT2_SRAMWPROT2_Pos (0UL)                     /*!< SRAMWPROT2 (Bit 0)                                    */
#define MCUCTRL_SRAMWPROT2_SRAMWPROT2_Msk (0xffffffffUL)            /*!< SRAMWPROT2 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMWPROT3  ======================================================= */
#define MCUCTRL_SRAMWPROT3_SRAMWPROT3_Pos (0UL)                     /*!< SRAMWPROT3 (Bit 0)                                    */
#define MCUCTRL_SRAMWPROT3_SRAMWPROT3_Msk (0xffffffffUL)            /*!< SRAMWPROT3 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMWPROT4  ======================================================= */
#define MCUCTRL_SRAMWPROT4_SRAMWPROT4_Pos (0UL)                     /*!< SRAMWPROT4 (Bit 0)                                    */
#define MCUCTRL_SRAMWPROT4_SRAMWPROT4_Msk (0xffffffffUL)            /*!< SRAMWPROT4 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMWPROT5  ======================================================= */
#define MCUCTRL_SRAMWPROT5_SRAMWPROT5_Pos (0UL)                     /*!< SRAMWPROT5 (Bit 0)                                    */
#define MCUCTRL_SRAMWPROT5_SRAMWPROT5_Msk (0xffffffffUL)            /*!< SRAMWPROT5 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMRPROT0  ======================================================= */
#define MCUCTRL_SRAMRPROT0_SRAMRPROT0_Pos (0UL)                     /*!< SRAMRPROT0 (Bit 0)                                    */
#define MCUCTRL_SRAMRPROT0_SRAMRPROT0_Msk (0xffffffffUL)            /*!< SRAMRPROT0 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMRPROT1  ======================================================= */
#define MCUCTRL_SRAMRPROT1_SRAMRPROT1_Pos (0UL)                     /*!< SRAMRPROT1 (Bit 0)                                    */
#define MCUCTRL_SRAMRPROT1_SRAMRPROT1_Msk (0xffffffffUL)            /*!< SRAMRPROT1 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMRPROT2  ======================================================= */
#define MCUCTRL_SRAMRPROT2_SRAMRPROT2_Pos (0UL)                     /*!< SRAMRPROT2 (Bit 0)                                    */
#define MCUCTRL_SRAMRPROT2_SRAMRPROT2_Msk (0xffffffffUL)            /*!< SRAMRPROT2 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMRPROT3  ======================================================= */
#define MCUCTRL_SRAMRPROT3_SRAMRPROT3_Pos (0UL)                     /*!< SRAMRPROT3 (Bit 0)                                    */
#define MCUCTRL_SRAMRPROT3_SRAMRPROT3_Msk (0xffffffffUL)            /*!< SRAMRPROT3 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMRPROT4  ======================================================= */
#define MCUCTRL_SRAMRPROT4_SRAMRPROT4_Pos (0UL)                     /*!< SRAMRPROT4 (Bit 0)                                    */
#define MCUCTRL_SRAMRPROT4_SRAMRPROT4_Msk (0xffffffffUL)            /*!< SRAMRPROT4 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMRPROT5  ======================================================= */
#define MCUCTRL_SRAMRPROT5_SRAMRPROT5_Pos (0UL)                     /*!< SRAMRPROT5 (Bit 0)                                    */
#define MCUCTRL_SRAMRPROT5_SRAMRPROT5_Msk (0xffffffffUL)            /*!< SRAMRPROT5 (Bitfield-Mask: 0xffffffff)                */
/* =====================================================  AUDADCPWRCTRL  ===================================================== */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCKEEPOUTEN_Pos (18UL)            /*!< AUDADCKEEPOUTEN (Bit 18)                              */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCKEEPOUTEN_Msk (0x40000UL)       /*!< AUDADCKEEPOUTEN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCRFBUFSLWEN_Pos (17UL)           /*!< AUDADCRFBUFSLWEN (Bit 17)                             */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCRFBUFSLWEN_Msk (0x20000UL)      /*!< AUDADCRFBUFSLWEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCINBUFEN_Pos (16UL)              /*!< AUDADCINBUFEN (Bit 16)                                */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCINBUFEN_Msk (0x10000UL)         /*!< AUDADCINBUFEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCINBUFSEL_Pos (14UL)             /*!< AUDADCINBUFSEL (Bit 14)                               */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCINBUFSEL_Msk (0xc000UL)         /*!< AUDADCINBUFSEL (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCVBATDIVEN_Pos (12UL)            /*!< AUDADCVBATDIVEN (Bit 12)                              */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCVBATDIVEN_Msk (0x1000UL)        /*!< AUDADCVBATDIVEN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_AUDADCPWRCTRL_VDDAUDADCRESETN_Pos (10UL)            /*!< VDDAUDADCRESETN (Bit 10)                              */
#define MCUCTRL_AUDADCPWRCTRL_VDDAUDADCRESETN_Msk (0x400UL)         /*!< VDDAUDADCRESETN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_AUDADCPWRCTRL_VDDAUDADCDIGISOLATE_Pos (9UL)         /*!< VDDAUDADCDIGISOLATE (Bit 9)                           */
#define MCUCTRL_AUDADCPWRCTRL_VDDAUDADCDIGISOLATE_Msk (0x200UL)     /*!< VDDAUDADCDIGISOLATE (Bitfield-Mask: 0x01)             */
#define MCUCTRL_AUDADCPWRCTRL_VDDAUDADCSARISOLATE_Pos (8UL)         /*!< VDDAUDADCSARISOLATE (Bit 8)                           */
#define MCUCTRL_AUDADCPWRCTRL_VDDAUDADCSARISOLATE_Msk (0x100UL)     /*!< VDDAUDADCSARISOLATE (Bitfield-Mask: 0x01)             */
#define MCUCTRL_AUDADCPWRCTRL_AUDREFKEEPPEN_Pos (5UL)               /*!< AUDREFKEEPPEN (Bit 5)                                 */
#define MCUCTRL_AUDADCPWRCTRL_AUDREFKEEPPEN_Msk (0x20UL)            /*!< AUDREFKEEPPEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_AUDADCPWRCTRL_AUDREFBUFPEN_Pos (4UL)                /*!< AUDREFBUFPEN (Bit 4)                                  */
#define MCUCTRL_AUDADCPWRCTRL_AUDREFBUFPEN_Msk (0x10UL)             /*!< AUDREFBUFPEN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_AUDADCPWRCTRL_AUDBGTPEN_Pos (3UL)                   /*!< AUDBGTPEN (Bit 3)                                     */
#define MCUCTRL_AUDADCPWRCTRL_AUDBGTPEN_Msk (0x8UL)                 /*!< AUDBGTPEN (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCBPSEN_Pos (2UL)                 /*!< AUDADCBPSEN (Bit 2)                                   */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCBPSEN_Msk (0x4UL)               /*!< AUDADCBPSEN (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCAPSEN_Pos (1UL)                 /*!< AUDADCAPSEN (Bit 1)                                   */
#define MCUCTRL_AUDADCPWRCTRL_AUDADCAPSEN_Msk (0x2UL)               /*!< AUDADCAPSEN (Bitfield-Mask: 0x01)                     */
