AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
#define PWRCTRL_SYSPWRSTATUS_PWRSTMCUH_Msk (0x2UL)                  /*!< PWRSTMCUH (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_SYSPWRSTATUS_PWRSTMCUL_Pos (0UL)                    /*!< PWRSTMCUL (Bit 0)                                     */
#define PWRCTRL_SYSPWRSTATUS_PWRSTMCUL_Msk (0x1UL)                  /*!< PWRSTMCUL (Bitfield-Mask: 0x01)                       */
/* ======================================================  SSRAMPWREN  ======================================================= */
#define PWRCTRL_SSRAMPWREN_PWRENSSRAM_Pos (0UL)                     /*!< PWRENSSRAM (Bit 0)                                    */
#define PWRCTRL_SSRAMPWREN_PWRENSSRAM_Msk (0x7UL)                   /*!< PWRENSSRAM (Bitfield-Mask: 0x07)                      */
/* ======================================================  SSRAMPWRST  ======================================================= */
#define PWRCTRL_SSRAMPWRST_SSRAMPWRST_Pos (0UL)                     /*!< SSRAMPWRST (Bit 0)                                    */
#define PWRCTRL_SSRAMPWRST_SSRAMPWRST_Msk (0x7UL)                   /*!< SSRAMPWRST (Bitfield-Mask: 0x07)                      */
/* ======================================================  SSRAMRETCFG  ====================================================== */
#define PWRCTRL_SSRAMRETCFG_SSRAMACTDISP_Pos (12UL)                 /*!< SSRAMACTDISP (Bit 12)                                 */
#define PWRCTRL_SSRAMRETCFG_SSRAMACTDISP_Msk (0x7000UL)             /*!< SSRAMACTDISP (Bitfield-Mask: 0x07)                    */
#define PWRCTRL_SSRAMRETCFG_SSRAMACTGFX_Pos (9UL)                   /*!< SSRAMACTGFX (Bit 9)                                   */
#define PWRCTRL_SSRAMRETCFG_SSRAMACTGFX_Msk (0xe00UL)               /*!< SSRAMACTGFX (Bitfield-Mask: 0x07)                     */
#define PWRCTRL_SSRAMRETCFG_SSRAMACTMCU_Pos (3UL)                   /*!< SSRAMACTMCU (Bit 3)                                   */
#define PWRCTRL_SSRAMRETCFG_SSRAMACTMCU_Msk (0x38UL)                /*!< SSRAMACTMCU (Bitfield-Mask: 0x07)                     */
#define PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_Pos (0UL)                   /*!< SSRAMPWDSLP (Bit 0)                                   */
#define PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_Msk (0x7UL)                 /*!< SSRAMPWDSLP (Bitfield-Mask: 0x07)                     */
/* =====================================================  DEVPWREVENTEN  ===================================================== */
#define PWRCTRL_DEVPWREVENTEN_PDMEVEN_Pos (12UL)                    /*!< PDMEVEN (Bit 12)                                      */
#define PWRCTRL_DEVPWREVENTEN_PDMEVEN_Msk (0x1000UL)                /*!< PDMEVEN (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREVENTEN_MSPI3EVEN_Pos (11UL)                  /*!< MSPI3EVEN (Bit 11)                                    */
#define PWRCTRL_DEVPWREVENTEN_MSPI3EVEN_Msk (0x800UL)               /*!< MSPI3EVEN (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWREVENTEN_MSPI2EVEN_Pos (10UL)                  /*!< MSPI2EVEN (Bit 10)                                    */
#define PWRCTRL_DEVPWREVENTEN_MSPI2EVEN_Msk (0x400UL)               /*!< MSPI2EVEN (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWREVENTEN_MSPI1EVEN_Pos (9UL)                   /*!< MSPI1EVEN (Bit 9)                                     */
#define PWRCTRL_DEVPWREVENTEN_MSPI1EVEN_Msk (0x200UL)               /*!< MSPI1EVEN (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWREVENTEN_MSPIEVEN_Pos (8UL)                    /*!< MSPIEVEN (Bit 8)                                      */
#define PWRCTRL_DEVPWREVENTEN_MSPIEVEN_Msk (0x100UL)                /*!< MSPIEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_AUDEVEN_Pos (7UL)                     /*!< AUDEVEN (Bit 7)                                       */
#define PWRCTRL_DEVPWREVENTEN_AUDEVEN_Msk (0x80UL)                  /*!< AUDEVEN (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREVENTEN_ADCEVEN_Pos (5UL)                     /*!< ADCEVEN (Bit 5)                                       */
#define PWRCTRL_DEVPWREVENTEN_ADCEVEN_Msk (0x20UL)                  /*!< ADCEVEN (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREVENTEN_HCPCEVEN_Pos (4UL)                    /*!< HCPCEVEN (Bit 4)                                      */
#define PWRCTRL_DEVPWREVENTEN_HCPCEVEN_Msk (0x10UL)                 /*!< HCPCEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_HCPBEVEN_Pos (3UL)                    /*!< HCPBEVEN (Bit 3)                                      */
#define PWRCTRL_DEVPWREVENTEN_HCPBEVEN_Msk (0x8UL)                  /*!< HCPBEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_HCPAEVEN_Pos (2UL)                    /*!< HCPAEVEN (Bit 2)                                      */
#define PWRCTRL_DEVPWREVENTEN_HCPAEVEN_Msk (0x4UL)                  /*!< HCPAEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_MCUHEVEN_Pos (1UL)                    /*!< MCUHEVEN (Bit 1)                                      */
#define PWRCTRL_DEVPWREVENTEN_MCUHEVEN_Msk (0x2UL)                  /*!< MCUHEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_MCULEVEN_Pos (0UL)                    /*!< MCULEVEN (Bit 0)                                      */
#define PWRCTRL_DEVPWREVENTEN_MCULEVEN_Msk (0x1UL)                  /*!< MCULEVEN (Bitfield-Mask: 0x01)                        */
/* =====================================================  MEMPWREVENTEN  ===================================================== */
#define PWRCTRL_MEMPWREVENTEN_NVM0EN_Pos  (3UL)                     /*!< NVM0EN (Bit 3)                                        */
#define PWRCTRL_MEMPWREVENTEN_NVM0EN_Msk  (0x8UL)                   /*!< NVM0EN (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_MEMPWREVENTEN_DTCMEN_Pos  (0UL)                     /*!< DTCMEN (Bit 0)                                        */
#define PWRCTRL_MEMPWREVENTEN_DTCMEN_Msk  (0x7UL)                   /*!< DTCMEN (Bitfield-Mask: 0x07)                          */
/* ======================================================  MMSOVERRIDE  ====================================================== */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMRETGFX_Pos (11UL)            /*!< MMSOVRSSRAMRETGFX (Bit 11)                            */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMRETGFX_Msk (0x3800UL)        /*!< MMSOVRSSRAMRETGFX (Bitfield-Mask: 0x07)               */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMRETDISP_Pos (8UL)            /*!< MMSOVRSSRAMRETDISP (Bit 8)                            */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMRETDISP_Msk (0x700UL)        /*!< MMSOVRSSRAMRETDISP (Bitfield-Mask: 0x07)              */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMGFX_Pos (3UL)                /*!< MMSOVRSSRAMGFX (Bit 3)                                */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMGFX_Msk (0x8UL)              /*!< MMSOVRSSRAMGFX (Bitfield-Mask: 0x01)                  */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMDISP_Pos (2UL)               /*!< MMSOVRSSRAMDISP (Bit 2)                               */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMDISP_Msk (0x4UL)             /*!< MMSOVRSSRAMDISP (Bitfield-Mask: 0x01)                 */
#define PWRCTRL_MMSOVERRIDE_MMSOVRMCULGFX_Pos (1UL)                 /*!< MMSOVRMCULGFX (Bit 1)                                 */
#define PWRCTRL_MMSOVERRIDE_MMSOVRMCULGFX_Msk (0x2UL)               /*!< MMSOVRMCULGFX (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_MMSOVERRIDE_MMSOVRMCULDISP_Pos (0UL)                /*!< MMSOVRMCULDISP (Bit 0)                                */
#define PWRCTRL_MMSOVERRIDE_MMSOVRMCULDISP_Msk (0x1UL)              /*!< MMSOVRMCULDISP (Bitfield-Mask: 0x01)                  */
/* ======================================================  CPUPWRCTRL  ======================================================= */
#define PWRCTRL_CPUPWRCTRL_DISFUNCRETMODE_Pos (12UL)                /*!< DISFUNCRETMODE (Bit 12)                               */
#define PWRCTRL_CPUPWRCTRL_DISFUNCRETMODE_Msk (0x1000UL)            /*!< DISFUNCRETMODE (Bitfield-Mask: 0x01)                  */
#define PWRCTRL_CPUPWRCTRL_DBGCLKSTATE_Pos (11UL)                   /*!< DBGCLKSTATE (Bit 11)                                  */
#define PWRCTRL_CPUPWRCTRL_DBGCLKSTATE_Msk (0x800UL)                /*!< DBGCLKSTATE (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_CPUPWRCTRL_FCLKSTATE_Pos  (10UL)                    /*!< FCLKSTATE (Bit 10)                                    */
#define PWRCTRL_CPUPWRCTRL_FCLKSTATE_Msk  (0x400UL)                 /*!< FCLKSTATE (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_CPUPWRCTRL_PMUCLKSTATE_Pos (9UL)                    /*!< PMUCLKSTATE (Bit 9)                                   */
#define PWRCTRL_CPUPWRCTRL_PMUCLKSTATE_Msk (0x200UL)                /*!< PMUCLKSTATE (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_CPUPWRCTRL_IWICCLKSTATE_Pos (7UL)                   /*!< IWICCLKSTATE (Bit 7)                                  */
#define PWRCTRL_CPUPWRCTRL_IWICCLKSTATE_Msk (0x80UL)                /*!< IWICCLKSTATE (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_CPUPWRCTRL_CPUCLKOVREN_Pos (6UL)                    /*!< CPUCLKOVREN (Bit 6)                                   */
#define PWRCTRL_CPUPWRCTRL_CPUCLKOVREN_Msk (0x40UL)                 /*!< CPUCLKOVREN (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_CPUPWRCTRL_EPUPWRSTATE_Pos (4UL)                    /*!< EPUPWRSTATE (Bit 4)                                   */
#define PWRCTRL_CPUPWRCTRL_EPUPWRSTATE_Msk (0x30UL)                 /*!< EPUPWRSTATE (Bitfield-Mask: 0x03)                     */
#define PWRCTRL_CPUPWRCTRL_EPUMODEOVREN_Pos (3UL)                   /*!< EPUMODEOVREN (Bit 3)                                  */
#define PWRCTRL_CPUPWRCTRL_EPUMODEOVREN_Msk (0x8UL)                 /*!< EPUMODEOVREN (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_CPUPWRCTRL_SLEEPMODE_Pos  (2UL)                     /*!< SLEEPMODE (Bit 2)                                     */
#define PWRCTRL_CPUPWRCTRL_SLEEPMODE_Msk  (0x4UL)                   /*!< SLEEPMODE (Bitfield-Mask: 0x01)                       */
/* ===================================================  PWRCTRLMODESTATUS  =================================================== */
#define PWRCTRL_PWRCTRLMODESTATUS_LEGACYMODEST_Pos (0UL)            /*!< LEGACYMODEST (Bit 0)                                  */
#define PWRCTRL_PWRCTRLMODESTATUS_LEGACYMODEST_Msk (0x1UL)          /*!< LEGACYMODEST (Bitfield-Mask: 0x01)                    */
/* =====================================================  CPUPWRSTATUS  ====================================================== */
#define PWRCTRL_CPUPWRSTATUS_MEMRETNOCACHE_Pos (30UL)               /*!< MEMRETNOCACHE (Bit 30)                                */
#define PWRCTRL_CPUPWRSTATUS_MEMRETNOCACHE_Msk (0x40000000UL)       /*!< MEMRETNOCACHE (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_CPUPWRSTATUS_ONNOCACHE_Pos (29UL)                   /*!< ONNOCACHE (Bit 29)                                    */
#define PWRCTRL_CPUPWRSTATUS_ONNOCACHE_Msk (0x20000000UL)           /*!< ONNOCACHE (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_CPUPWRSTATUS_EPUOFFNOCACHE_Pos (28UL)               /*!< EPUOFFNOCACHE (Bit 28)                                */
#define PWRCTRL_CPUPWRSTATUS_EPUOFFNOCACHE_Msk (0x10000000UL)       /*!< EPUOFFNOCACHE (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_CPUPWRSTATUS_FUNCRETNOCACHE_Pos (27UL)              /*!< FUNCRETNOCACHE (Bit 27)                               */
#define PWRCTRL_CPUPWRSTATUS_FUNCRETNOCACHE_Msk (0x8000000UL)       /*!< FUNCRETNOCACHE (Bitfield-Mask: 0x01)                  */
#define PWRCTRL_CPUPWRSTATUS_LOGICRETNOCACHE_Pos (26UL)             /*!< LOGICRETNOCACHE (Bit 26)                              */
#define PWRCTRL_CPUPWRSTATUS_LOGICRETNOCACHE_Msk (0x4000000UL)      /*!< LOGICRETNOCACHE (Bitfield-Mask: 0x01)                 */
#define PWRCTRL_CPUPWRSTATUS_FULLRETNOCACHE_Pos (25UL)              /*!< FULLRETNOCACHE (Bit 25)                               */
#define PWRCTRL_CPUPWRSTATUS_FULLRETNOCACHE_Msk (0x2000000UL)       /*!< FULLRETNOCACHE (Bitfield-Mask: 0x01)                  */
#define PWRCTRL_CPUPWRSTATUS_MEMRETCACHE_Pos (24UL)                 /*!< MEMRETCACHE (Bit 24)                                  */
#define PWRCTRL_CPUPWRSTATUS_MEMRETCACHE_Msk (0x1000000UL)          /*!< MEMRETCACHE (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_CPUPWRSTATUS_ONCACHE_Pos  (23UL)                    /*!< ONCACHE (Bit 23)                                      */
#define PWRCTRL_CPUPWRSTATUS_ONCACHE_Msk  (0x800000UL)              /*!< ONCACHE (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_CPUPWRSTATUS_EPUOFFCACHE_Pos (22UL)                 /*!< EPUOFFCACHE (Bit 22)                                  */
#define PWRCTRL_CPUPWRSTATUS_EPUOFFCACHE_Msk (0x400000UL)           /*!< EPUOFFCACHE (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_CPUPWRSTATUS_FUNCRETCACHE_Pos (21UL)                /*!< FUNCRETCACHE (Bit 21)                                 */
#define PWRCTRL_CPUPWRSTATUS_FUNCRETCACHE_Msk (0x200000UL)          /*!< FUNCRETCACHE (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_CPUPWRSTATUS_LOGICRETCACHE_Pos (20UL)               /*!< LOGICRETCACHE (Bit 20)                                */
#define PWRCTRL_CPUPWRSTATUS_LOGICRETCACHE_Msk (0x100000UL)         /*!< LOGICRETCACHE (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_CPUPWRSTATUS_FULLRETCACHE_Pos (19UL)                /*!< FULLRETCACHE (Bit 19)                                 */
#define PWRCTRL_CPUPWRSTATUS_FULLRETCACHE_Msk (0x80000UL)           /*!< FULLRETCACHE (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_CPUPWRSTATUS_CPUHP_Pos    (3UL)                     /*!< CPUHP (Bit 3)                                         */
#define PWRCTRL_CPUPWRSTATUS_CPUHP_Msk    (0x8UL)                   /*!< CPUHP (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_CPUPWRSTATUS_CPULP_Pos    (2UL)                     /*!< CPULP (Bit 2)                                         */
#define PWRCTRL_CPUPWRSTATUS_CPULP_Msk    (0x4UL)                   /*!< CPULP (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_CPUPWRSTATUS_CPUAMBIQSLEEP_Pos (1UL)                /*!< CPUAMBIQSLEEP (Bit 1)                                 */
#define PWRCTRL_CPUPWRSTATUS_CPUAMBIQSLEEP_Msk (0x2UL)              /*!< CPUAMBIQSLEEP (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_CPUPWRSTATUS_CPUARMSLEEP_Pos (0UL)                  /*!< CPUARMSLEEP (Bit 0)                                   */
#define PWRCTRL_CPUPWRSTATUS_CPUARMSLEEP_Msk (0x1UL)                /*!< CPUARMSLEEP (Bitfield-Mask: 0x01)                     */
/* =======================================================  PWRACKOVR  ======================================================= */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI3_Pos (25UL)            /*!< PWRACKOVERRIDEMSPI3 (Bit 25)                          */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI3_Msk (0x2000000UL)     /*!< PWRACKOVERRIDEMSPI3 (Bitfield-Mask: 0x01)             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI2_Pos (24UL)            /*!< PWRACKOVERRIDEMSPI2 (Bit 24)                          */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI2_Msk (0x1000000UL)     /*!< PWRACKOVERRIDEMSPI2 (Bitfield-Mask: 0x01)             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI1_Pos (23UL)            /*!< PWRACKOVERRIDEMSPI1 (Bit 23)                          */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI1_Msk (0x800000UL)      /*!< PWRACKOVERRIDEMSPI1 (Bitfield-Mask: 0x01)             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI_Pos (22UL)             /*!< PWRACKOVERRIDEMSPI (Bit 22)                           */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI_Msk (0x400000UL)       /*!< PWRACKOVERRIDEMSPI (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEROM_Pos (21UL)              /*!< PWRACKOVERRIDEROM (Bit 21)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEROM_Msk (0x200000UL)        /*!< PWRACKOVERRIDEROM (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMCUE_Pos (20UL)             /*!< PWRACKOVERRIDEMCUE (Bit 20)                           */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMCUE_Msk (0x100000UL)       /*!< PWRACKOVERRIDEMCUE (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEOTP_Pos (19UL)              /*!< PWRACKOVERRIDEOTP (Bit 19)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEOTP_Msk (0x80000UL)         /*!< PWRACKOVERRIDEOTP (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDESDIO1_Pos (18UL)            /*!< PWRACKOVERRIDESDIO1 (Bit 18)                          */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDESDIO1_Msk (0x40000UL)       /*!< PWRACKOVERRIDESDIO1 (Bitfield-Mask: 0x01)             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEPDM_Pos (17UL)              /*!< PWRACKOVERRIDEPDM (Bit 17)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEPDM_Msk (0x20000UL)         /*!< PWRACKOVERRIDEPDM (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEUSBPHY_Pos (16UL)           /*!< PWRACKOVERRIDEUSBPHY (Bit 16)                         */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEUSBPHY_Msk (0x10000UL)      /*!< PWRACKOVERRIDEUSBPHY (Bitfield-Mask: 0x01)            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEUSB_Pos (15UL)              /*!< PWRACKOVERRIDEUSB (Bit 15)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEUSB_Msk (0x8000UL)          /*!< PWRACKOVERRIDEUSB (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDESDIO0_Pos (14UL)            /*!< PWRACKOVERRIDESDIO0 (Bit 14)                          */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDESDIO0_Msk (0x4000UL)        /*!< PWRACKOVERRIDESDIO0 (Bitfield-Mask: 0x01)             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMCUL_Pos (12UL)             /*!< PWRACKOVERRIDEMCUL (Bit 12)                           */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMCUL_Msk (0x1000UL)         /*!< PWRACKOVERRIDEMCUL (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEIOS_Pos (11UL)              /*!< PWRACKOVERRIDEIOS (Bit 11)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEIOS_Msk (0x800UL)           /*!< PWRACKOVERRIDEIOS (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPC_Pos (10UL)             /*!< PWRACKOVERRIDEHCPC (Bit 10)                           */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPC_Msk (0x400UL)          /*!< PWRACKOVERRIDEHCPC (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPB_Pos (9UL)              /*!< PWRACKOVERRIDEHCPB (Bit 9)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPB_Msk (0x200UL)          /*!< PWRACKOVERRIDEHCPB (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPA_Pos (8UL)              /*!< PWRACKOVERRIDEHCPA (Bit 8)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPA_Msk (0x100UL)          /*!< PWRACKOVERRIDEHCPA (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEGFX_Pos (7UL)               /*!< PWRACKOVERRIDEGFX (Bit 7)                             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEGFX_Msk (0x80UL)            /*!< PWRACKOVERRIDEGFX (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISPPHY_Pos (6UL)           /*!< PWRACKOVERRIDEDISPPHY (Bit 6)                         */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISPPHY_Msk (0x40UL)        /*!< PWRACKOVERRIDEDISPPHY (Bitfield-Mask: 0x01)           */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISP_Pos (5UL)              /*!< PWRACKOVERRIDEDISP (Bit 5)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISP_Msk (0x20UL)           /*!< PWRACKOVERRIDEDISP (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDBG_Pos (4UL)               /*!< PWRACKOVERRIDEDBG (Bit 4)                             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDBG_Msk (0x10UL)            /*!< PWRACKOVERRIDEDBG (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDECRYPTO_Pos (3UL)            /*!< PWRACKOVERRIDECRYPTO (Bit 3)                          */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDECRYPTO_Msk (0x8UL)          /*!< PWRACKOVERRIDECRYPTO (Bitfield-Mask: 0x01)            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUDADC_Pos (2UL)            /*!< PWRACKOVERRIDEAUDADC (Bit 2)                          */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUDADC_Msk (0x4UL)          /*!< PWRACKOVERRIDEAUDADC (Bitfield-Mask: 0x01)            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUD_Pos (1UL)               /*!< PWRACKOVERRIDEAUD (Bit 1)                             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUD_Msk (0x2UL)             /*!< PWRACKOVERRIDEAUD (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEADC_Pos (0UL)               /*!< PWRACKOVERRIDEADC (Bit 0)                             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEADC_Msk (0x1UL)             /*!< PWRACKOVERRIDEADC (Bitfield-Mask: 0x01)               */
/* =====================================================  PWRCNTDEFVAL  ====================================================== */
#define PWRCTRL_PWRCNTDEFVAL_PWRACKWAITDELSIMOSTMC_Pos (6UL)        /*!< PWRACKWAITDELSIMOSTMC (Bit 6)                         */
#define PWRCTRL_PWRCNTDEFVAL_PWRACKWAITDELSIMOSTMC_Msk (0xffc0UL)   /*!< PWRACKWAITDELSIMOSTMC (Bitfield-Mask: 0x3ff)          */
#define PWRCTRL_PWRCNTDEFVAL_PWRDEFVALDEVSTMC_Pos (0UL)             /*!< PWRDEFVALDEVSTMC (Bit 0)                              */
#define PWRCTRL_PWRCNTDEFVAL_PWRDEFVALDEVSTMC_Msk (0x3fUL)          /*!< PWRDEFVALDEVSTMC (Bitfield-Mask: 0x3f)                */
/* ======================================================  GFXPERFREQ  ======================================================= */
#define PWRCTRL_GFXPERFREQ_GFXPERFREQ_Pos (0UL)                     /*!< GFXPERFREQ (Bit 0)                                    */
#define PWRCTRL_GFXPERFREQ_GFXPERFREQ_Msk (0x3UL)                   /*!< GFXPERFREQ (Bitfield-Mask: 0x03)                      */
/* ======================================================  GFXPWRSWSEL  ====================================================== */
#define PWRCTRL_GFXPWRSWSEL_GFXVDDSEL_Pos (0UL)                     /*!< GFXVDDSEL (Bit 0)                                     */
#define PWRCTRL_GFXPWRSWSEL_GFXVDDSEL_Msk (0x1UL)                   /*!< GFXVDDSEL (Bitfield-Mask: 0x01)                       */
/* =======================================================  EPURETCFG  ======================================================= */
#define PWRCTRL_EPURETCFG_EPURETSLP_Pos   (0UL)                     /*!< EPURETSLP (Bit 0)                                     */
#define PWRCTRL_EPURETCFG_EPURETSLP_Msk   (0x1UL)                   /*!< EPURETSLP (Bitfield-Mask: 0x01)                       */
/* ========================================================  VRCTRL  ========================================================= */
#define PWRCTRL_VRCTRL_SIMOBUCKEN_Pos     (0UL)                     /*!< SIMOBUCKEN (Bit 0)                                    */
#define PWRCTRL_VRCTRL_SIMOBUCKEN_Msk     (0x1UL)                   /*!< SIMOBUCKEN (Bitfield-Mask: 0x01)                      */
