AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
#define SDIO0_CAPABILITIES0_ADMA2_Msk     (0x80000UL)               /*!< ADMA2 (Bitfield-Mask: 0x01)                           */
#define SDIO0_CAPABILITIES0_EXTMEDIA_Pos  (18UL)                    /*!< EXTMEDIA (Bit 18)                                     */
#define SDIO0_CAPABILITIES0_EXTMEDIA_Msk  (0x40000UL)               /*!< EXTMEDIA (Bitfield-Mask: 0x01)                        */
#define SDIO0_CAPABILITIES0_MAXBLKLEN_Pos (16UL)                    /*!< MAXBLKLEN (Bit 16)                                    */
#define SDIO0_CAPABILITIES0_MAXBLKLEN_Msk (0x30000UL)               /*!< MAXBLKLEN (Bitfield-Mask: 0x03)                       */
#define SDIO0_CAPABILITIES0_SDCLKFREQ_Pos (8UL)                     /*!< SDCLKFREQ (Bit 8)                                     */
#define SDIO0_CAPABILITIES0_SDCLKFREQ_Msk (0xff00UL)                /*!< SDCLKFREQ (Bitfield-Mask: 0xff)                       */
#define SDIO0_CAPABILITIES0_TOCLKUNIT_Pos (7UL)                     /*!< TOCLKUNIT (Bit 7)                                     */
#define SDIO0_CAPABILITIES0_TOCLKUNIT_Msk (0x80UL)                  /*!< TOCLKUNIT (Bitfield-Mask: 0x01)                       */
#define SDIO0_CAPABILITIES0_TOCLKFREQ_Pos (0UL)                     /*!< TOCLKFREQ (Bit 0)                                     */
#define SDIO0_CAPABILITIES0_TOCLKFREQ_Msk (0x3fUL)                  /*!< TOCLKFREQ (Bitfield-Mask: 0x3f)                       */
/* =====================================================  CAPABILITIES1  ===================================================== */
#define SDIO0_CAPABILITIES1_SPIBLOCKMODE_Pos (25UL)                 /*!< SPIBLOCKMODE (Bit 25)                                 */
#define SDIO0_CAPABILITIES1_SPIBLOCKMODE_Msk (0x2000000UL)          /*!< SPIBLOCKMODE (Bitfield-Mask: 0x01)                    */
#define SDIO0_CAPABILITIES1_SPIMODE_Pos   (24UL)                    /*!< SPIMODE (Bit 24)                                      */
#define SDIO0_CAPABILITIES1_SPIMODE_Msk   (0x1000000UL)             /*!< SPIMODE (Bitfield-Mask: 0x01)                         */
#define SDIO0_CAPABILITIES1_CLKMULT_Pos   (16UL)                    /*!< CLKMULT (Bit 16)                                      */
#define SDIO0_CAPABILITIES1_CLKMULT_Msk   (0xff0000UL)              /*!< CLKMULT (Bitfield-Mask: 0xff)                         */
#define SDIO0_CAPABILITIES1_RETUNINGMODES_Pos (14UL)                /*!< RETUNINGMODES (Bit 14)                                */
#define SDIO0_CAPABILITIES1_RETUNINGMODES_Msk (0xc000UL)            /*!< RETUNINGMODES (Bitfield-Mask: 0x03)                   */
#define SDIO0_CAPABILITIES1_TUNINGSDR50_Pos (13UL)                  /*!< TUNINGSDR50 (Bit 13)                                  */
#define SDIO0_CAPABILITIES1_TUNINGSDR50_Msk (0x2000UL)              /*!< TUNINGSDR50 (Bitfield-Mask: 0x01)                     */
#define SDIO0_CAPABILITIES1_RETUNINGTMRCNT_Pos (8UL)                /*!< RETUNINGTMRCNT (Bit 8)                                */
#define SDIO0_CAPABILITIES1_RETUNINGTMRCNT_Msk (0xf00UL)            /*!< RETUNINGTMRCNT (Bitfield-Mask: 0x0f)                  */
#define SDIO0_CAPABILITIES1_TYPED_Pos     (6UL)                     /*!< TYPED (Bit 6)                                         */
#define SDIO0_CAPABILITIES1_TYPED_Msk     (0x40UL)                  /*!< TYPED (Bitfield-Mask: 0x01)                           */
#define SDIO0_CAPABILITIES1_TYPEC_Pos     (5UL)                     /*!< TYPEC (Bit 5)                                         */
#define SDIO0_CAPABILITIES1_TYPEC_Msk     (0x20UL)                  /*!< TYPEC (Bitfield-Mask: 0x01)                           */
#define SDIO0_CAPABILITIES1_TYPEA_Pos     (4UL)                     /*!< TYPEA (Bit 4)                                         */
#define SDIO0_CAPABILITIES1_TYPEA_Msk     (0x10UL)                  /*!< TYPEA (Bitfield-Mask: 0x01)                           */
#define SDIO0_CAPABILITIES1_DDR50_Pos     (2UL)                     /*!< DDR50 (Bit 2)                                         */
#define SDIO0_CAPABILITIES1_DDR50_Msk     (0x4UL)                   /*!< DDR50 (Bitfield-Mask: 0x01)                           */
#define SDIO0_CAPABILITIES1_SDR104_Pos    (1UL)                     /*!< SDR104 (Bit 1)                                        */
#define SDIO0_CAPABILITIES1_SDR104_Msk    (0x2UL)                   /*!< SDR104 (Bitfield-Mask: 0x01)                          */
#define SDIO0_CAPABILITIES1_SDR50_Pos     (0UL)                     /*!< SDR50 (Bit 0)                                         */
#define SDIO0_CAPABILITIES1_SDR50_Msk     (0x1UL)                   /*!< SDR50 (Bitfield-Mask: 0x01)                           */
/* =======================================================  MAXIMUM0  ======================================================== */
#define SDIO0_MAXIMUM0_ALLBITSRSVD_Pos    (0UL)                     /*!< ALLBITSRSVD (Bit 0)                                   */
#define SDIO0_MAXIMUM0_ALLBITSRSVD_Msk    (0xffffffffUL)            /*!< ALLBITSRSVD (Bitfield-Mask: 0xffffffff)               */
/* =======================================================  MAXIMUM1  ======================================================== */
#define SDIO0_MAXIMUM1_MAXCURR18V_Pos     (16UL)                    /*!< MAXCURR18V (Bit 16)                                   */
#define SDIO0_MAXIMUM1_MAXCURR18V_Msk     (0xff0000UL)              /*!< MAXCURR18V (Bitfield-Mask: 0xff)                      */
#define SDIO0_MAXIMUM1_MAXCURR30V_Pos     (8UL)                     /*!< MAXCURR30V (Bit 8)                                    */
#define SDIO0_MAXIMUM1_MAXCURR30V_Msk     (0xff00UL)                /*!< MAXCURR30V (Bitfield-Mask: 0xff)                      */
#define SDIO0_MAXIMUM1_MAXCURR33V_Pos     (0UL)                     /*!< MAXCURR33V (Bit 0)                                    */
#define SDIO0_MAXIMUM1_MAXCURR33V_Msk     (0xffUL)                  /*!< MAXCURR33V (Bitfield-Mask: 0xff)                      */
/* =========================================================  FORCE  ========================================================= */
#define SDIO0_FORCE_FORCEADMAERR_Pos      (25UL)                    /*!< FORCEADMAERR (Bit 25)                                 */
#define SDIO0_FORCE_FORCEADMAERR_Msk      (0x2000000UL)             /*!< FORCEADMAERR (Bitfield-Mask: 0x01)                    */
#define SDIO0_FORCE_FORCEACMDERR_Pos      (24UL)                    /*!< FORCEACMDERR (Bit 24)                                 */
#define SDIO0_FORCE_FORCEACMDERR_Msk      (0x1000000UL)             /*!< FORCEACMDERR (Bitfield-Mask: 0x01)                    */
#define SDIO0_FORCE_FORCECURRLIMITERR_Pos (23UL)                    /*!< FORCECURRLIMITERR (Bit 23)                            */
#define SDIO0_FORCE_FORCECURRLIMITERR_Msk (0x800000UL)              /*!< FORCECURRLIMITERR (Bitfield-Mask: 0x01)               */
#define SDIO0_FORCE_FORCEDATAENDERR_Pos   (22UL)                    /*!< FORCEDATAENDERR (Bit 22)                              */
#define SDIO0_FORCE_FORCEDATAENDERR_Msk   (0x400000UL)              /*!< FORCEDATAENDERR (Bitfield-Mask: 0x01)                 */
#define SDIO0_FORCE_FORCEDATACRCERR_Pos   (21UL)                    /*!< FORCEDATACRCERR (Bit 21)                              */
#define SDIO0_FORCE_FORCEDATACRCERR_Msk   (0x200000UL)              /*!< FORCEDATACRCERR (Bitfield-Mask: 0x01)                 */
#define SDIO0_FORCE_FORCEDATATOERR_Pos    (20UL)                    /*!< FORCEDATATOERR (Bit 20)                               */
#define SDIO0_FORCE_FORCEDATATOERR_Msk    (0x100000UL)              /*!< FORCEDATATOERR (Bitfield-Mask: 0x01)                  */
#define SDIO0_FORCE_FORCECMDIDXERR_Pos    (19UL)                    /*!< FORCECMDIDXERR (Bit 19)                               */
#define SDIO0_FORCE_FORCECMDIDXERR_Msk    (0x80000UL)               /*!< FORCECMDIDXERR (Bitfield-Mask: 0x01)                  */
#define SDIO0_FORCE_FORCECMDENDERR_Pos    (18UL)                    /*!< FORCECMDENDERR (Bit 18)                               */
#define SDIO0_FORCE_FORCECMDENDERR_Msk    (0x40000UL)               /*!< FORCECMDENDERR (Bitfield-Mask: 0x01)                  */
#define SDIO0_FORCE_FORCECMDCRCERR_Pos    (17UL)                    /*!< FORCECMDCRCERR (Bit 17)                               */
#define SDIO0_FORCE_FORCECMDCRCERR_Msk    (0x20000UL)               /*!< FORCECMDCRCERR (Bitfield-Mask: 0x01)                  */
#define SDIO0_FORCE_FORCECMDTOERR_Pos     (16UL)                    /*!< FORCECMDTOERR (Bit 16)                                */
#define SDIO0_FORCE_FORCECMDTOERR_Msk     (0x10000UL)               /*!< FORCECMDTOERR (Bitfield-Mask: 0x01)                   */
#define SDIO0_FORCE_FORCEACMDISSUEDERR_Pos (7UL)                    /*!< FORCEACMDISSUEDERR (Bit 7)                            */
#define SDIO0_FORCE_FORCEACMDISSUEDERR_Msk (0x80UL)                 /*!< FORCEACMDISSUEDERR (Bitfield-Mask: 0x01)              */
#define SDIO0_FORCE_FORCEACMDIDXERR_Pos   (4UL)                     /*!< FORCEACMDIDXERR (Bit 4)                               */
#define SDIO0_FORCE_FORCEACMDIDXERR_Msk   (0x10UL)                  /*!< FORCEACMDIDXERR (Bitfield-Mask: 0x01)                 */
#define SDIO0_FORCE_FORCEACMDENDERR_Pos   (3UL)                     /*!< FORCEACMDENDERR (Bit 3)                               */
#define SDIO0_FORCE_FORCEACMDENDERR_Msk   (0x8UL)                   /*!< FORCEACMDENDERR (Bitfield-Mask: 0x01)                 */
#define SDIO0_FORCE_FORCEACMDCRCERR_Pos   (2UL)                     /*!< FORCEACMDCRCERR (Bit 2)                               */
#define SDIO0_FORCE_FORCEACMDCRCERR_Msk   (0x4UL)                   /*!< FORCEACMDCRCERR (Bitfield-Mask: 0x01)                 */
#define SDIO0_FORCE_FORCEACMDTOERR_Pos    (1UL)                     /*!< FORCEACMDTOERR (Bit 1)                                */
#define SDIO0_FORCE_FORCEACMDTOERR_Msk    (0x2UL)                   /*!< FORCEACMDTOERR (Bitfield-Mask: 0x01)                  */
#define SDIO0_FORCE_FORCEACMD12NOT_Pos    (0UL)                     /*!< FORCEACMD12NOT (Bit 0)                                */
#define SDIO0_FORCE_FORCEACMD12NOT_Msk    (0x1UL)                   /*!< FORCEACMD12NOT (Bitfield-Mask: 0x01)                  */
/* =========================================================  ADMA  ========================================================== */
#define SDIO0_ADMA_ADMALENMISMATCHERR_Pos (2UL)                     /*!< ADMALENMISMATCHERR (Bit 2)                            */
#define SDIO0_ADMA_ADMALENMISMATCHERR_Msk (0x4UL)                   /*!< ADMALENMISMATCHERR (Bitfield-Mask: 0x01)              */
#define SDIO0_ADMA_ADMAERRORSTATE_Pos     (0UL)                     /*!< ADMAERRORSTATE (Bit 0)                                */
#define SDIO0_ADMA_ADMAERRORSTATE_Msk     (0x3UL)                   /*!< ADMAERRORSTATE (Bitfield-Mask: 0x03)                  */
/* =======================================================  ADMALOWD  ======================================================== */
#define SDIO0_ADMALOWD_LOWD_Pos           (0UL)                     /*!< LOWD (Bit 0)                                          */
#define SDIO0_ADMALOWD_LOWD_Msk           (0xffffffffUL)            /*!< LOWD (Bitfield-Mask: 0xffffffff)                      */
/* =======================================================  ADMAHIWD  ======================================================== */
#define SDIO0_ADMAHIWD_HIWD_Pos           (0UL)                     /*!< HIWD (Bit 0)                                          */
#define SDIO0_ADMAHIWD_HIWD_Msk           (0xffffffffUL)            /*!< HIWD (Bitfield-Mask: 0xffffffff)                      */
/* ========================================================  PRESET0  ======================================================== */
#define SDIO0_PRESET0_DEFSPDRVRSTRSEL_Pos (30UL)                    /*!< DEFSPDRVRSTRSEL (Bit 30)                              */
#define SDIO0_PRESET0_DEFSPDRVRSTRSEL_Msk (0xc0000000UL)            /*!< DEFSPDRVRSTRSEL (Bitfield-Mask: 0x03)                 */
#define SDIO0_PRESET0_DEFSPCLKGENSEL_Pos  (26UL)                    /*!< DEFSPCLKGENSEL (Bit 26)                               */
#define SDIO0_PRESET0_DEFSPCLKGENSEL_Msk  (0x4000000UL)             /*!< DEFSPCLKGENSEL (Bitfield-Mask: 0x01)                  */
#define SDIO0_PRESET0_DEFSPSDCLKFREQSEL_Pos (16UL)                  /*!< DEFSPSDCLKFREQSEL (Bit 16)                            */
#define SDIO0_PRESET0_DEFSPSDCLKFREQSEL_Msk (0x3ff0000UL)           /*!< DEFSPSDCLKFREQSEL (Bitfield-Mask: 0x3ff)              */
#define SDIO0_PRESET0_HISPDRVRSTRSEL_Pos  (14UL)                    /*!< HISPDRVRSTRSEL (Bit 14)                               */
#define SDIO0_PRESET0_HISPDRVRSTRSEL_Msk  (0xc000UL)                /*!< HISPDRVRSTRSEL (Bitfield-Mask: 0x03)                  */
#define SDIO0_PRESET0_HISPCLKGENSEL_Pos   (10UL)                    /*!< HISPCLKGENSEL (Bit 10)                                */
#define SDIO0_PRESET0_HISPCLKGENSEL_Msk   (0x400UL)                 /*!< HISPCLKGENSEL (Bitfield-Mask: 0x01)                   */
#define SDIO0_PRESET0_HISPSDCLKFREQSEL_Pos (0UL)                    /*!< HISPSDCLKFREQSEL (Bit 0)                              */
#define SDIO0_PRESET0_HISPSDCLKFREQSEL_Msk (0x3ffUL)                /*!< HISPSDCLKFREQSEL (Bitfield-Mask: 0x3ff)               */
/* ========================================================  PRESET1  ======================================================== */
#define SDIO0_PRESET1_SDR12DRVRSTRSEL_Pos (30UL)                    /*!< SDR12DRVRSTRSEL (Bit 30)                              */
#define SDIO0_PRESET1_SDR12DRVRSTRSEL_Msk (0xc0000000UL)            /*!< SDR12DRVRSTRSEL (Bitfield-Mask: 0x03)                 */
#define SDIO0_PRESET1_SDR12CLKGENSEL_Pos  (26UL)                    /*!< SDR12CLKGENSEL (Bit 26)                               */
#define SDIO0_PRESET1_SDR12CLKGENSEL_Msk  (0x4000000UL)             /*!< SDR12CLKGENSEL (Bitfield-Mask: 0x01)                  */
#define SDIO0_PRESET1_SDR12SDCLKFREQSEL_Pos (16UL)                  /*!< SDR12SDCLKFREQSEL (Bit 16)                            */
#define SDIO0_PRESET1_SDR12SDCLKFREQSEL_Msk (0x3ff0000UL)           /*!< SDR12SDCLKFREQSEL (Bitfield-Mask: 0x3ff)              */
#define SDIO0_PRESET1_HSDRVRSTRSEL_Pos    (14UL)                    /*!< HSDRVRSTRSEL (Bit 14)                                 */
#define SDIO0_PRESET1_HSDRVRSTRSEL_Msk    (0xc000UL)                /*!< HSDRVRSTRSEL (Bitfield-Mask: 0x03)                    */
#define SDIO0_PRESET1_HSCLKGENSEL_Pos     (10UL)                    /*!< HSCLKGENSEL (Bit 10)                                  */
#define SDIO0_PRESET1_HSCLKGENSEL_Msk     (0x400UL)                 /*!< HSCLKGENSEL (Bitfield-Mask: 0x01)                     */
#define SDIO0_PRESET1_HSSDCLKFREQSEL_Pos  (0UL)                     /*!< HSSDCLKFREQSEL (Bit 0)                                */
#define SDIO0_PRESET1_HSSDCLKFREQSEL_Msk  (0x3ffUL)                 /*!< HSSDCLKFREQSEL (Bitfield-Mask: 0x3ff)                 */
/* ========================================================  PRESET2  ======================================================== */
#define SDIO0_PRESET2_SDR50DRVRSTRSEL_Pos (30UL)                    /*!< SDR50DRVRSTRSEL (Bit 30)                              */
#define SDIO0_PRESET2_SDR50DRVRSTRSEL_Msk (0xc0000000UL)            /*!< SDR50DRVRSTRSEL (Bitfield-Mask: 0x03)                 */
#define SDIO0_PRESET2_SDR50CLKGENSEL_Pos  (26UL)                    /*!< SDR50CLKGENSEL (Bit 26)                               */
#define SDIO0_PRESET2_SDR50CLKGENSEL_Msk  (0x4000000UL)             /*!< SDR50CLKGENSEL (Bitfield-Mask: 0x01)                  */
#define SDIO0_PRESET2_SDR50SDCLKFREQSEL_Pos (16UL)                  /*!< SDR50SDCLKFREQSEL (Bit 16)                            */
#define SDIO0_PRESET2_SDR50SDCLKFREQSEL_Msk (0x3ff0000UL)           /*!< SDR50SDCLKFREQSEL (Bitfield-Mask: 0x3ff)              */
#define SDIO0_PRESET2_SDR25DRVRSTRSEL_Pos (14UL)                    /*!< SDR25DRVRSTRSEL (Bit 14)                              */
#define SDIO0_PRESET2_SDR25DRVRSTRSEL_Msk (0xc000UL)                /*!< SDR25DRVRSTRSEL (Bitfield-Mask: 0x03)                 */
#define SDIO0_PRESET2_SDR25CLKGENSEL_Pos  (10UL)                    /*!< SDR25CLKGENSEL (Bit 10)                               */
#define SDIO0_PRESET2_SDR25CLKGENSEL_Msk  (0x400UL)                 /*!< SDR25CLKGENSEL (Bitfield-Mask: 0x01)                  */
#define SDIO0_PRESET2_SDR25SDCLKFREQSEL_Pos (0UL)                   /*!< SDR25SDCLKFREQSEL (Bit 0)                             */
#define SDIO0_PRESET2_SDR25SDCLKFREQSEL_Msk (0x3ffUL)               /*!< SDR25SDCLKFREQSEL (Bitfield-Mask: 0x3ff)              */
/* ========================================================  PRESET3  ======================================================== */
#define SDIO0_PRESET3_DDR50DRVRSTRSEL_Pos (30UL)                    /*!< DDR50DRVRSTRSEL (Bit 30)                              */
#define SDIO0_PRESET3_DDR50DRVRSTRSEL_Msk (0xc0000000UL)            /*!< DDR50DRVRSTRSEL (Bitfield-Mask: 0x03)                 */
#define SDIO0_PRESET3_DDR50CLKGENSEL_Pos  (26UL)                    /*!< DDR50CLKGENSEL (Bit 26)                               */
#define SDIO0_PRESET3_DDR50CLKGENSEL_Msk  (0x4000000UL)             /*!< DDR50CLKGENSEL (Bitfield-Mask: 0x01)                  */
#define SDIO0_PRESET3_DDR50SDCLKFREQSEL_Pos (16UL)                  /*!< DDR50SDCLKFREQSEL (Bit 16)                            */
#define SDIO0_PRESET3_DDR50SDCLKFREQSEL_Msk (0x3ff0000UL)           /*!< DDR50SDCLKFREQSEL (Bitfield-Mask: 0x3ff)              */
#define SDIO0_PRESET3_SDR104DRVRSTRSEL_Pos (14UL)                   /*!< SDR104DRVRSTRSEL (Bit 14)                             */
#define SDIO0_PRESET3_SDR104DRVRSTRSEL_Msk (0xc000UL)               /*!< SDR104DRVRSTRSEL (Bitfield-Mask: 0x03)                */
#define SDIO0_PRESET3_SDR104CLKGENSEL_Pos (10UL)                    /*!< SDR104CLKGENSEL (Bit 10)                              */
#define SDIO0_PRESET3_SDR104CLKGENSEL_Msk (0x400UL)                 /*!< SDR104CLKGENSEL (Bitfield-Mask: 0x01)                 */
#define SDIO0_PRESET3_SDR104SDCLKFREQSEL_Pos (0UL)                  /*!< SDR104SDCLKFREQSEL (Bit 0)                            */
#define SDIO0_PRESET3_SDR104SDCLKFREQSEL_Msk (0x3ffUL)              /*!< SDR104SDCLKFREQSEL (Bitfield-Mask: 0x3ff)             */
/* ======================================================  BOOTTOCTRL  ======================================================= */
#define SDIO0_BOOTTOCTRL_BOOTDATATO_Pos   (0UL)                     /*!< BOOTDATATO (Bit 0)                                    */
#define SDIO0_BOOTTOCTRL_BOOTDATATO_Msk   (0xffffffffUL)            /*!< BOOTDATATO (Bitfield-Mask: 0xffffffff)                */
/* ========================================================  VENDOR  ========================================================= */
#define SDIO0_VENDOR_DLYDIS_Pos           (1UL)                     /*!< DLYDIS (Bit 1)                                        */
#define SDIO0_VENDOR_DLYDIS_Msk           (0x2UL)                   /*!< DLYDIS (Bitfield-Mask: 0x01)                          */
#define SDIO0_VENDOR_GATESDCLKEN_Pos      (0UL)                     /*!< GATESDCLKEN (Bit 0)                                   */
#define SDIO0_VENDOR_GATESDCLKEN_Msk      (0x1UL)                   /*!< GATESDCLKEN (Bitfield-Mask: 0x01)                     */
/* =======================================================  SLOTSTAT  ======================================================== */
#define SDIO0_SLOTSTAT_VENDORVER_Pos      (24UL)                    /*!< VENDORVER (Bit 24)                                    */
#define SDIO0_SLOTSTAT_VENDORVER_Msk      (0xff000000UL)            /*!< VENDORVER (Bitfield-Mask: 0xff)                       */
#define SDIO0_SLOTSTAT_SPECVER_Pos        (16UL)                    /*!< SPECVER (Bit 16)                                      */
#define SDIO0_SLOTSTAT_SPECVER_Msk        (0xff0000UL)              /*!< SPECVER (Bitfield-Mask: 0xff)                         */
#define SDIO0_SLOTSTAT_INTSLOT0_Pos       (0UL)                     /*!< INTSLOT0 (Bit 0)                                      */
#define SDIO0_SLOTSTAT_INTSLOT0_Msk       (0x1UL)                   /*!< INTSLOT0 (Bitfield-Mask: 0x01)                        */
/* =======================================================  CLKOUTCFG  ======================================================= */
#define SDIO0_CLKOUTCFG_WIDEN_Pos         (4UL)                     /*!< WIDEN (Bit 4)                                         */
#define SDIO0_CLKOUTCFG_WIDEN_Msk         (0x10UL)                  /*!< WIDEN (Bitfield-Mask: 0x01)                           */
#define SDIO0_CLKOUTCFG_STEP_Pos          (0UL)                     /*!< STEP (Bit 0)                                          */
#define SDIO0_CLKOUTCFG_STEP_Msk          (0xfUL)                   /*!< STEP (Bitfield-Mask: 0x0f)                            */


/* =========================================================================================================================== */
/* ================                                         SECURITY                                          ================ */
/* =========================================================================================================================== */

