AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* =====================================================  ADMACMPINTEN  ====================================================== */
#define USB_ADMACMPINTEN_ADMACMP9_Pos     (9UL)                     /*!< ADMACMP9 (Bit 9)                                      */
#define USB_ADMACMPINTEN_ADMACMP9_Msk     (0x200UL)                 /*!< ADMACMP9 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTEN_ADMACMP8_Pos     (8UL)                     /*!< ADMACMP8 (Bit 8)                                      */
#define USB_ADMACMPINTEN_ADMACMP8_Msk     (0x100UL)                 /*!< ADMACMP8 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTEN_ADMACMP7_Pos     (7UL)                     /*!< ADMACMP7 (Bit 7)                                      */
#define USB_ADMACMPINTEN_ADMACMP7_Msk     (0x80UL)                  /*!< ADMACMP7 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTEN_ADMACMP6_Pos     (6UL)                     /*!< ADMACMP6 (Bit 6)                                      */
#define USB_ADMACMPINTEN_ADMACMP6_Msk     (0x40UL)                  /*!< ADMACMP6 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTEN_ADMACMP5_Pos     (5UL)                     /*!< ADMACMP5 (Bit 5)                                      */
#define USB_ADMACMPINTEN_ADMACMP5_Msk     (0x20UL)                  /*!< ADMACMP5 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTEN_ADMACMP4_Pos     (4UL)                     /*!< ADMACMP4 (Bit 4)                                      */
#define USB_ADMACMPINTEN_ADMACMP4_Msk     (0x10UL)                  /*!< ADMACMP4 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTEN_ADMACMP3_Pos     (3UL)                     /*!< ADMACMP3 (Bit 3)                                      */
#define USB_ADMACMPINTEN_ADMACMP3_Msk     (0x8UL)                   /*!< ADMACMP3 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTEN_ADMACMP2_Pos     (2UL)                     /*!< ADMACMP2 (Bit 2)                                      */
#define USB_ADMACMPINTEN_ADMACMP2_Msk     (0x4UL)                   /*!< ADMACMP2 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTEN_ADMACMP1_Pos     (1UL)                     /*!< ADMACMP1 (Bit 1)                                      */
#define USB_ADMACMPINTEN_ADMACMP1_Msk     (0x2UL)                   /*!< ADMACMP1 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTEN_ADMACMP0_Pos     (0UL)                     /*!< ADMACMP0 (Bit 0)                                      */
#define USB_ADMACMPINTEN_ADMACMP0_Msk     (0x1UL)                   /*!< ADMACMP0 (Bitfield-Mask: 0x01)                        */
/* ====================================================  ADMACMPINTSTAT  ===================================================== */
#define USB_ADMACMPINTSTAT_ADMACMP9_Pos   (9UL)                     /*!< ADMACMP9 (Bit 9)                                      */
#define USB_ADMACMPINTSTAT_ADMACMP9_Msk   (0x200UL)                 /*!< ADMACMP9 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSTAT_ADMACMP8_Pos   (8UL)                     /*!< ADMACMP8 (Bit 8)                                      */
#define USB_ADMACMPINTSTAT_ADMACMP8_Msk   (0x100UL)                 /*!< ADMACMP8 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSTAT_ADMACMP7_Pos   (7UL)                     /*!< ADMACMP7 (Bit 7)                                      */
#define USB_ADMACMPINTSTAT_ADMACMP7_Msk   (0x80UL)                  /*!< ADMACMP7 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSTAT_ADMACMP6_Pos   (6UL)                     /*!< ADMACMP6 (Bit 6)                                      */
#define USB_ADMACMPINTSTAT_ADMACMP6_Msk   (0x40UL)                  /*!< ADMACMP6 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSTAT_ADMACMP5_Pos   (5UL)                     /*!< ADMACMP5 (Bit 5)                                      */
#define USB_ADMACMPINTSTAT_ADMACMP5_Msk   (0x20UL)                  /*!< ADMACMP5 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSTAT_ADMACMP4_Pos   (4UL)                     /*!< ADMACMP4 (Bit 4)                                      */
#define USB_ADMACMPINTSTAT_ADMACMP4_Msk   (0x10UL)                  /*!< ADMACMP4 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSTAT_ADMACMP3_Pos   (3UL)                     /*!< ADMACMP3 (Bit 3)                                      */
#define USB_ADMACMPINTSTAT_ADMACMP3_Msk   (0x8UL)                   /*!< ADMACMP3 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSTAT_ADMACMP2_Pos   (2UL)                     /*!< ADMACMP2 (Bit 2)                                      */
#define USB_ADMACMPINTSTAT_ADMACMP2_Msk   (0x4UL)                   /*!< ADMACMP2 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSTAT_ADMACMP1_Pos   (1UL)                     /*!< ADMACMP1 (Bit 1)                                      */
#define USB_ADMACMPINTSTAT_ADMACMP1_Msk   (0x2UL)                   /*!< ADMACMP1 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSTAT_ADMACMP0_Pos   (0UL)                     /*!< ADMACMP0 (Bit 0)                                      */
#define USB_ADMACMPINTSTAT_ADMACMP0_Msk   (0x1UL)                   /*!< ADMACMP0 (Bitfield-Mask: 0x01)                        */
/* =====================================================  ADMACMPINTCLR  ===================================================== */
#define USB_ADMACMPINTCLR_ADMACMP9_Pos    (9UL)                     /*!< ADMACMP9 (Bit 9)                                      */
#define USB_ADMACMPINTCLR_ADMACMP9_Msk    (0x200UL)                 /*!< ADMACMP9 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTCLR_ADMACMP8_Pos    (8UL)                     /*!< ADMACMP8 (Bit 8)                                      */
#define USB_ADMACMPINTCLR_ADMACMP8_Msk    (0x100UL)                 /*!< ADMACMP8 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTCLR_ADMACMP7_Pos    (7UL)                     /*!< ADMACMP7 (Bit 7)                                      */
#define USB_ADMACMPINTCLR_ADMACMP7_Msk    (0x80UL)                  /*!< ADMACMP7 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTCLR_ADMACMP6_Pos    (6UL)                     /*!< ADMACMP6 (Bit 6)                                      */
#define USB_ADMACMPINTCLR_ADMACMP6_Msk    (0x40UL)                  /*!< ADMACMP6 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTCLR_ADMACMP5_Pos    (5UL)                     /*!< ADMACMP5 (Bit 5)                                      */
#define USB_ADMACMPINTCLR_ADMACMP5_Msk    (0x20UL)                  /*!< ADMACMP5 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTCLR_ADMACMP4_Pos    (4UL)                     /*!< ADMACMP4 (Bit 4)                                      */
#define USB_ADMACMPINTCLR_ADMACMP4_Msk    (0x10UL)                  /*!< ADMACMP4 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTCLR_ADMACMP3_Pos    (3UL)                     /*!< ADMACMP3 (Bit 3)                                      */
#define USB_ADMACMPINTCLR_ADMACMP3_Msk    (0x8UL)                   /*!< ADMACMP3 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTCLR_ADMACMP2_Pos    (2UL)                     /*!< ADMACMP2 (Bit 2)                                      */
#define USB_ADMACMPINTCLR_ADMACMP2_Msk    (0x4UL)                   /*!< ADMACMP2 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTCLR_ADMACMP1_Pos    (1UL)                     /*!< ADMACMP1 (Bit 1)                                      */
#define USB_ADMACMPINTCLR_ADMACMP1_Msk    (0x2UL)                   /*!< ADMACMP1 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTCLR_ADMACMP0_Pos    (0UL)                     /*!< ADMACMP0 (Bit 0)                                      */
#define USB_ADMACMPINTCLR_ADMACMP0_Msk    (0x1UL)                   /*!< ADMACMP0 (Bitfield-Mask: 0x01)                        */
/* =====================================================  ADMACMPINTSET  ===================================================== */
#define USB_ADMACMPINTSET_ADMACMP9_Pos    (9UL)                     /*!< ADMACMP9 (Bit 9)                                      */
#define USB_ADMACMPINTSET_ADMACMP9_Msk    (0x200UL)                 /*!< ADMACMP9 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSET_ADMACMP8_Pos    (8UL)                     /*!< ADMACMP8 (Bit 8)                                      */
#define USB_ADMACMPINTSET_ADMACMP8_Msk    (0x100UL)                 /*!< ADMACMP8 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSET_ADMACMP7_Pos    (7UL)                     /*!< ADMACMP7 (Bit 7)                                      */
#define USB_ADMACMPINTSET_ADMACMP7_Msk    (0x80UL)                  /*!< ADMACMP7 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSET_ADMACMP6_Pos    (6UL)                     /*!< ADMACMP6 (Bit 6)                                      */
#define USB_ADMACMPINTSET_ADMACMP6_Msk    (0x40UL)                  /*!< ADMACMP6 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSET_ADMACMP5_Pos    (5UL)                     /*!< ADMACMP5 (Bit 5)                                      */
#define USB_ADMACMPINTSET_ADMACMP5_Msk    (0x20UL)                  /*!< ADMACMP5 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSET_ADMACMP4_Pos    (4UL)                     /*!< ADMACMP4 (Bit 4)                                      */
#define USB_ADMACMPINTSET_ADMACMP4_Msk    (0x10UL)                  /*!< ADMACMP4 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSET_ADMACMP3_Pos    (3UL)                     /*!< ADMACMP3 (Bit 3)                                      */
#define USB_ADMACMPINTSET_ADMACMP3_Msk    (0x8UL)                   /*!< ADMACMP3 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSET_ADMACMP2_Pos    (2UL)                     /*!< ADMACMP2 (Bit 2)                                      */
#define USB_ADMACMPINTSET_ADMACMP2_Msk    (0x4UL)                   /*!< ADMACMP2 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSET_ADMACMP1_Pos    (1UL)                     /*!< ADMACMP1 (Bit 1)                                      */
#define USB_ADMACMPINTSET_ADMACMP1_Msk    (0x2UL)                   /*!< ADMACMP1 (Bitfield-Mask: 0x01)                        */
#define USB_ADMACMPINTSET_ADMACMP0_Pos    (0UL)                     /*!< ADMACMP0 (Bit 0)                                      */
#define USB_ADMACMPINTSET_ADMACMP0_Msk    (0x1UL)                   /*!< ADMACMP0 (Bitfield-Mask: 0x01)                        */
/* =====================================================  ADMAERRINTEN  ====================================================== */
#define USB_ADMAERRINTEN_ADMAERR9_Pos     (9UL)                     /*!< ADMAERR9 (Bit 9)                                      */
#define USB_ADMAERRINTEN_ADMAERR9_Msk     (0x200UL)                 /*!< ADMAERR9 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTEN_ADMAERR8_Pos     (8UL)                     /*!< ADMAERR8 (Bit 8)                                      */
#define USB_ADMAERRINTEN_ADMAERR8_Msk     (0x100UL)                 /*!< ADMAERR8 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTEN_ADMAERR7_Pos     (7UL)                     /*!< ADMAERR7 (Bit 7)                                      */
#define USB_ADMAERRINTEN_ADMAERR7_Msk     (0x80UL)                  /*!< ADMAERR7 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTEN_ADMAERR6_Pos     (6UL)                     /*!< ADMAERR6 (Bit 6)                                      */
#define USB_ADMAERRINTEN_ADMAERR6_Msk     (0x40UL)                  /*!< ADMAERR6 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTEN_ADMAERR5_Pos     (5UL)                     /*!< ADMAERR5 (Bit 5)                                      */
#define USB_ADMAERRINTEN_ADMAERR5_Msk     (0x20UL)                  /*!< ADMAERR5 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTEN_ADMAERR4_Pos     (4UL)                     /*!< ADMAERR4 (Bit 4)                                      */
#define USB_ADMAERRINTEN_ADMAERR4_Msk     (0x10UL)                  /*!< ADMAERR4 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTEN_ADMAERR3_Pos     (3UL)                     /*!< ADMAERR3 (Bit 3)                                      */
#define USB_ADMAERRINTEN_ADMAERR3_Msk     (0x8UL)                   /*!< ADMAERR3 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTEN_ADMAERR2_Pos     (2UL)                     /*!< ADMAERR2 (Bit 2)                                      */
#define USB_ADMAERRINTEN_ADMAERR2_Msk     (0x4UL)                   /*!< ADMAERR2 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTEN_ADMAERR1_Pos     (1UL)                     /*!< ADMAERR1 (Bit 1)                                      */
#define USB_ADMAERRINTEN_ADMAERR1_Msk     (0x2UL)                   /*!< ADMAERR1 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTEN_ADMAERR0_Pos     (0UL)                     /*!< ADMAERR0 (Bit 0)                                      */
#define USB_ADMAERRINTEN_ADMAERR0_Msk     (0x1UL)                   /*!< ADMAERR0 (Bitfield-Mask: 0x01)                        */
/* ====================================================  ADMAERRINTSTAT  ===================================================== */
#define USB_ADMAERRINTSTAT_ADMAERR9_Pos   (9UL)                     /*!< ADMAERR9 (Bit 9)                                      */
#define USB_ADMAERRINTSTAT_ADMAERR9_Msk   (0x200UL)                 /*!< ADMAERR9 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSTAT_ADMAERR8_Pos   (8UL)                     /*!< ADMAERR8 (Bit 8)                                      */
#define USB_ADMAERRINTSTAT_ADMAERR8_Msk   (0x100UL)                 /*!< ADMAERR8 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSTAT_ADMAERR7_Pos   (7UL)                     /*!< ADMAERR7 (Bit 7)                                      */
#define USB_ADMAERRINTSTAT_ADMAERR7_Msk   (0x80UL)                  /*!< ADMAERR7 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSTAT_ADMAERR6_Pos   (6UL)                     /*!< ADMAERR6 (Bit 6)                                      */
#define USB_ADMAERRINTSTAT_ADMAERR6_Msk   (0x40UL)                  /*!< ADMAERR6 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSTAT_ADMAERR5_Pos   (5UL)                     /*!< ADMAERR5 (Bit 5)                                      */
#define USB_ADMAERRINTSTAT_ADMAERR5_Msk   (0x20UL)                  /*!< ADMAERR5 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSTAT_ADMAERR4_Pos   (4UL)                     /*!< ADMAERR4 (Bit 4)                                      */
#define USB_ADMAERRINTSTAT_ADMAERR4_Msk   (0x10UL)                  /*!< ADMAERR4 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSTAT_ADMAERR3_Pos   (3UL)                     /*!< ADMAERR3 (Bit 3)                                      */
#define USB_ADMAERRINTSTAT_ADMAERR3_Msk   (0x8UL)                   /*!< ADMAERR3 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSTAT_ADMAERR2_Pos   (2UL)                     /*!< ADMAERR2 (Bit 2)                                      */
#define USB_ADMAERRINTSTAT_ADMAERR2_Msk   (0x4UL)                   /*!< ADMAERR2 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSTAT_ADMAERR1_Pos   (1UL)                     /*!< ADMAERR1 (Bit 1)                                      */
#define USB_ADMAERRINTSTAT_ADMAERR1_Msk   (0x2UL)                   /*!< ADMAERR1 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSTAT_ADMAERR0_Pos   (0UL)                     /*!< ADMAERR0 (Bit 0)                                      */
#define USB_ADMAERRINTSTAT_ADMAERR0_Msk   (0x1UL)                   /*!< ADMAERR0 (Bitfield-Mask: 0x01)                        */
/* =====================================================  ADMAERRINTCLR  ===================================================== */
#define USB_ADMAERRINTCLR_ADMAERR9_Pos    (9UL)                     /*!< ADMAERR9 (Bit 9)                                      */
#define USB_ADMAERRINTCLR_ADMAERR9_Msk    (0x200UL)                 /*!< ADMAERR9 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTCLR_ADMAERR8_Pos    (8UL)                     /*!< ADMAERR8 (Bit 8)                                      */
#define USB_ADMAERRINTCLR_ADMAERR8_Msk    (0x100UL)                 /*!< ADMAERR8 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTCLR_ADMAERR7_Pos    (7UL)                     /*!< ADMAERR7 (Bit 7)                                      */
#define USB_ADMAERRINTCLR_ADMAERR7_Msk    (0x80UL)                  /*!< ADMAERR7 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTCLR_ADMAERR6_Pos    (6UL)                     /*!< ADMAERR6 (Bit 6)                                      */
#define USB_ADMAERRINTCLR_ADMAERR6_Msk    (0x40UL)                  /*!< ADMAERR6 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTCLR_ADMAERR5_Pos    (5UL)                     /*!< ADMAERR5 (Bit 5)                                      */
#define USB_ADMAERRINTCLR_ADMAERR5_Msk    (0x20UL)                  /*!< ADMAERR5 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTCLR_ADMAERR4_Pos    (4UL)                     /*!< ADMAERR4 (Bit 4)                                      */
#define USB_ADMAERRINTCLR_ADMAERR4_Msk    (0x10UL)                  /*!< ADMAERR4 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTCLR_ADMAERR3_Pos    (3UL)                     /*!< ADMAERR3 (Bit 3)                                      */
#define USB_ADMAERRINTCLR_ADMAERR3_Msk    (0x8UL)                   /*!< ADMAERR3 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTCLR_ADMAERR2_Pos    (2UL)                     /*!< ADMAERR2 (Bit 2)                                      */
#define USB_ADMAERRINTCLR_ADMAERR2_Msk    (0x4UL)                   /*!< ADMAERR2 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTCLR_ADMAERR1_Pos    (1UL)                     /*!< ADMAERR1 (Bit 1)                                      */
#define USB_ADMAERRINTCLR_ADMAERR1_Msk    (0x2UL)                   /*!< ADMAERR1 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTCLR_ADMAERR0_Pos    (0UL)                     /*!< ADMAERR0 (Bit 0)                                      */
#define USB_ADMAERRINTCLR_ADMAERR0_Msk    (0x1UL)                   /*!< ADMAERR0 (Bitfield-Mask: 0x01)                        */
/* =====================================================  ADMAERRINTSET  ===================================================== */
#define USB_ADMAERRINTSET_ADMAERR9_Pos    (9UL)                     /*!< ADMAERR9 (Bit 9)                                      */
#define USB_ADMAERRINTSET_ADMAERR9_Msk    (0x200UL)                 /*!< ADMAERR9 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSET_ADMAERR8_Pos    (8UL)                     /*!< ADMAERR8 (Bit 8)                                      */
#define USB_ADMAERRINTSET_ADMAERR8_Msk    (0x100UL)                 /*!< ADMAERR8 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSET_ADMAERR7_Pos    (7UL)                     /*!< ADMAERR7 (Bit 7)                                      */
#define USB_ADMAERRINTSET_ADMAERR7_Msk    (0x80UL)                  /*!< ADMAERR7 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSET_ADMAERR6_Pos    (6UL)                     /*!< ADMAERR6 (Bit 6)                                      */
#define USB_ADMAERRINTSET_ADMAERR6_Msk    (0x40UL)                  /*!< ADMAERR6 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSET_ADMAERR5_Pos    (5UL)                     /*!< ADMAERR5 (Bit 5)                                      */
#define USB_ADMAERRINTSET_ADMAERR5_Msk    (0x20UL)                  /*!< ADMAERR5 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSET_ADMAERR4_Pos    (4UL)                     /*!< ADMAERR4 (Bit 4)                                      */
#define USB_ADMAERRINTSET_ADMAERR4_Msk    (0x10UL)                  /*!< ADMAERR4 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSET_ADMAERR3_Pos    (3UL)                     /*!< ADMAERR3 (Bit 3)                                      */
#define USB_ADMAERRINTSET_ADMAERR3_Msk    (0x8UL)                   /*!< ADMAERR3 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSET_ADMAERR2_Pos    (2UL)                     /*!< ADMAERR2 (Bit 2)                                      */
#define USB_ADMAERRINTSET_ADMAERR2_Msk    (0x4UL)                   /*!< ADMAERR2 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSET_ADMAERR1_Pos    (1UL)                     /*!< ADMAERR1 (Bit 1)                                      */
#define USB_ADMAERRINTSET_ADMAERR1_Msk    (0x2UL)                   /*!< ADMAERR1 (Bitfield-Mask: 0x01)                        */
#define USB_ADMAERRINTSET_ADMAERR0_Pos    (0UL)                     /*!< ADMAERR0 (Bit 0)                                      */
#define USB_ADMAERRINTSET_ADMAERR0_Msk    (0x1UL)                   /*!< ADMAERR0 (Bitfield-Mask: 0x01)                        */
/* =====================================================  ADMATOTCOUNT0  ===================================================== */
#define USB_ADMATOTCOUNT0_ADMATOTCOUNT0_Pos (0UL)                   /*!< ADMATOTCOUNT0 (Bit 0)                                 */
#define USB_ADMATOTCOUNT0_ADMATOTCOUNT0_Msk (0xffffffUL)            /*!< ADMATOTCOUNT0 (Bitfield-Mask: 0xffffff)               */
/* =====================================================  ADMATOTCOUNT1  ===================================================== */
#define USB_ADMATOTCOUNT1_ADMATOTCOUNT1_Pos (0UL)                   /*!< ADMATOTCOUNT1 (Bit 0)                                 */
#define USB_ADMATOTCOUNT1_ADMATOTCOUNT1_Msk (0xffffffUL)            /*!< ADMATOTCOUNT1 (Bitfield-Mask: 0xffffff)               */
/* =====================================================  ADMATOTCOUNT2  ===================================================== */
#define USB_ADMATOTCOUNT2_ADMATOTCOUNT2_Pos (0UL)                   /*!< ADMATOTCOUNT2 (Bit 0)                                 */
#define USB_ADMATOTCOUNT2_ADMATOTCOUNT2_Msk (0xffffffUL)            /*!< ADMATOTCOUNT2 (Bitfield-Mask: 0xffffff)               */
/* =====================================================  ADMATOTCOUNT3  ===================================================== */
#define USB_ADMATOTCOUNT3_ADMATOTCOUNT3_Pos (0UL)                   /*!< ADMATOTCOUNT3 (Bit 0)                                 */
#define USB_ADMATOTCOUNT3_ADMATOTCOUNT3_Msk (0xffffffUL)            /*!< ADMATOTCOUNT3 (Bitfield-Mask: 0xffffff)               */
/* =====================================================  ADMATOTCOUNT4  ===================================================== */
#define USB_ADMATOTCOUNT4_ADMATOTCOUNT4_Pos (0UL)                   /*!< ADMATOTCOUNT4 (Bit 0)                                 */
#define USB_ADMATOTCOUNT4_ADMATOTCOUNT4_Msk (0xffffffUL)            /*!< ADMATOTCOUNT4 (Bitfield-Mask: 0xffffff)               */
/* =====================================================  ADMATOTCOUNT5  ===================================================== */
