AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ==============================================  AUDADC INTSET CNVCMP [0..0]  ============================================== */
typedef enum {                                  /*!< AUDADC_INTSET_CNVCMP                                                      */
  AUDADC_INTSET_CNVCMP_CNVCMPINT       = 1,     /*!< CNVCMPINT : ADC conversion complete interrupt.                            */
  AUDADC_INTSET_CNVCMP_CNVCMPNOINT     = 0,     /*!< CNVCMPNOINT : No ADC conversion complete interrupt.                       */
} AUDADC_INTSET_CNVCMP_Enum;

/* =======================================================  DMATRIGEN  ======================================================= */
/* ======================================================  DMATRIGSTAT  ====================================================== */
/* ========================================================  DMACFG  ========================================================= */
/* ============================================  AUDADC DMACFG DMADYNPRI [9..9]  ============================================= */
typedef enum {                                  /*!< AUDADC_DMACFG_DMADYNPRI                                                   */
  AUDADC_DMACFG_DMADYNPRI_DIS          = 0,     /*!< DIS : Disable dynamic priority (use DMAPRI setting only)                  */
  AUDADC_DMACFG_DMADYNPRI_EN           = 1,     /*!< EN : Enable dynamic priority                                              */
} AUDADC_DMACFG_DMADYNPRI_Enum;

/* ==============================================  AUDADC DMACFG DMAPRI [8..8]  ============================================== */
typedef enum {                                  /*!< AUDADC_DMACFG_DMAPRI                                                      */
  AUDADC_DMACFG_DMAPRI_LOW             = 0,     /*!< LOW : Low Priority (service as best effort)                               */
  AUDADC_DMACFG_DMAPRI_HIGH            = 1,     /*!< HIGH : High Priority (service immediately)                                */
} AUDADC_DMACFG_DMAPRI_Enum;

/* ==============================================  AUDADC DMACFG DMADIR [2..2]  ============================================== */
typedef enum {                                  /*!< AUDADC_DMACFG_DMADIR                                                      */
  AUDADC_DMACFG_DMADIR_P2M             = 0,     /*!< P2M : Peripheral to Memory (SRAM) transaction                             */
  AUDADC_DMACFG_DMADIR_M2P             = 1,     /*!< M2P : Memory to Peripheral transaction                                    */
} AUDADC_DMACFG_DMADIR_Enum;

/* ==============================================  AUDADC DMACFG DMAEN [0..0]  =============================================== */
typedef enum {                                  /*!< AUDADC_DMACFG_DMAEN                                                       */
  AUDADC_DMACFG_DMAEN_DIS              = 0,     /*!< DIS : Disable DMA Function                                                */
  AUDADC_DMACFG_DMAEN_EN               = 1,     /*!< EN : Enable DMA Function                                                  */
} AUDADC_DMACFG_DMAEN_Enum;

/* ======================================================  DMATOTCOUNT  ====================================================== */
/* ======================================================  DMATARGADDR  ====================================================== */
/* ========================================================  DMASTAT  ======================================================== */
/* ====================================================  DMATARGADDRNEXT  ==================================================== */
/* ====================================================  DMATOTCOUNTNEXT  ==================================================== */
/* =====================================================  DMAENNEXTCTRL  ===================================================== */


/* =========================================================================================================================== */
/* ================                                          CLKGEN                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  OCTRL  ========================================================= */
/* ===============================================  CLKGEN OCTRL OSEL [7..7]  ================================================ */
typedef enum {                                  /*!< CLKGEN_OCTRL_OSEL                                                         */
  CLKGEN_OCTRL_OSEL_XT_512Hz           = 0,     /*!< XT_512Hz : RTC uses the XT 512Hz                                          */
  CLKGEN_OCTRL_OSEL_LFRC_DIV2          = 1,     /*!< LFRC_DIV2 : RTC uses the LFRC / 2                                         */
} CLKGEN_OCTRL_OSEL_Enum;

/* ========================================================  CLKOUT  ========================================================= */
/* ===============================================  CLKGEN CLKOUT CKEN [7..7]  =============================================== */
typedef enum {                                  /*!< CLKGEN_CLKOUT_CKEN                                                        */
  CLKGEN_CLKOUT_CKEN_DIS               = 0,     /*!< DIS : Disable CLKOUT                                                      */
  CLKGEN_CLKOUT_CKEN_EN                = 1,     /*!< EN : Enable CLKOUT                                                        */
} CLKGEN_CLKOUT_CKEN_Enum;

/* ==============================================  CLKGEN CLKOUT CKSEL [0..5]  =============================================== */
typedef enum {                                  /*!< CLKGEN_CLKOUT_CKSEL                                                       */
  CLKGEN_CLKOUT_CKSEL_LFRC_NOMINAL     = 0,     /*!< LFRC_NOMINAL : LFRC clock source selection.                               */
  CLKGEN_CLKOUT_CKSEL_XT_DIV2          = 1,     /*!< XT_DIV2 : XT / 2 clock source selection                                   */
  CLKGEN_CLKOUT_CKSEL_XT_DIV4          = 2,     /*!< XT_DIV4 : XT / 4 clock source selection                                   */
  CLKGEN_CLKOUT_CKSEL_XT_DIV8          = 3,     /*!< XT_DIV8 : XT / 8 clock source selection                                   */
  CLKGEN_CLKOUT_CKSEL_XT_DIV16         = 4,     /*!< XT_DIV16 : XT / 16 clock source selection                                 */
  CLKGEN_CLKOUT_CKSEL_XT_DIV32         = 5,     /*!< XT_DIV32 : XT / 32 clock source selection                                 */
  CLKGEN_CLKOUT_CKSEL_RTC_1Hz          = 16,    /*!< RTC_1Hz : 1 Hz as selected in RTC                                         */
  CLKGEN_CLKOUT_CKSEL_XT_DIV2M         = 22,    /*!< XT_DIV2M : XT / 2^21 clock source selection                               */
  CLKGEN_CLKOUT_CKSEL_XT               = 23,    /*!< XT : XT clock source selection                                            */
  CLKGEN_CLKOUT_CKSEL_CG_100Hz         = 24,    /*!< CG_100Hz : 100 Hz as selected in CLKGEN                                   */
  CLKGEN_CLKOUT_CKSEL_LFRC_DIV2        = 35,    /*!< LFRC_DIV2 : LFRC / 2 clock source selection                               */
  CLKGEN_CLKOUT_CKSEL_LFRC_DIV32       = 36,    /*!< LFRC_DIV32 : LFRC / 32 clock source selection                             */
  CLKGEN_CLKOUT_CKSEL_LFRC_DIV512      = 37,    /*!< LFRC_DIV512 : LFRC / 512 clock source selection                           */
  CLKGEN_CLKOUT_CKSEL_LFRC_DIV32K      = 38,    /*!< LFRC_DIV32K : LFRC / 32768 clock source selection                         */
  CLKGEN_CLKOUT_CKSEL_XT_DIV256        = 39,    /*!< XT_DIV256 : XT / 256 clock source selection                               */
  CLKGEN_CLKOUT_CKSEL_XT_DIV8K         = 40,    /*!< XT_DIV8K : XT / 8192 clock source selection                               */
  CLKGEN_CLKOUT_CKSEL_XT_DIV64K        = 41,    /*!< XT_DIV64K : XT / 2^16 clock source selection                              */
  CLKGEN_CLKOUT_CKSEL_ULFRC_DIV16      = 42,    /*!< ULFRC_DIV16 : Uncal LFRC / 16 clock source selection                      */
  CLKGEN_CLKOUT_CKSEL_ULFRC_DIV128     = 43,    /*!< ULFRC_DIV128 : Uncal LFRC / 128 clock source selection                    */
  CLKGEN_CLKOUT_CKSEL_ULFRC_DIV1K      = 44,    /*!< ULFRC_DIV1K : Uncal LFRC / 1024 clock source selection                    */
  CLKGEN_CLKOUT_CKSEL_ULFRC_DIV4K      = 45,    /*!< ULFRC_DIV4K : Uncal LFRC / 4096 clock source selection                    */
  CLKGEN_CLKOUT_CKSEL_ULFRC_DIV1M      = 46,    /*!< ULFRC_DIV1M : Uncal LFRC / 2^20 clock source selection                    */
  CLKGEN_CLKOUT_CKSEL_LFRC_DIV1M       = 49,    /*!< LFRC_DIV1M : LFRC / 2^20 clock source selection                           */
  CLKGEN_CLKOUT_CKSEL_XTNE             = 53,    /*!< XTNE : XT (not autoenabled)                                               */
  CLKGEN_CLKOUT_CKSEL_XTNE_DIV16       = 54,    /*!< XTNE_DIV16 : XT / 16 (not autoenabled)                                    */
  CLKGEN_CLKOUT_CKSEL_LFRCNE_DIV32     = 55,    /*!< LFRCNE_DIV32 : LFRC / 32 (not autoenabled)                                */
  CLKGEN_CLKOUT_CKSEL_LFRCNE           = 57,    /*!< LFRCNE : LFRC (not autoenabled) - Default for undefined values            */
  CLKGEN_CLKOUT_CKSEL_HFRC2_DIV64      = 58,    /*!< HFRC2_DIV64 : HFRC2 / 64 clock source selection                           */
  CLKGEN_CLKOUT_CKSEL_HFRC2_DIV32      = 59,    /*!< HFRC2_DIV32 : HFRC2 / 32 clock source selection                           */
  CLKGEN_CLKOUT_CKSEL_HFRC2_DIV16      = 60,    /*!< HFRC2_DIV16 : HFRC2 / 16 clock source selection                           */
  CLKGEN_CLKOUT_CKSEL_HFRC2_DIV8       = 61,    /*!< HFRC2_DIV8 : HFRC2 / 8 clock source selection                             */
  CLKGEN_CLKOUT_CKSEL_HFRC2_DIV2       = 62,    /*!< HFRC2_DIV2 : HFRC2 / 2 clock source selection                             */
  CLKGEN_CLKOUT_CKSEL_HFRC2            = 63,    /*!< HFRC2 : HFRC2 clock source selection                                      */
} CLKGEN_CLKOUT_CKSEL_Enum;

/* =========================================================  HFADJ  ========================================================= */
/* ==========================================  CLKGEN HFADJ HFADJMAXDELTA [24..28]  ========================================== */
typedef enum {                                  /*!< CLKGEN_HFADJ_HFADJMAXDELTA                                                */
  CLKGEN_HFADJ_HFADJMAXDELTA_DISABLED  = 0,     /*!< DISABLED : Maximum Delta function is disabled                             */
  CLKGEN_HFADJ_HFADJMAXDELTA_ENABLED   = 1,     /*!< ENABLED : Maximum Delta function is enabled                               */
} CLKGEN_HFADJ_HFADJMAXDELTA_Enum;

/* ============================================  CLKGEN HFADJ HFADJGAIN [21..23]  ============================================ */
typedef enum {                                  /*!< CLKGEN_HFADJ_HFADJGAIN                                                    */
  CLKGEN_HFADJ_HFADJGAIN_Gain_of_1     = 0,     /*!< Gain_of_1 : HF Adjust with Gain of 1                                      */
  CLKGEN_HFADJ_HFADJGAIN_Gain_of_1_in_2 = 1,    /*!< Gain_of_1_in_2 : HF Adjust with Gain of 0.5                               */
  CLKGEN_HFADJ_HFADJGAIN_Gain_of_1_in_4 = 2,    /*!< Gain_of_1_in_4 : HF Adjust with Gain of 0.25                              */
  CLKGEN_HFADJ_HFADJGAIN_Gain_of_1_in_8 = 3,    /*!< Gain_of_1_in_8 : HF Adjust with Gain of 0.125                             */
  CLKGEN_HFADJ_HFADJGAIN_Gain_of_1_in_16 = 4,   /*!< Gain_of_1_in_16 : HF Adjust with Gain of 0.0625                           */
  CLKGEN_HFADJ_HFADJGAIN_Gain_of_1_in_32 = 5,   /*!< Gain_of_1_in_32 : HF Adjust with Gain of 0.03125                          */
} CLKGEN_HFADJ_HFADJGAIN_Enum;

