AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ==========================================  DSI DSIFUNCPRG SUPCOLVIDMODE [7..9]  ========================================== */
typedef enum {                                  /*!< DSI_DSIFUNCPRG_SUPCOLVIDMODE                                              */
  DSI_DSIFUNCPRG_SUPCOLVIDMODE_FMTVMODE0 = 0,   /*!< FMTVMODE0 : Video mode is not supported                                   */
  DSI_DSIFUNCPRG_SUPCOLVIDMODE_FMTVMODE1 = 1,   /*!< FMTVMODE1 : RGB565 or 16-bit format                                       */
  DSI_DSIFUNCPRG_SUPCOLVIDMODE_FMTVMODE2 = 2,   /*!< FMTVMODE2 : RGB666 or 18-bit format                                       */
  DSI_DSIFUNCPRG_SUPCOLVIDMODE_FMTVMODE3 = 3,   /*!< FMTVMODE3 : RGB 666 loosely packed format                                 */
  DSI_DSIFUNCPRG_SUPCOLVIDMODE_FMTVMODE4 = 4,   /*!< FMTVMODE4 : RGB888 or 24-bit format                                       */
} DSI_DSIFUNCPRG_SUPCOLVIDMODE_Enum;

/* ===========================================  DSI DSIFUNCPRG CHNUMCMODE [5..6]  ============================================ */
typedef enum {                                  /*!< DSI_DSIFUNCPRG_CHNUMCMODE                                                 */
  DSI_DSIFUNCPRG_CHNUMCMODE_VCCH0      = 0,     /*!< VCCH0 : Virtual command mode channel 0                                    */
  DSI_DSIFUNCPRG_CHNUMCMODE_VCCH1      = 1,     /*!< VCCH1 : Virtual command mode channel 1                                    */
  DSI_DSIFUNCPRG_CHNUMCMODE_VCCH2      = 2,     /*!< VCCH2 : Virtual command mode channel 2                                    */
  DSI_DSIFUNCPRG_CHNUMCMODE_VCCH3      = 3,     /*!< VCCH3 : Virtual command mode channel 3                                    */
} DSI_DSIFUNCPRG_CHNUMCMODE_Enum;

/* =============================================  DSI DSIFUNCPRG CHNUMVM [3..4]  ============================================= */
typedef enum {                                  /*!< DSI_DSIFUNCPRG_CHNUMVM                                                    */
  DSI_DSIFUNCPRG_CHNUMVM_VVCH0         = 0,     /*!< VVCH0 : Virtual video mode channel 0                                      */
  DSI_DSIFUNCPRG_CHNUMVM_VVCH1         = 1,     /*!< VVCH1 : Virtual video mode channel 1                                      */
  DSI_DSIFUNCPRG_CHNUMVM_VVCH2         = 2,     /*!< VVCH2 : Virtual video mode channel 2                                      */
  DSI_DSIFUNCPRG_CHNUMVM_VVCH3         = 3,     /*!< VVCH3 : Virtual video mode channel 3                                      */
} DSI_DSIFUNCPRG_CHNUMVM_Enum;

/* ============================================  DSI DSIFUNCPRG DATALANES [0..2]  ============================================ */
typedef enum {                                  /*!< DSI_DSIFUNCPRG_DATALANES                                                  */
  DSI_DSIFUNCPRG_DATALANES_DATAL0      = 0,     /*!< DATAL0 : FIXME - enum description needed here.                            */
  DSI_DSIFUNCPRG_DATALANES_DATAL1      = 1,     /*!< DATAL1 : One data lane                                                    */
  DSI_DSIFUNCPRG_DATALANES_DATAL2      = 2,     /*!< DATAL2 : Two data lane                                                    */
  DSI_DSIFUNCPRG_DATALANES_DATAL3      = 3,     /*!< DATAL3 : Three data lane                                                  */
  DSI_DSIFUNCPRG_DATALANES_DATAL4      = 4,     /*!< DATAL4 : Four data lane                                                   */
} DSI_DSIFUNCPRG_DATALANES_Enum;

/* ======================================================  HSTXTIMEOUT  ====================================================== */
/* ========================================================  LPRXTO  ========================================================= */
/* ======================================================  TURNARNDTO  ======================================================= */
/* ===================================================  DEVICERESETTIMER  ==================================================== */
/* =====================================================  DPIRESOLUTION  ===================================================== */
/* =======================================================  HSYNCCNT  ======================================================== */
/* ====================================================  HORIZBKPORCHCNT  ==================================================== */
/* ====================================================  HORIZFPORCHCNT  ===================================================== */
/* ===================================================  HORZACTIVEAREACNT  =================================================== */
/* =======================================================  VSYNCCNT  ======================================================== */
/* ====================================================  VERTBKPORCHCNT  ===================================================== */
/* =====================================================  VERTFPORCHCNT  ===================================================== */
/* ===================================================  DATALANEHILOSWCNT  =================================================== */
/* ==========================================================  DPI  ========================================================== */
/* ======================================================  PLLLOCKCNT  ======================================================= */
/* ========================================================  INITCNT  ======================================================== */
/* =====================================================  MAXRETPACSZE  ====================================================== */
/* =====================================================  VIDEOMODEFMT  ====================================================== */
/* ===========================================  DSI VIDEOMODEFMT VIDEMDFMT [0..1]  =========================================== */
typedef enum {                                  /*!< DSI_VIDEOMODEFMT_VIDEMDFMT                                                */
  DSI_VIDEOMODEFMT_VIDEMDFMT_FIXME_ENUM = 0,    /*!< FIXME_ENUM : FIXME - enum description needed here.                        */
  DSI_VIDEOMODEFMT_VIDEMDFMT_NONBURSTPULSE = 1, /*!< NONBURSTPULSE : Non Burst Mode with Sync Pulse                            */
  DSI_VIDEOMODEFMT_VIDEMDFMT_NONBURSTEVENTS = 2,/*!< NONBURSTEVENTS : Non Burst Mode with Sync events                          */
  DSI_VIDEOMODEFMT_VIDEMDFMT_BURST     = 3,     /*!< BURST : MODE Burst Mode                                                   */
} DSI_VIDEOMODEFMT_VIDEMDFMT_Enum;

/* ========================================================  CLKEOT  ========================================================= */
/* =======================================================  POLARITY  ======================================================== */
/* ===============================================  DSI POLARITY PBITS [0..3]  =============================================== */
typedef enum {                                  /*!< DSI_POLARITY_PBITS                                                        */
  DSI_POLARITY_PBITS_POLV              = 0,     /*!< POLV : polarity for Vsync                                                 */
  DSI_POLARITY_PBITS_POLH              = 1,     /*!< POLH : Polarity for Hsync                                                 */
  DSI_POLARITY_PBITS_POLSD             = 2,     /*!< POLSD : Polarity for shut down                                            */
  DSI_POLARITY_PBITS_POLCM             = 3,     /*!< POLCM : Polarity for Color mode                                           */
} DSI_POLARITY_PBITS_Enum;

/* ======================================================  CLKLANESWT  ======================================================= */
/* =======================================================  LPBYTECLK  ======================================================= */
/* =======================================================  DPHYPARAM  ======================================================= */
/* ====================================================  CLKLANETIMPARM  ===================================================== */
/* =======================================================  RSTENBDFE  ======================================================= */
/* =======================================================  AFETRIM0  ======================================================== */
/* =======================================================  AFETRIM1  ======================================================== */
/* =======================================================  AFETRIM2  ======================================================== */
/* =======================================================  AFETRIM3  ======================================================== */
/* =====================================================  ERRORAUTORCOV  ===================================================== */
/* ====================================================  MIPIDIRDPIDIFF  ===================================================== */
/* ==========================================  DSI MIPIDIRDPIDIFF DPIHIGH [15..15]  ========================================== */
typedef enum {                                  /*!< DSI_MIPIDIRDPIDIFF_DPIHIGH                                                */
  DSI_MIPIDIRDPIDIFF_DPIHIGH_LESSTHAN  = 0,     /*!< LESSTHAN : one line time in DPI is less than to DSI line time             */
  DSI_MIPIDIRDPIDIFF_DPIHIGH_GREATER   = 1,     /*!< GREATER : one line time in DPI is greater than or equal to DSI
                                                     line time                                                                 */
} DSI_MIPIDIRDPIDIFF_DPIHIGH_Enum;

/* ===========================================  DSI MIPIDIRDPIDIFF MIPIDIR [0..0]  =========================================== */
typedef enum {                                  /*!< DSI_MIPIDIRDPIDIFF_MIPIDIR                                                */
  DSI_MIPIDIRDPIDIFF_MIPIDIR_CONTROL   = 0,     /*!< CONTROL : DSI Host has the control over MIPI bus                          */
  DSI_MIPIDIRDPIDIFF_MIPIDIR_RECEIVE   = 1,     /*!< RECEIVE : DSI Host is in Receive mode                                     */
} DSI_MIPIDIRDPIDIFF_MIPIDIR_Enum;

