AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ==========================================  GPIO PINCFG105 PULLCFG105 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG105_PULLCFG105                                                 */
  GPIO_PINCFG105_PULLCFG105_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG105_PULLCFG105_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG105_PULLCFG105_PU50K      = 2,     /*!< PU50K : 50K Pullup selected                                               */
} GPIO_PINCFG105_PULLCFG105_Enum;

/* =============================================  GPIO PINCFG105 SR105 [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG105_SR105                                                      */
  GPIO_PINCFG105_SR105_LDRV            = 0,     /*!< LDRV : Select the lower of the two drive strength selections              */
  GPIO_PINCFG105_SR105_HDRV            = 1,     /*!< HDRV : Select the higher of the two drive strength selections             */
} GPIO_PINCFG105_SR105_Enum;

/* =============================================  GPIO PINCFG105 DS105 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG105_DS105                                                      */
  GPIO_PINCFG105_DS105_0P12X_0P63X     = 0,     /*!< 0P12X_0P63X : 0.12x output driver selected if SR105 = 0, 0.63x
                                                     output driver selected if SR105 = 1                                       */
  GPIO_PINCFG105_DS105_0P25X_0P75X     = 1,     /*!< 0P25X_0P75X : 0.25x output driver selected if SR105 = 0, 0.75x
                                                     output driver selected if SR105 = 1                                       */
  GPIO_PINCFG105_DS105_0P37X_0P88X     = 2,     /*!< 0P37X_0P88X : 0.37x output driver selected if SR105 = 0, 0.88x
                                                     output driver selected if SR105 = 1                                       */
  GPIO_PINCFG105_DS105_0P5X_1P0X       = 3,     /*!< 0P5X_1P0X : 0.5x output driver selected if SR105 = 0, 1.0x output
                                                     driver selected if SR105 = 1                                              */
} GPIO_PINCFG105_DS105_Enum;

/* ============================================  GPIO PINCFG105 OUTCFG105 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG105_OUTCFG105                                                  */
  GPIO_PINCFG105_OUTCFG105_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG105_OUTCFG105_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG105_OUTCFG105_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG105_OUTCFG105_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG105_OUTCFG105_Enum;

/* ============================================  GPIO PINCFG105 IRPTEN105 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG105_IRPTEN105                                                  */
  GPIO_PINCFG105_IRPTEN105_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG105_IRPTEN105_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG105_IRPTEN105_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG105_IRPTEN105_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG105_IRPTEN105_Enum;

/* ============================================  GPIO PINCFG105 FNCSEL105 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG105_FNCSEL105                                                  */
  GPIO_PINCFG105_FNCSEL105_MSPI3_10    = 0,     /*!< MSPI3_10 : MSPI Master 3 Interface Signal                                 */
  GPIO_PINCFG105_FNCSEL105_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG105_FNCSEL105_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG105_FNCSEL105_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG105_FNCSEL105_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG105_FNCSEL105_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG105_FNCSEL105_CT105       = 6,     /*!< CT105 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG105_FNCSEL105_NCE105      = 7,     /*!< NCE105 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG105_FNCSEL105_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG105_FNCSEL105_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG105_FNCSEL105_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG105_FNCSEL105_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG105_FNCSEL105_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG105_FNCSEL105_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG105_FNCSEL105_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG105_FNCSEL105_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG105_FNCSEL105_Enum;

/* =======================================================  PINCFG106  ======================================================= */
/* ===========================================  GPIO PINCFG106 NCEPOL106 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG106_NCEPOL106                                                  */
  GPIO_PINCFG106_NCEPOL106_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG106_NCEPOL106_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG106_NCEPOL106_Enum;

