AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ==========================================  GPIO PINCFG112 PULLCFG112 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG112_PULLCFG112                                                 */
  GPIO_PINCFG112_PULLCFG112_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG112_PULLCFG112_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG112_PULLCFG112_PU50K      = 2,     /*!< PU50K : 50K Pullup selected                                               */
} GPIO_PINCFG112_PULLCFG112_Enum;

/* =============================================  GPIO PINCFG112 SR112 [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG112_SR112                                                      */
  GPIO_PINCFG112_SR112_LDRV            = 0,     /*!< LDRV : Select the lower of the two drive strength selections              */
  GPIO_PINCFG112_SR112_HDRV            = 1,     /*!< HDRV : Select the higher of the two drive strength selections             */
} GPIO_PINCFG112_SR112_Enum;

/* =============================================  GPIO PINCFG112 DS112 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG112_DS112                                                      */
  GPIO_PINCFG112_DS112_0P12X_0P63X     = 0,     /*!< 0P12X_0P63X : 0.12x output driver selected if SR112 = 0, 0.63x
                                                     output driver selected if SR112 = 1                                       */
  GPIO_PINCFG112_DS112_0P25X_0P75X     = 1,     /*!< 0P25X_0P75X : 0.25x output driver selected if SR112 = 0, 0.75x
                                                     output driver selected if SR112 = 1                                       */
  GPIO_PINCFG112_DS112_0P37X_0P88X     = 2,     /*!< 0P37X_0P88X : 0.37x output driver selected if SR112 = 0, 0.88x
                                                     output driver selected if SR112 = 1                                       */
  GPIO_PINCFG112_DS112_0P5X_1P0X       = 3,     /*!< 0P5X_1P0X : 0.5x output driver selected if SR112 = 0, 1.0x output
                                                     driver selected if SR112 = 1                                              */
} GPIO_PINCFG112_DS112_Enum;

/* ============================================  GPIO PINCFG112 OUTCFG112 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG112_OUTCFG112                                                  */
  GPIO_PINCFG112_OUTCFG112_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG112_OUTCFG112_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG112_OUTCFG112_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG112_OUTCFG112_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG112_OUTCFG112_Enum;

/* ============================================  GPIO PINCFG112 IRPTEN112 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG112_IRPTEN112                                                  */
  GPIO_PINCFG112_IRPTEN112_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG112_IRPTEN112_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG112_IRPTEN112_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG112_IRPTEN112_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG112_IRPTEN112_Enum;

/* ============================================  GPIO PINCFG112 FNCSEL112 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG112_FNCSEL112                                                  */
  GPIO_PINCFG112_FNCSEL112_MSPI3_17    = 0,     /*!< MSPI3_17 : MSPI Master 3 Interface Signal                                 */
  GPIO_PINCFG112_FNCSEL112_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG112_FNCSEL112_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG112_FNCSEL112_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG112_FNCSEL112_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG112_FNCSEL112_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG112_FNCSEL112_CT112       = 6,     /*!< CT112 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG112_FNCSEL112_NCE112      = 7,     /*!< NCE112 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG112_FNCSEL112_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG112_FNCSEL112_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG112_FNCSEL112_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG112_FNCSEL112_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG112_FNCSEL112_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG112_FNCSEL112_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG112_FNCSEL112_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG112_FNCSEL112_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG112_FNCSEL112_Enum;

/* =======================================================  PINCFG113  ======================================================= */
/* ===========================================  GPIO PINCFG113 NCEPOL113 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG113_NCEPOL113                                                  */
  GPIO_PINCFG113_NCEPOL113_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG113_NCEPOL113_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG113_NCEPOL113_Enum;

