AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ==========================================  GPIO PINCFG129 PULLCFG129 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG129_PULLCFG129                                                 */
  GPIO_PINCFG129_PULLCFG129_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG129_PULLCFG129_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG129_PULLCFG129_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG129_PULLCFG129_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG129_PULLCFG129_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG129_PULLCFG129_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG129_PULLCFG129_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG129_PULLCFG129_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG129_PULLCFG129_Enum;

/* =============================================  GPIO PINCFG129 DS129 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG129_DS129                                                      */
  GPIO_PINCFG129_DS129_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG129_DS129_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
  GPIO_PINCFG129_DS129_0P75X           = 2,     /*!< 0P75X : 0.75x output driver selected                                      */
  GPIO_PINCFG129_DS129_1P0X            = 3,     /*!< 1P0X : 1.0x output driver selected                                        */
} GPIO_PINCFG129_DS129_Enum;

/* ============================================  GPIO PINCFG129 OUTCFG129 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG129_OUTCFG129                                                  */
  GPIO_PINCFG129_OUTCFG129_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG129_OUTCFG129_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG129_OUTCFG129_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG129_OUTCFG129_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG129_OUTCFG129_Enum;

/* ============================================  GPIO PINCFG129 IRPTEN129 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG129_IRPTEN129                                                  */
  GPIO_PINCFG129_IRPTEN129_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG129_IRPTEN129_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG129_IRPTEN129_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG129_IRPTEN129_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG129_IRPTEN129_Enum;

/* ============================================  GPIO PINCFG129 FNCSEL129 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG129_FNCSEL129                                                  */
  GPIO_PINCFG129_FNCSEL129_SDIF1_CLKOUT = 0,    /*!< SDIF1_CLKOUT : SD/SDIO/MMC1 Clock to Card (CLK)                           */
  GPIO_PINCFG129_FNCSEL129_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG129_FNCSEL129_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG129_FNCSEL129_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG129_FNCSEL129_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG129_FNCSEL129_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG129_FNCSEL129_CT129       = 6,     /*!< CT129 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG129_FNCSEL129_NCE129      = 7,     /*!< NCE129 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG129_FNCSEL129_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG129_FNCSEL129_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG129_FNCSEL129_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG129_FNCSEL129_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG129_FNCSEL129_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG129_FNCSEL129_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG129_FNCSEL129_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG129_FNCSEL129_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG129_FNCSEL129_Enum;

/* =======================================================  PINCFG130  ======================================================= */
/* ===========================================  GPIO PINCFG130 NCEPOL130 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG130_NCEPOL130                                                  */
  GPIO_PINCFG130_NCEPOL130_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG130_NCEPOL130_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG130_NCEPOL130_Enum;

