AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* =============================================  GPIO PINCFG142 SR142 [12..12]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG142_SR142                                                      */
  GPIO_PINCFG142_SR142_LDRV            = 0,     /*!< LDRV : Select the lower of the two drive strength selections              */
  GPIO_PINCFG142_SR142_HDRV            = 1,     /*!< HDRV : Select the higher of the two drive strength selections             */
} GPIO_PINCFG142_SR142_Enum;

/* =============================================  GPIO PINCFG142 DS142 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG142_DS142                                                      */
  GPIO_PINCFG142_DS142_0P12X_0P63X     = 0,     /*!< 0P12X_0P63X : 0.12x output driver selected if SR142 = 0, 0.63x
                                                     output driver selected if SR142 = 1                                       */
  GPIO_PINCFG142_DS142_0P25X_0P75X     = 1,     /*!< 0P25X_0P75X : 0.25x output driver selected if SR142 = 0, 0.75x
                                                     output driver selected if SR142 = 1                                       */
  GPIO_PINCFG142_DS142_0P37X_0P88X     = 2,     /*!< 0P37X_0P88X : 0.37x output driver selected if SR142 = 0, 0.88x
                                                     output driver selected if SR142 = 1                                       */
  GPIO_PINCFG142_DS142_0P5X_1P0X       = 3,     /*!< 0P5X_1P0X : 0.5x output driver selected if SR142 = 0, 1.0x output
                                                     driver selected if SR142 = 1                                              */
} GPIO_PINCFG142_DS142_Enum;

/* ============================================  GPIO PINCFG142 OUTCFG142 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG142_OUTCFG142                                                  */
  GPIO_PINCFG142_OUTCFG142_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG142_OUTCFG142_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG142_OUTCFG142_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG142_OUTCFG142_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG142_OUTCFG142_Enum;

/* ============================================  GPIO PINCFG142 IRPTEN142 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG142_IRPTEN142                                                  */
  GPIO_PINCFG142_IRPTEN142_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG142_IRPTEN142_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG142_IRPTEN142_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG142_IRPTEN142_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG142_IRPTEN142_Enum;

/* ============================================  GPIO PINCFG142 FNCSEL142 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG142_FNCSEL142                                                  */
  GPIO_PINCFG142_FNCSEL142_SWTRACECLK  = 0,     /*!< SWTRACECLK : Serial Wire Debug Trace Clock                                */
  GPIO_PINCFG142_FNCSEL142_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG142_FNCSEL142_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG142_FNCSEL142_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG142_FNCSEL142_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG142_FNCSEL142_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG142_FNCSEL142_CT142       = 6,     /*!< CT142 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG142_FNCSEL142_NCE142      = 7,     /*!< NCE142 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG142_FNCSEL142_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG142_FNCSEL142_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG142_FNCSEL142_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG142_FNCSEL142_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG142_FNCSEL142_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG142_FNCSEL142_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG142_FNCSEL142_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG142_FNCSEL142_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG142_FNCSEL142_Enum;

/* =======================================================  PINCFG143  ======================================================= */
/* ===========================================  GPIO PINCFG143 NCEPOL143 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG143_NCEPOL143                                                  */
  GPIO_PINCFG143_NCEPOL143_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG143_NCEPOL143_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG143_NCEPOL143_Enum;

/* ===========================================  GPIO PINCFG143 NCESRC143 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG143_NCESRC143                                                  */
  GPIO_PINCFG143_NCESRC143_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG143_NCESRC143_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG143_NCESRC143_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG143_NCESRC143_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG143_NCESRC143_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG143_NCESRC143_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG143_NCESRC143_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG143_NCESRC143_Enum;

/* ==========================================  GPIO PINCFG143 PULLCFG143 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG143_PULLCFG143                                                 */
  GPIO_PINCFG143_PULLCFG143_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG143_PULLCFG143_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG143_PULLCFG143_PU50K      = 2,     /*!< PU50K : 50K Pullup selected                                               */
} GPIO_PINCFG143_PULLCFG143_Enum;

