AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* =============================================  GPIO PINCFG189 DS189 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG189_DS189                                                      */
  GPIO_PINCFG189_DS189_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG189_DS189_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG189_DS189_Enum;

/* ============================================  GPIO PINCFG189 OUTCFG189 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG189_OUTCFG189                                                  */
  GPIO_PINCFG189_OUTCFG189_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG189_OUTCFG189_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG189_OUTCFG189_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG189_OUTCFG189_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG189_OUTCFG189_Enum;

/* ============================================  GPIO PINCFG189 IRPTEN189 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG189_IRPTEN189                                                  */
  GPIO_PINCFG189_IRPTEN189_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG189_IRPTEN189_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG189_IRPTEN189_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG189_IRPTEN189_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG189_IRPTEN189_Enum;

/* ============================================  GPIO PINCFG189 FNCSEL189 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG189_FNCSEL189                                                  */
  GPIO_PINCFG189_FNCSEL189_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG189_FNCSEL189_DISP_PCLK   = 1,     /*!< DISP_PCLK : Display RGB Pixel Clock                                       */
  GPIO_PINCFG189_FNCSEL189_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG189_FNCSEL189_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG189_FNCSEL189_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG189_FNCSEL189_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG189_FNCSEL189_CT189       = 6,     /*!< CT189 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG189_FNCSEL189_NCE189      = 7,     /*!< NCE189 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG189_FNCSEL189_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG189_FNCSEL189_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG189_FNCSEL189_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG189_FNCSEL189_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG189_FNCSEL189_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG189_FNCSEL189_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG189_FNCSEL189_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG189_FNCSEL189_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG189_FNCSEL189_Enum;

/* =======================================================  PINCFG190  ======================================================= */
/* ===========================================  GPIO PINCFG190 NCEPOL190 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG190_NCEPOL190                                                  */
  GPIO_PINCFG190_NCEPOL190_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG190_NCEPOL190_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG190_NCEPOL190_Enum;

