AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ==========================================  GPIO PINCFG198 PULLCFG198 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG198_PULLCFG198                                                 */
  GPIO_PINCFG198_PULLCFG198_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG198_PULLCFG198_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG198_PULLCFG198_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG198_PULLCFG198_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG198_PULLCFG198_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG198_PULLCFG198_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG198_PULLCFG198_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG198_PULLCFG198_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG198_PULLCFG198_Enum;

/* =============================================  GPIO PINCFG198 DS198 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG198_DS198                                                      */
  GPIO_PINCFG198_DS198_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG198_DS198_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG198_DS198_Enum;

/* ============================================  GPIO PINCFG198 OUTCFG198 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG198_OUTCFG198                                                  */
  GPIO_PINCFG198_OUTCFG198_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG198_OUTCFG198_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG198_OUTCFG198_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG198_OUTCFG198_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG198_OUTCFG198_Enum;

/* ============================================  GPIO PINCFG198 IRPTEN198 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG198_IRPTEN198                                                  */
  GPIO_PINCFG198_IRPTEN198_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG198_IRPTEN198_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG198_IRPTEN198_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG198_IRPTEN198_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG198_IRPTEN198_Enum;

/* ============================================  GPIO PINCFG198 FNCSEL198 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG198_FNCSEL198                                                  */
  GPIO_PINCFG198_FNCSEL198_RESERVED0   = 0,     /*!< RESERVED0 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG198_FNCSEL198_RESERVED1   = 1,     /*!< RESERVED1 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG198_FNCSEL198_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG198_FNCSEL198_RESERVED3   = 3,     /*!< RESERVED3 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG198_FNCSEL198_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG198_FNCSEL198_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG198_FNCSEL198_RESERVED6   = 6,     /*!< RESERVED6 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG198_FNCSEL198_RESERVED7   = 7,     /*!< RESERVED7 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG198_FNCSEL198_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG198_FNCSEL198_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG198_FNCSEL198_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG198_FNCSEL198_RESERVED11  = 11,    /*!< RESERVED11 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG198_FNCSEL198_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG198_FNCSEL198_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG198_FNCSEL198_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG198_FNCSEL198_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG198_FNCSEL198_Enum;

/* =======================================================  PINCFG199  ======================================================= */
/* ===========================================  GPIO PINCFG199 NCEPOL199 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG199_NCEPOL199                                                  */
  GPIO_PINCFG199_NCEPOL199_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG199_NCEPOL199_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG199_NCEPOL199_Enum;

