AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ============================================  GPIO PINCFG209 FNCSEL209 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG209_FNCSEL209                                                  */
  GPIO_PINCFG209_FNCSEL209_DISP_ENB    = 0,     /*!< DISP_ENB : Display MiP Enable                                             */
  GPIO_PINCFG209_FNCSEL209_DISP_D1     = 1,     /*!< DISP_D1 : Display Data 1                                                  */
  GPIO_PINCFG209_FNCSEL209_DBIB_CSX    = 2,     /*!< DBIB_CSX : Display DBI Chip Enable                                        */
  GPIO_PINCFG209_FNCSEL209_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG209_FNCSEL209_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG209_FNCSEL209_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG209_FNCSEL209_CT209       = 6,     /*!< CT209 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG209_FNCSEL209_NCE209      = 7,     /*!< NCE209 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG209_FNCSEL209_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG209_FNCSEL209_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG209_FNCSEL209_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG209_FNCSEL209_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG209_FNCSEL209_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG209_FNCSEL209_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG209_FNCSEL209_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG209_FNCSEL209_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG209_FNCSEL209_Enum;

/* =======================================================  PINCFG210  ======================================================= */
/* ===========================================  GPIO PINCFG210 NCEPOL210 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG210_NCEPOL210                                                  */
  GPIO_PINCFG210_NCEPOL210_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG210_NCEPOL210_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG210_NCEPOL210_Enum;

/* ===========================================  GPIO PINCFG210 NCESRC210 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG210_NCESRC210                                                  */
  GPIO_PINCFG210_NCESRC210_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG210_NCESRC210_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG210_NCESRC210_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG210_NCESRC210_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG210_NCESRC210_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG210_NCESRC210_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG210_NCESRC210_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG210_NCESRC210_Enum;

/* ==========================================  GPIO PINCFG210 PULLCFG210 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG210_PULLCFG210                                                 */
  GPIO_PINCFG210_PULLCFG210_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG210_PULLCFG210_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG210_PULLCFG210_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG210_PULLCFG210_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG210_PULLCFG210_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG210_PULLCFG210_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG210_PULLCFG210_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG210_PULLCFG210_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG210_PULLCFG210_Enum;

/* =============================================  GPIO PINCFG210 DS210 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG210_DS210                                                      */
  GPIO_PINCFG210_DS210_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG210_DS210_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG210_DS210_Enum;

/* ============================================  GPIO PINCFG210 OUTCFG210 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG210_OUTCFG210                                                  */
  GPIO_PINCFG210_OUTCFG210_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG210_OUTCFG210_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG210_OUTCFG210_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG210_OUTCFG210_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG210_OUTCFG210_Enum;

/* ============================================  GPIO PINCFG210 IRPTEN210 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG210_IRPTEN210                                                  */
  GPIO_PINCFG210_IRPTEN210_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG210_IRPTEN210_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG210_IRPTEN210_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG210_IRPTEN210_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG210_IRPTEN210_Enum;

/* ============================================  GPIO PINCFG210 FNCSEL210 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG210_FNCSEL210                                                  */
  GPIO_PINCFG210_FNCSEL210_DISP_XRST   = 0,     /*!< DISP_XRST : Display MiP Reset                                             */
  GPIO_PINCFG210_FNCSEL210_DISP_D4     = 1,     /*!< DISP_D4 : Display Data 4                                                  */
  GPIO_PINCFG210_FNCSEL210_DBIB_DCX    = 2,     /*!< DBIB_DCX : Display DBI Data/Command Select                                */
  GPIO_PINCFG210_FNCSEL210_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG210_FNCSEL210_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG210_FNCSEL210_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG210_FNCSEL210_CT210       = 6,     /*!< CT210 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG210_FNCSEL210_NCE210      = 7,     /*!< NCE210 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG210_FNCSEL210_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG210_FNCSEL210_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG210_FNCSEL210_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG210_FNCSEL210_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG210_FNCSEL210_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG210_FNCSEL210_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG210_FNCSEL210_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG210_FNCSEL210_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG210_FNCSEL210_Enum;

/* =======================================================  PINCFG211  ======================================================= */
/* ===========================================  GPIO PINCFG211 NCEPOL211 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG211_NCEPOL211                                                  */
  GPIO_PINCFG211_NCEPOL211_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG211_NCEPOL211_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG211_NCEPOL211_Enum;

/* ===========================================  GPIO PINCFG211 NCESRC211 [16..21]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG211_NCESRC211                                                  */
  GPIO_PINCFG211_NCESRC211_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM6CE0     = 24,    /*!< IOM6CE0 : IOM 6 NCE 0 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM6CE1     = 25,    /*!< IOM6CE1 : IOM 6 NCE 1 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM6CE2     = 26,    /*!< IOM6CE2 : IOM 6 NCE 2 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM6CE3     = 27,    /*!< IOM6CE3 : IOM 6 NCE 3 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM7CE0     = 28,    /*!< IOM7CE0 : IOM 7 NCE 0 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM7CE1     = 29,    /*!< IOM7CE1 : IOM 7 NCE 1 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM7CE2     = 30,    /*!< IOM7CE2 : IOM 7 NCE 2 module                                              */
  GPIO_PINCFG211_NCESRC211_IOM7CE3     = 31,    /*!< IOM7CE3 : IOM 7 NCE 3 module                                              */
  GPIO_PINCFG211_NCESRC211_DC_DPI_DE   = 48,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG211_NCESRC211_DISP_CONT_CSX = 49,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG211_NCESRC211_DC_SPI_CS_N = 50,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG211_NCESRC211_DC_QSPI_CS_N = 51,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG211_NCESRC211_DC_RESX     = 52,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG211_NCESRC211_Enum;

/* ==========================================  GPIO PINCFG211 PULLCFG211 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG211_PULLCFG211                                                 */
  GPIO_PINCFG211_PULLCFG211_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG211_PULLCFG211_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG211_PULLCFG211_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG211_PULLCFG211_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG211_PULLCFG211_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG211_PULLCFG211_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG211_PULLCFG211_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG211_PULLCFG211_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG211_PULLCFG211_Enum;

/* =============================================  GPIO PINCFG211 DS211 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG211_DS211                                                      */
  GPIO_PINCFG211_DS211_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG211_DS211_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG211_DS211_Enum;

