AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* =============================================  GPIO PINCFG219 DS219 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG219_DS219                                                      */
  GPIO_PINCFG219_DS219_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG219_DS219_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
} GPIO_PINCFG219_DS219_Enum;

/* ============================================  GPIO PINCFG219 OUTCFG219 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG219_OUTCFG219                                                  */
  GPIO_PINCFG219_OUTCFG219_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG219_OUTCFG219_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG219_OUTCFG219_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG219_OUTCFG219_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG219_OUTCFG219_Enum;

/* ============================================  GPIO PINCFG219 IRPTEN219 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG219_IRPTEN219                                                  */
  GPIO_PINCFG219_IRPTEN219_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG219_IRPTEN219_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG219_IRPTEN219_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG219_IRPTEN219_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG219_IRPTEN219_Enum;

/* ============================================  GPIO PINCFG219 FNCSEL219 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG219_FNCSEL219                                                  */
  GPIO_PINCFG219_FNCSEL219_DISP_HCK    = 0,     /*!< DISP_HCK : Display MiP HCLK                                               */
  GPIO_PINCFG219_FNCSEL219_DISP_D3     = 1,     /*!< DISP_D3 : Display Data 3                                                  */
  GPIO_PINCFG219_FNCSEL219_DBIB_D6     = 2,     /*!< DBIB_D6 : Display DBI Data                                                */
  GPIO_PINCFG219_FNCSEL219_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG219_FNCSEL219_RESERVED4   = 4,     /*!< RESERVED4 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG219_FNCSEL219_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG219_FNCSEL219_CT219       = 6,     /*!< CT219 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG219_FNCSEL219_NCE219      = 7,     /*!< NCE219 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG219_FNCSEL219_RESERVED8   = 8,     /*!< RESERVED8 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG219_FNCSEL219_RESERVED9   = 9,     /*!< RESERVED9 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG219_FNCSEL219_RESERVED10  = 10,    /*!< RESERVED10 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG219_FNCSEL219_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG219_FNCSEL219_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG219_FNCSEL219_RESERVED13  = 13,    /*!< RESERVED13 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG219_FNCSEL219_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG219_FNCSEL219_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG219_FNCSEL219_Enum;

/* =======================================================  PINCFG220  ======================================================= */
/* ===========================================  GPIO PINCFG220 NCEPOL220 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG220_NCEPOL220                                                  */
  GPIO_PINCFG220_NCEPOL220_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG220_NCEPOL220_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG220_NCEPOL220_Enum;

