AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* =========================================  IOSLAVEFD0 DMACFG PADBYTEEN [24..24]  ========================================== */
typedef enum {                                  /*!< IOSLAVEFD0_DMACFG_PADBYTEEN                                               */
  IOSLAVEFD0_DMACFG_PADBYTEEN_DIS      = 0,     /*!< DIS : Disable PAD Byte Function                                           */
  IOSLAVEFD0_DMACFG_PADBYTEEN_EN       = 1,     /*!< EN : Enable PAD Byte Function                                             */
} IOSLAVEFD0_DMACFG_PADBYTEEN_Enum;

/* ==========================================  IOSLAVEFD0 DMACFG DMAQUAD [10..10]  =========================================== */
typedef enum {                                  /*!< IOSLAVEFD0_DMACFG_DMAQUAD                                                 */
  IOSLAVEFD0_DMACFG_DMAQUAD_SINGLE     = 0,     /*!< SINGLE : Transfer one word per DMA request                                */
  IOSLAVEFD0_DMACFG_DMAQUAD_QUAD       = 1,     /*!< QUAD : Transfer up to four words per DMA request                          */
} IOSLAVEFD0_DMACFG_DMAQUAD_Enum;

/* ===========================================  IOSLAVEFD0 DMACFG DPWROFF [9..9]  ============================================ */
typedef enum {                                  /*!< IOSLAVEFD0_DMACFG_DPWROFF                                                 */
  IOSLAVEFD0_DMACFG_DPWROFF_DIS        = 0,     /*!< DIS : Power off disabled                                                  */
  IOSLAVEFD0_DMACFG_DPWROFF_EN         = 1,     /*!< EN : Power off enabled                                                    */
} IOSLAVEFD0_DMACFG_DPWROFF_Enum;

/* ============================================  IOSLAVEFD0 DMACFG DMAPRI [8..8]  ============================================ */
typedef enum {                                  /*!< IOSLAVEFD0_DMACFG_DMAPRI                                                  */
  IOSLAVEFD0_DMACFG_DMAPRI_LOW         = 0,     /*!< LOW : Low Priority (service as best effort)                               */
  IOSLAVEFD0_DMACFG_DMAPRI_HIGH        = 1,     /*!< HIGH : High Priority (service immediately)                                */
} IOSLAVEFD0_DMACFG_DMAPRI_Enum;

/* ============================================  IOSLAVEFD0 DMACFG DMADIR [1..1]  ============================================ */
typedef enum {                                  /*!< IOSLAVEFD0_DMACFG_DMADIR                                                  */
  IOSLAVEFD0_DMACFG_DMADIR_P2M         = 0,     /*!< P2M : Peripheral to Memory (SRAM) transaction. To be set when
                                                     doing DMA read operations, ie reading data from external
                                                     devices.                                                                  */
  IOSLAVEFD0_DMACFG_DMADIR_M2P         = 1,     /*!< M2P : Memory to Peripheral transaction. To be set when doing
                                                     DMA write operations, ie writing data to external devices.                */
} IOSLAVEFD0_DMACFG_DMADIR_Enum;

/* ============================================  IOSLAVEFD0 DMACFG DMAEN [0..0]  ============================================= */
typedef enum {                                  /*!< IOSLAVEFD0_DMACFG_DMAEN                                                   */
  IOSLAVEFD0_DMACFG_DMAEN_DIS          = 0,     /*!< DIS : Disable DMA Function                                                */
  IOSLAVEFD0_DMACFG_DMAEN_EN           = 1,     /*!< EN : Enable DMA Function                                                  */
} IOSLAVEFD0_DMACFG_DMAEN_Enum;

/* ======================================================  DMATOTCOUNT  ====================================================== */
/* ======================================================  DMATARGADDR  ====================================================== */
/* ========================================================  DMASTAT  ======================================================== */
/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* ======================================================  REGACCINTEN  ====================================================== */
/* =====================================================  REGACCINTSTAT  ===================================================== */
/* =====================================================  REGACCINTCLR  ====================================================== */
/* =====================================================  REGACCINTSET  ====================================================== */


/* =========================================================================================================================== */
/* ================                                          IOSLAVE                                          ================ */
/* =========================================================================================================================== */

/* ========================================================  FIFOPTR  ======================================================== */
/* ========================================================  FIFOCFG  ======================================================== */
/* ========================================================  FIFOTHR  ======================================================== */
/* =========================================================  FUPD  ========================================================== */
/* ========================================================  FIFOCTR  ======================================================== */
/* ========================================================  FIFOINC  ======================================================== */
/* ==========================================================  CFG  ========================================================== */
/* ==============================================  IOSLAVE CFG IFCEN [31..31]  =============================================== */
typedef enum {                                  /*!< IOSLAVE_CFG_IFCEN                                                         */
  IOSLAVE_CFG_IFCEN_DIS                = 0,     /*!< DIS : Disable the IOSLAVE                                                 */
  IOSLAVE_CFG_IFCEN_EN                 = 1,     /*!< EN : Enable the IOSLAVE                                                   */
} IOSLAVE_CFG_IFCEN_Enum;

/* =============================================  IOSLAVE CFG WRAPPTR [20..20]  ============================================== */
typedef enum {                                  /*!< IOSLAVE_CFG_WRAPPTR                                                       */
  IOSLAVE_CFG_WRAPPTR_NOWRAP           = 0,     /*!< NOWRAP : Address pointer does not wrap around to FIFOBASE*8
                                                     after it reaches FIFOMAX*8-1. Additionally, the address
                                                     pointer does not automatically skip Direct Area locations
                                                     0x78 to 0x7F, so care must be taken that the host does
                                                     not inadvertently write to the Host Registers during a
                                                     data transfer.                                                            */
  IOSLAVE_CFG_WRAPPTR_WRAP             = 1,     /*!< WRAP : Address pointer wraps around to FIFOBASE*8 after it reaches
                                                     FIFOMAX*8-1 to accommodate any length transfers. In addition,
                                                     the address pointer automatically skips Direct Area locations
                                                     0x78 to 0x7F (if the FIFO Area encompasses these locations)
                                                     to avoid writing to the Host Registers.                                   */
} IOSLAVE_CFG_WRAPPTR_Enum;

/* ==============================================  IOSLAVE CFG STARTRD [4..4]  =============================================== */
typedef enum {                                  /*!< IOSLAVE_CFG_STARTRD                                                       */
  IOSLAVE_CFG_STARTRD_LATE             = 0,     /*!< LATE : Initiate I/O RAM read late in each transferred byte.               */
  IOSLAVE_CFG_STARTRD_EARLY            = 1,     /*!< EARLY : Initiate I/O RAM read early in each transferred byte.             */
} IOSLAVE_CFG_STARTRD_Enum;

/* ================================================  IOSLAVE CFG LSB [2..2]  ================================================= */
typedef enum {                                  /*!< IOSLAVE_CFG_LSB                                                           */
  IOSLAVE_CFG_LSB_MSB_FIRST            = 0,     /*!< MSB_FIRST : Data is assumed to be sent and received with MSB
                                                     first.                                                                    */
  IOSLAVE_CFG_LSB_LSB_FIRST            = 1,     /*!< LSB_FIRST : Data is assumed to be sent and received with LSB
                                                     first.                                                                    */
} IOSLAVE_CFG_LSB_Enum;

/* ================================================  IOSLAVE CFG SPOL [1..1]  ================================================ */
typedef enum {                                  /*!< IOSLAVE_CFG_SPOL                                                          */
  IOSLAVE_CFG_SPOL_SPI_MODES_0_3       = 0,     /*!< SPI_MODES_0_3 : Polarity 0, handles SPI modes 0 and 3.                    */
  IOSLAVE_CFG_SPOL_SPI_MODES_1_2       = 1,     /*!< SPI_MODES_1_2 : Polarity 1, handles SPI modes 1 and 2.                    */
} IOSLAVE_CFG_SPOL_Enum;

