AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ==========================================  MCUCTRL D2ASPARE UART1PLL [23..23]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_D2ASPARE_UART1PLL                                                 */
  MCUCTRL_D2ASPARE_UART1PLL_EN         = 1,     /*!< EN : Enables system PLL to clock UART1; PCLK always on.                   */
  MCUCTRL_D2ASPARE_UART1PLL_DIS        = 0,     /*!< DIS : Disables system PLL as UART1 clock source                           */
} MCUCTRL_D2ASPARE_UART1PLL_Enum;

/* ==========================================  MCUCTRL D2ASPARE UART0PLL [22..22]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_D2ASPARE_UART0PLL                                                 */
  MCUCTRL_D2ASPARE_UART0PLL_EN         = 1,     /*!< EN : Enables system PLL to clock UART0; PCLK always on.                   */
  MCUCTRL_D2ASPARE_UART0PLL_DIS        = 0,     /*!< DIS : Disables system PLL as UART0 clock source                           */
} MCUCTRL_D2ASPARE_UART0PLL_Enum;

/* ====================================  MCUCTRL D2ASPARE PLLISOLATIONVDDHVDDF [21..21]  ===================================== */
typedef enum {                                  /*!< MCUCTRL_D2ASPARE_PLLISOLATIONVDDHVDDF                                     */
  MCUCTRL_D2ASPARE_PLLISOLATIONVDDHVDDF_EN = 1, /*!< EN : PLL isolation is enabled; set only when the PLL is disabled.         */
  MCUCTRL_D2ASPARE_PLLISOLATIONVDDHVDDF_DIS = 0,/*!< DIS : PLL isolation is disabled; it is safe to enable the PLL
                                                     for clocking.                                                             */
} MCUCTRL_D2ASPARE_PLLISOLATIONVDDHVDDF_Enum;

/* ======================================================  BOOTLOADER  ======================================================= */
/* =======================================  MCUCTRL BOOTLOADER SECBOOTONRST [30..31]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_BOOTLOADER_SECBOOTONRST                                           */
  MCUCTRL_BOOTLOADER_SECBOOTONRST_DISABLED = 0, /*!< DISABLED : Secure boot disabled                                           */
  MCUCTRL_BOOTLOADER_SECBOOTONRST_ENABLED = 1,  /*!< ENABLED : Secure boot enabled                                             */
  MCUCTRL_BOOTLOADER_SECBOOTONRST_ERROR = 2,    /*!< ERROR : Error in secure boot configuration                                */
} MCUCTRL_BOOTLOADER_SECBOOTONRST_Enum;

/* ==========================================  MCUCTRL BOOTLOADER SECBOOT [28..29]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_BOOTLOADER_SECBOOT                                                */
  MCUCTRL_BOOTLOADER_SECBOOT_DISABLED  = 0,     /*!< DISABLED : Secure boot disabled                                           */
  MCUCTRL_BOOTLOADER_SECBOOT_ENABLED   = 1,     /*!< ENABLED : Secure boot enabled                                             */
  MCUCTRL_BOOTLOADER_SECBOOT_ERROR     = 2,     /*!< ERROR : Error in secure boot configuration                                */
} MCUCTRL_BOOTLOADER_SECBOOT_Enum;

/* ======================================  MCUCTRL BOOTLOADER SECBOOTFEATURE [26..27]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_BOOTLOADER_SECBOOTFEATURE                                         */
  MCUCTRL_BOOTLOADER_SECBOOTFEATURE_DISABLED = 0,/*!< DISABLED : Secure boot disabled                                          */
  MCUCTRL_BOOTLOADER_SECBOOTFEATURE_ENABLED = 1,/*!< ENABLED : Secure boot enabled                                             */
  MCUCTRL_BOOTLOADER_SECBOOTFEATURE_ERROR = 2,  /*!< ERROR : Error in secure boot configuration                                */
} MCUCTRL_BOOTLOADER_SECBOOTFEATURE_Enum;

/* ===========================================  MCUCTRL BOOTLOADER SBLLOCK [3..3]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_BOOTLOADER_SBLLOCK                                                */
  MCUCTRL_BOOTLOADER_SBLLOCK_LOCK      = 1,     /*!< LOCK : Enable the secure boot lock                                        */
  MCUCTRL_BOOTLOADER_SBLLOCK_UNLOCK    = 0,     /*!< UNLOCK : Disable the secure boot lock                                     */
} MCUCTRL_BOOTLOADER_SBLLOCK_Enum;

/* ==========================================  MCUCTRL BOOTLOADER PROTLOCK [2..2]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_BOOTLOADER_PROTLOCK                                               */
  MCUCTRL_BOOTLOADER_PROTLOCK_LOCK     = 1,     /*!< LOCK : Enable the secure boot lock                                        */
  MCUCTRL_BOOTLOADER_PROTLOCK_DEFAULT  = 0,     /*!< DEFAULT : Default value.                                                  */
} MCUCTRL_BOOTLOADER_PROTLOCK_Enum;

/* ===========================================  MCUCTRL BOOTLOADER SBRLOCK [1..1]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_BOOTLOADER_SBRLOCK                                                */
  MCUCTRL_BOOTLOADER_SBRLOCK_LOCK      = 1,     /*!< LOCK : Enable the secure boot lock                                        */
  MCUCTRL_BOOTLOADER_SBRLOCK_DEFAULT   = 0,     /*!< DEFAULT : Default value.                                                  */
} MCUCTRL_BOOTLOADER_SBRLOCK_Enum;

/* ======================================================  SHADOWVALID  ====================================================== */
/* =======================================  MCUCTRL SHADOWVALID OTPBOOTFAULT [7..12]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_OTPBOOTFAULT                                          */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_power_fault = 1,/*!< power_fault : Indicate OTP Power fault                                 */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_output_data = 2,/*!< output_data : Conflict on OTP output data                              */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_input_parity = 4,/*!< input_parity : input parity check error                               */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_metal_shielding = 8,/*!< metal_shielding : metal shielding fault                            */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_fsm_error = 16,/*!< fsm_error : fsm parity error                                            */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_reg_error = 32,/*!< reg_error : critical reg parity error                                   */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_no_error = 0,/*!< no_error : No OTP interrupt happens during boot stage                     */
} MCUCTRL_SHADOWVALID_OTPBOOTFAULT_Enum;

/* ==========================================  MCUCTRL SHADOWVALID OTPREADY [6..6]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_OTPREADY                                              */
  MCUCTRL_SHADOWVALID_OTPREADY_VALID   = 1,     /*!< VALID : Indicate OTP is ready for access                                  */
  MCUCTRL_SHADOWVALID_OTPREADY_DEFAULT = 0,     /*!< DEFAULT : Default value.                                                  */
} MCUCTRL_SHADOWVALID_OTPREADY_Enum;

/* ========================================  MCUCTRL SHADOWVALID INFO0SELOTP [4..4]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_INFO0SELOTP                                           */
  MCUCTRL_SHADOWVALID_INFO0SELOTP_VALID = 1,    /*!< VALID : Indicate select OTP Info0                                         */
  MCUCTRL_SHADOWVALID_INFO0SELOTP_DEFAULT = 0,  /*!< DEFAULT : Default value, Select MRAM Info0                                */
} MCUCTRL_SHADOWVALID_INFO0SELOTP_Enum;

