AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ========================================  MCUCTRL SHADOWVALID INFO1SELOTP [3..3]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_INFO1SELOTP                                           */
  MCUCTRL_SHADOWVALID_INFO1SELOTP_VALID = 1,    /*!< VALID : Indicate selector OTP Info1                                       */
  MCUCTRL_SHADOWVALID_INFO1SELOTP_DEFAULT = 0,  /*!< DEFAULT : Default value, Indicate select MRAM Info1.                      */
} MCUCTRL_SHADOWVALID_INFO1SELOTP_Enum;

/* ===========================================  MCUCTRL SHADOWVALID VALID [0..0]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_VALID                                                 */
  MCUCTRL_SHADOWVALID_VALID_VALID      = 1,     /*!< VALID : Flash information space contains valid data.                      */
  MCUCTRL_SHADOWVALID_VALID_DEFAULT    = 0,     /*!< DEFAULT : Default value.                                                  */
} MCUCTRL_SHADOWVALID_VALID_Enum;

/* =======================================================  SCRATCH0  ======================================================== */
/* =======================================================  SCRATCH1  ======================================================== */
/* =========================================================  DBGR1  ========================================================= */
/* =========================================================  DBGR2  ========================================================= */
/* ======================================================  WICCONTROL  ======================================================= */
/* ==========================================  MCUCTRL WICCONTROL DEEPISWIC [0..0]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_WICCONTROL_DEEPISWIC                                              */
  MCUCTRL_WICCONTROL_DEEPISWIC_SLEEPDEEP_IS_REGULAR_SLEEP = 0,/*!< SLEEPDEEP_IS_REGULAR_SLEEP : When de-asserted, SCR.SLEEPDEEP
                                                     is set and the processor core is in sleep, the processor
                                                     does not enter WIC sleep, and the processor must stay powered-up.         */
  MCUCTRL_WICCONTROL_DEEPISWIC_SLEEPDEEP_IS_WIC_SLEEP = 1,/*!< SLEEPDEEP_IS_WIC_SLEEP : When asserted, SCR.SLEEPDEEP is set
                                                     and the processor core is in sleep, the processor enters
                                                     WIC sleep and the clock and power can both be removed from
                                                     the processor.                                                            */
} MCUCTRL_WICCONTROL_DEEPISWIC_Enum;

/* ========================================================  DBGCTRL  ======================================================== */
/* =========================================  MCUCTRL DBGCTRL DBGTSCLKSEL [12..14]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGTSCLKSEL                                               */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_LOWPWR   = 0,     /*!< LOWPWR : Low power state.                                                 */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_HFRCDIV2 = 1,     /*!< HFRCDIV2 : Selects HFRC divided by 2 as the source dbg ts clk             */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_HFRCDIV8 = 2,     /*!< HFRCDIV8 : Selects HFRC divided by 8 as the source dbg ts clk             */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_HFRCDIV16 = 3,    /*!< HFRCDIV16 : Selects HFRC divided by 16 as the source dbg ts
                                                     clk                                                                       */
  MCUCTRL_DBGCTRL_DBGTSCLKSEL_HFRCDIV32 = 4,    /*!< HFRCDIV32 : Selects HFRC divided by 32 as the source dbg ts
                                                     clk                                                                       */
} MCUCTRL_DBGCTRL_DBGTSCLKSEL_Enum;

/* ==========================================  MCUCTRL DBGCTRL DBGETBENABLE [8..8]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGETBENABLE                                              */
  MCUCTRL_DBGCTRL_DBGETBENABLE_DIS     = 0,     /*!< DIS : Disable ETB.                                                        */
  MCUCTRL_DBGCTRL_DBGETBENABLE_EN      = 1,     /*!< EN : Enable ETB.                                                          */
} MCUCTRL_DBGCTRL_DBGETBENABLE_Enum;

/* =========================================  MCUCTRL DBGCTRL DBGTPIUCLKSEL [1..3]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGTPIUCLKSEL                                             */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_OFF    = 0,     /*!< OFF : Low power state.                                                    */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_HFRC_48MHz = 1, /*!< HFRC_48MHz : Selects HFRC 48Mhz as the source TPIU clk                    */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_HFRC_96MHz = 2, /*!< HFRC_96MHz : Selects HFRC 96Mhz as the source TPIU clk                    */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_HFRC_192MHz = 3,/*!< HFRC_192MHz : Selects HFRC 192Mhz as the source TPIU clk                  */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_HFRC2_125MHz = 4,/*!< HFRC2_125MHz : Selects HFRC2 125Mhz as the source TPIU clk.
                                                     Note that this setting requires CLKGEN.MISC.HFRC2 be enabled              */
  MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_HFRC2_250MHz = 5,/*!< HFRC2_250MHz : Selects HFRC2 250Mhz as the source TPIU clk.
                                                     Note that this setting requires CLKGEN.MISC.HFRC2 be enabled              */
} MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_Enum;

/* =======================================  MCUCTRL DBGCTRL DBGTPIUTRACEENABLE [0..0]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE                                        */
  MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_DIS = 0,   /*!< DIS : Disable the TPIU TRACE.                                             */
  MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_EN = 1,    /*!< EN : Enable the TPIU TRACE.                                               */
} MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_Enum;

