AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ======================================================  OTAPOINTER  ======================================================= */
/* ===========================================  MCUCTRL OTAPOINTER OTASBR [2..2]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_OTAPOINTER_OTASBR                                                 */
  MCUCTRL_OTAPOINTER_OTASBR_SBL        = 0,     /*!< SBL : If OTAVALID=1, OTASBRUPDATE=0, and OTASBR=0, OTA is processed
                                                     by the secure bootloader (SBL).                                           */
  MCUCTRL_OTAPOINTER_OTASBR_SBR        = 1,     /*!< SBR : If OTAVALID=1, OTASBRUPDATE=1, and OTASBR=1, OTA is processed
                                                     by the secure bootrom (SBR).                                              */
} MCUCTRL_OTAPOINTER_OTASBR_Enum;

/* ========================================  MCUCTRL OTAPOINTER OTASBRUPDATE [1..1]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_OTAPOINTER_OTASBRUPDATE                                           */
  MCUCTRL_OTAPOINTER_OTASBRUPDATE_SBL  = 0,     /*!< SBL : Must be 0 for SBL update.                                           */
  MCUCTRL_OTAPOINTER_OTASBRUPDATE_SBR  = 1,     /*!< SBR : Must be 1 for SBR update.                                           */
} MCUCTRL_OTAPOINTER_OTASBRUPDATE_Enum;

/* ==========================================  MCUCTRL OTAPOINTER OTAVALID [0..0]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_OTAPOINTER_OTAVALID                                               */
  MCUCTRL_OTAPOINTER_OTAVALID_INVALID  = 0,     /*!< INVALID : OTA update is not valid.                                        */
  MCUCTRL_OTAPOINTER_OTAVALID_VALID    = 1,     /*!< VALID : OTA update is valid.                                              */
} MCUCTRL_OTAPOINTER_OTAVALID_Enum;

/* ======================================================  APBDMACTRL  ======================================================= */
/* =========================================  MCUCTRL APBDMACTRL DECODEABORT [1..1]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_APBDMACTRL_DECODEABORT                                            */
  MCUCTRL_APBDMACTRL_DECODEABORT_DISABLE = 0,   /*!< DISABLE : Bus operations to powered down peripherals are quietly
                                                     discarded                                                                 */
  MCUCTRL_APBDMACTRL_DECODEABORT_ENABLE = 1,    /*!< ENABLE : Bus operations to powered down peripherals result in
                                                     a bus fault.                                                              */
} MCUCTRL_APBDMACTRL_DECODEABORT_Enum;

/* ==========================================  MCUCTRL APBDMACTRL DMAENABLE [0..0]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_APBDMACTRL_DMAENABLE                                              */
  MCUCTRL_APBDMACTRL_DMAENABLE_DISABLE = 0,     /*!< DISABLE : DMA operations disabled                                         */
  MCUCTRL_APBDMACTRL_DMAENABLE_ENABLE  = 1,     /*!< ENABLE : DMA operations enabled                                           */
} MCUCTRL_APBDMACTRL_DMAENABLE_Enum;

/* =====================================================  FORCEAXICLKEN  ===================================================== */
/* ======================================================  KEXTCLKSEL  ======================================================= */
/* =========================================  MCUCTRL KEXTCLKSEL KEXTCLKSEL [0..31]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_KEXTCLKSEL_KEXTCLKSEL                                             */
  MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Key    = 83,    /*!< Key : Key value to unlock the register.                                   */
} MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Enum;

/* =======================================================  SIMOBUCK0  ======================================================= */
/* =======================================================  SIMOBUCK1  ======================================================= */
/* ======================================  MCUCTRL SIMOBUCK1 SIMOBUCKHPTRIMEN [31..31]  ====================================== */
typedef enum {                                  /*!< MCUCTRL_SIMOBUCK1_SIMOBUCKHPTRIMEN                                        */
  MCUCTRL_SIMOBUCK1_SIMOBUCKHPTRIMEN_SIMOBUCK_HP_OFF = 0,/*!< SIMOBUCK_HP_OFF : Disable simobuck hp trim.                      */
  MCUCTRL_SIMOBUCK1_SIMOBUCKHPTRIMEN_SIMOBUCK_HP_ON = 1,/*!< SIMOBUCK_HP_ON : Enable simobuck hp trim.                         */
} MCUCTRL_SIMOBUCK1_SIMOBUCKHPTRIMEN_Enum;

/* =======================================  MCUCTRL SIMOBUCK1 SIMOBUCKOBSEN [30..30]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_SIMOBUCK1_SIMOBUCKOBSEN                                           */
  MCUCTRL_SIMOBUCK1_SIMOBUCKOBSEN_SIMO_DATA_OFF = 0,/*!< SIMO_DATA_OFF : Disable simobuck data output.                         */
  MCUCTRL_SIMOBUCK1_SIMOBUCKOBSEN_SIMO_DATA_ON = 1,/*!< SIMO_DATA_ON : Enable simobuck data output.                            */
} MCUCTRL_SIMOBUCK1_SIMOBUCKOBSEN_Enum;

/* ==========================================  MCUCTRL SIMOBUCK1 BUCKMODE [29..29]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SIMOBUCK1_BUCKMODE                                                */
  MCUCTRL_SIMOBUCK1_BUCKMODE_ZXCOMP    = 0,     /*!< ZXCOMP : Select default (ZXCOMP) sequence operating mode.                 */
  MCUCTRL_SIMOBUCK1_BUCKMODE_NOZXCOMP  = 1,     /*!< NOZXCOMP : Select backup sequence operating mode.                         */
} MCUCTRL_SIMOBUCK1_BUCKMODE_Enum;

