AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ========================================  MCUCTRL SIMOBUCK1 FORCEBUCKOFF [28..28]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_SIMOBUCK1_FORCEBUCKOFF                                            */
  MCUCTRL_SIMOBUCK1_FORCEBUCKOFF_VARIED_CYCLES = 0,/*!< VARIED_CYCLES : Stop point will vary depending on operating
                                                     mode.                                                                     */
  MCUCTRL_SIMOBUCK1_FORCEBUCKOFF_TWO_CYCLE = 1, /*!< TWO_CYCLE : Stop exactly 1 TONCLK cycle before snubber asserts.           */
} MCUCTRL_SIMOBUCK1_FORCEBUCKOFF_Enum;

/* ========================================  MCUCTRL SIMOBUCK1 FORCETONCLKEN [3..3]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_SIMOBUCK1_FORCETONCLKEN                                           */
  MCUCTRL_SIMOBUCK1_FORCETONCLKEN_LP_TONCLK = 0,/*!< LP_TONCLK : TONCLK will be active only when needed.                       */
  MCUCTRL_SIMOBUCK1_FORCETONCLKEN_AON_TONCLK = 1,/*!< AON_TONCLK : TONCLK is always on.                                        */
} MCUCTRL_SIMOBUCK1_FORCETONCLKEN_Enum;

/* =======================================================  SIMOBUCK2  ======================================================= */
/* =======================================================  SIMOBUCK3  ======================================================= */
/* =======================================================  SIMOBUCK4  ======================================================= */
/* =======================================================  SIMOBUCK5  ======================================================= */
/* =======================================================  SIMOBUCK6  ======================================================= */
/* =======================================================  SIMOBUCK7  ======================================================= */
/* =======================================================  SIMOBUCK8  ======================================================= */
/* =======================================================  SIMOBUCK9  ======================================================= */
/* ======================================================  SIMOBUCK10  ======================================================= */
/* ======================================================  SIMOBUCK11  ======================================================= */
/* ======================================================  SIMOBUCK12  ======================================================= */
/* ======================================================  SIMOBUCK13  ======================================================= */
/* ======================================================  SIMOBUCK14  ======================================================= */
/* ======================================================  SIMOBUCK15  ======================================================= */
/* ========================================================  PWRSW0  ========================================================= */
/* ======================================  MCUCTRL PWRSW0 PWRSWVDDRCPUSTATSEL [30..30]  ====================================== */
typedef enum {                                  /*!< MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL                                        */
  MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_VDDFLP = 1,/*!< VDDFLP : Select VDDFLP rail                                               */
  MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_VDDS = 0,  /*!< VDDS : Select VDDS rail                                                   */
} MCUCTRL_PWRSW0_PWRSWVDDRCPUSTATSEL_Enum;

/* =======================================  MCUCTRL PWRSW0 PWRSWVDDMLSTATSEL [25..25]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL                                          */
  MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_VDDC = 0,    /*!< VDDC : Select VDDC rail                                                   */
  MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_VDDF = 1,    /*!< VDDF : Select VDDF rail                                                   */
} MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_Enum;

/* ======================================  MCUCTRL PWRSW0 PWRSWVDDMCPUSTATSEL [16..16]  ====================================== */
typedef enum {                                  /*!< MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL                                        */
  MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_VDDC = 0,  /*!< VDDC : Select VDDC rail                                                   */
  MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_VDDF = 1,  /*!< VDDF : Select VDDF rail                                                   */
} MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Enum;

/* ========================================================  PWRSW1  ========================================================= */
/* =======================================  MCUCTRL PWRSW1 PWRSWVDDRMSTATSEL [16..16]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL                                          */
  MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_VDDFLP = 1,  /*!< VDDFLP : Select VDDFLP rail                                               */
  MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_VDDS = 0,    /*!< VDDS : Select VDDS rail                                                   */
} MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_Enum;

/* =======================================  MCUCTRL PWRSW1 PWRSWVDDRLSTATSEL [12..12]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL                                          */
  MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_VDDFLP = 1,  /*!< VDDFLP : Select VDDFLP rail                                               */
  MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_VDDS = 0,    /*!< VDDS : Select VDDS rail                                                   */
} MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_Enum;

