AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* =====================================================  MEMPWRSTATUS  ====================================================== */
/* =========================================  PWRCTRL MEMPWRSTATUS PWRSTTCM [0..2]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMPWRSTATUS_PWRSTTCM                                             */
  PWRCTRL_MEMPWRSTATUS_PWRSTTCM_NONE   = 0,     /*!< NONE : Do not enable power to any DTCMs                                   */
  PWRCTRL_MEMPWRSTATUS_PWRSTTCM_ITCM32K_DTCM128K = 1,/*!< ITCM32K_DTCM128K : Only lower 32k of ITCM and 128k of DTCM is
                                                     powered up                                                                */
  PWRCTRL_MEMPWRSTATUS_PWRSTTCM_ITCM128K_DTCM256K = 3,/*!< ITCM128K_DTCM256K : Only lower 128k of ITCM and 256k of DTCM
                                                     is powered up                                                             */
  PWRCTRL_MEMPWRSTATUS_PWRSTTCM_ITCM256K_DTCM512K = 7,/*!< ITCM256K_DTCM512K : All 256k of ITCM and 512k of DTCM is powered
                                                     up                                                                        */
} PWRCTRL_MEMPWRSTATUS_PWRSTTCM_Enum;

/* =======================================================  MEMRETCFG  ======================================================= */
/* ==========================================  PWRCTRL MEMRETCFG NVMPWDSLP [1..1]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMRETCFG_NVMPWDSLP                                               */
  PWRCTRL_MEMRETCFG_NVMPWDSLP_DIS      = 0,     /*!< DIS : NVM is kept powered on during deep sleep                            */
  PWRCTRL_MEMRETCFG_NVMPWDSLP_EN       = 1,     /*!< EN : NVM is powered down during deep sleep                                */
} PWRCTRL_MEMRETCFG_NVMPWDSLP_Enum;

/* ==========================================  PWRCTRL MEMRETCFG TCMPWDSLP [0..0]  =========================================== */
typedef enum {                                  /*!< PWRCTRL_MEMRETCFG_TCMPWDSLP                                               */
  PWRCTRL_MEMRETCFG_TCMPWDSLP_DIS      = 0,     /*!< DIS : All enabled TCM is kept powered on and retained during
                                                     deep sleep                                                                */
  PWRCTRL_MEMRETCFG_TCMPWDSLP_EN       = 1,     /*!< EN : All enabled TCM is powered down (not retained) during deep
                                                     sleep                                                                     */
} PWRCTRL_MEMRETCFG_TCMPWDSLP_Enum;

/* =====================================================  SYSPWRSTATUS  ====================================================== */
/* ======================================================  SSRAMPWREN  ======================================================= */
/* =========================================  PWRCTRL SSRAMPWREN PWRENSSRAM [0..2]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_SSRAMPWREN_PWRENSSRAM                                             */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_NONE   = 0,     /*!< NONE : Do not power ON any of the SRAM banks                              */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_GROUP0 = 1,     /*!< GROUP0 : Power ON only SRAM0 group (lower 1M)                             */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_GROUP1 = 2,     /*!< GROUP1 : Power ON only SRAM1 group (middle 1M)                            */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_GROUP2 = 4,     /*!< GROUP2 : Power ON only SRAM2 group (upper 1M)                             */
  PWRCTRL_SSRAMPWREN_PWRENSSRAM_ALL    = 7,     /*!< ALL : All shared SRAM banks (SSRAM0 1M + SSRAM1 1M + SSRAM2
                                                     1M) powered ON                                                            */
} PWRCTRL_SSRAMPWREN_PWRENSSRAM_Enum;

/* ======================================================  SSRAMPWRST  ======================================================= */
/* ======================================================  SSRAMRETCFG  ====================================================== */
/* ========================================  PWRCTRL SSRAMRETCFG SSRAMPWDSLP [0..2]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP                                           */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_NONE = 0,     /*!< NONE : All banks retained                                                 */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_GROUP0 = 1,   /*!< GROUP0 : Power down only SRAM group0                                      */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_GROUP1 = 2,   /*!< GROUP1 : Power down only SRAM group1                                      */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_GROUP2 = 4,   /*!< GROUP2 : Power down only SRAM group2                                      */
  PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_ALL  = 7,     /*!< ALL : All shared SRAM banks powered down                                  */
} PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_Enum;

/* =====================================================  DEVPWREVENTEN  ===================================================== */
/* ========================================  PWRCTRL DEVPWREVENTEN PDMEVEN [12..12]  ========================================= */
typedef enum {                                  /*!< PWRCTRL_DEVPWREVENTEN_PDMEVEN                                             */
  PWRCTRL_DEVPWREVENTEN_PDMEVEN_EN     = 1,     /*!< EN : Enable PDM power-on status event                                     */
  PWRCTRL_DEVPWREVENTEN_PDMEVEN_DIS    = 0,     /*!< DIS : Disable PDM power-on status event                                   */
} PWRCTRL_DEVPWREVENTEN_PDMEVEN_Enum;

