AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ======================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEHCPB [9..9]  ====================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPB                                      */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPB_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                          */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPB_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPB_Enum;

/* ======================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEHCPA [8..8]  ====================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPA                                      */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPA_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                          */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPA_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPA_Enum;

/* ======================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEGFX [7..7]  ======================================= */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEGFX                                       */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEGFX_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                           */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEGFX_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEGFX_Enum;

/* ====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEDISPPHY [6..6]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISPPHY                                   */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISPPHY_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                       */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISPPHY_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISPPHY_Enum;

/* ======================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEDISP [5..5]  ====================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISP                                      */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISP_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                          */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISP_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISP_Enum;

/* ======================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEDBG [4..4]  ======================================= */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDBG                                       */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDBG_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                           */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDBG_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDBG_Enum;

/* =====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDECRYPTO [3..3]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDECRYPTO                                    */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDECRYPTO_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                        */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDECRYPTO_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDECRYPTO_Enum;

/* =====================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEAUDADC [2..2]  ===================================== */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUDADC                                    */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUDADC_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                        */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUDADC_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUDADC_Enum;

/* ======================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEAUD [1..1]  ======================================= */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUD                                       */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUD_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                           */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUD_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUD_Enum;

/* ======================================  PWRCTRL PWRACKOVR PWRACKOVERRIDEADC [0..0]  ======================================= */
typedef enum {                                  /*!< PWRCTRL_PWRACKOVR_PWRACKOVERRIDEADC                                       */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEADC_DEFAULT = 0,/*!< DEFAULT : Hardware generates Power switch ack                           */
  PWRCTRL_PWRACKOVR_PWRACKOVERRIDEADC_SWOVRRIDE = 1,/*!< SWOVRRIDE : Software override or defeaure mode. Will bypass
                                                     HW generated power ack                                                    */
} PWRCTRL_PWRACKOVR_PWRACKOVERRIDEADC_Enum;

/* =====================================================  PWRCNTDEFVAL  ====================================================== */
/* ======================================================  GFXPERFREQ  ======================================================= */
/* =========================================  PWRCTRL GFXPERFREQ GFXPERFREQ [0..1]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_GFXPERFREQ_GFXPERFREQ                                             */
  PWRCTRL_GFXPERFREQ_GFXPERFREQ_HFRC_96MHz = 0, /*!< HFRC_96MHz : GFX to be run in LP mode (freq=96MHz)                        */
  PWRCTRL_GFXPERFREQ_GFXPERFREQ_HFRC_192MHz = 1,/*!< HFRC_192MHz : GFX to be run in HP1 mode (freq=192MHz)                     */
  PWRCTRL_GFXPERFREQ_GFXPERFREQ_HFRC2_125MHz = 2,/*!< HFRC2_125MHz : GFX to be run in HP2 mode (freq=125MHz)                   */
  PWRCTRL_GFXPERFREQ_GFXPERFREQ_HFRC2_250MHz = 3,/*!< HFRC2_250MHz : GFX to be run in HP3 mode (freq=250MHz)                   */
} PWRCTRL_GFXPERFREQ_GFXPERFREQ_Enum;

/* ======================================================  GFXPWRSWSEL  ====================================================== */
/* =========================================  PWRCTRL GFXPWRSWSEL GFXVDDSEL [0..0]  ========================================== */
typedef enum {                                  /*!< PWRCTRL_GFXPWRSWSEL_GFXVDDSEL                                             */
  PWRCTRL_GFXPWRSWSEL_GFXVDDSEL_VDDC   = 0,     /*!< VDDC : GFX VDD select VDDC                                                */
  PWRCTRL_GFXPWRSWSEL_GFXVDDSEL_VDDF   = 1,     /*!< VDDF : GFX VDD select VDDF                                                */
} PWRCTRL_GFXPWRSWSEL_GFXVDDSEL_Enum;

