AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ==========================================  SDIO0 CAPABILITIES0 ADMA2 [19..19]  =========================================== */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_ADMA2                                                 */
  SDIO0_CAPABILITIES0_ADMA2_SUPPORTED  = 1,     /*!< SUPPORTED : ADMA2 support.                                                */
  SDIO0_CAPABILITIES0_ADMA2_NOTSUPPORTED = 0,   /*!< NOTSUPPORTED : ADMA2 not support                                          */
} SDIO0_CAPABILITIES0_ADMA2_Enum;

/* =========================================  SDIO0 CAPABILITIES0 EXTMEDIA [18..18]  ========================================= */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_EXTMEDIA                                              */
  SDIO0_CAPABILITIES0_EXTMEDIA_SUPPORTED = 1,   /*!< SUPPORTED : Extended Media Bus Supported                                  */
  SDIO0_CAPABILITIES0_EXTMEDIA_NOTSUPPORTED = 0,/*!< NOTSUPPORTED : Extended Media Bus not supported                           */
} SDIO0_CAPABILITIES0_EXTMEDIA_Enum;

/* ========================================  SDIO0 CAPABILITIES0 MAXBLKLEN [16..17]  ========================================= */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_MAXBLKLEN                                             */
  SDIO0_CAPABILITIES0_MAXBLKLEN_512    = 0,     /*!< 512 : 512 byte                                                            */
  SDIO0_CAPABILITIES0_MAXBLKLEN_1024   = 1,     /*!< 1024 : 1024 byte                                                          */
  SDIO0_CAPABILITIES0_MAXBLKLEN_2048   = 2,     /*!< 2048 : 2048 byte                                                          */
  SDIO0_CAPABILITIES0_MAXBLKLEN_4096   = 3,     /*!< 4096 : 4096 byte                                                          */
} SDIO0_CAPABILITIES0_MAXBLKLEN_Enum;

/* =========================================  SDIO0 CAPABILITIES0 SDCLKFREQ [8..15]  ========================================= */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_SDCLKFREQ                                             */
  SDIO0_CAPABILITIES0_SDCLKFREQ_255MHZ = 255,   /*!< 255MHZ : 2) 8-bit base clock frequency supports frequencies
                                                     10MHz-255MHz.                                                             */
  SDIO0_CAPABILITIES0_SDCLKFREQ_63MHZ  = 63,    /*!< 63MHZ : 1) 6-bit base clock frequency supports frequencies 10MHz-63MHz.
                                                     2) 8-bit base clock frequency supports frequencies 10MHz-255MHz.          */
  SDIO0_CAPABILITIES0_SDCLKFREQ_2MHZ   = 2,     /*!< 2MHZ : 1) 6-bit base clock frequency supports frequencies 10MHz-63MHz.
                                                     2) 8-bit base clock frequency supports frequencies 10MHz-255MHz.          */
  SDIO0_CAPABILITIES0_SDCLKFREQ_1MHZ   = 1,     /*!< 1MHZ : 1) 6-bit base clock frequency supports frequencies 10MHz-63MHz.
                                                     2) 8-bit base clock frequency supports frequencies 10MHz-255MHz.          */
  SDIO0_CAPABILITIES0_SDCLKFREQ_OTHER  = 0,     /*!< OTHER : Get information via another method                                */
} SDIO0_CAPABILITIES0_SDCLKFREQ_Enum;

/* =========================================  SDIO0 CAPABILITIES0 TOCLKUNIT [7..7]  ========================================== */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_TOCLKUNIT                                             */
  SDIO0_CAPABILITIES0_TOCLKUNIT_KHZ    = 0,     /*!< KHZ : Khz                                                                 */
  SDIO0_CAPABILITIES0_TOCLKUNIT_MHZ    = 1,     /*!< MHZ : Mhz                                                                 */
} SDIO0_CAPABILITIES0_TOCLKUNIT_Enum;

/* =========================================  SDIO0 CAPABILITIES0 TOCLKFREQ [0..5]  ========================================== */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_TOCLKFREQ                                             */
  SDIO0_CAPABILITIES0_TOCLKFREQ_1KHZMHZ = 1,    /*!< 1KHZMHZ : 1KHZ or 1MHZ                                                    */
  SDIO0_CAPABILITIES0_TOCLKFREQ_2KHZMHZ = 2,    /*!< 2KHZMHZ : 2KHZ or 2MHZ                                                    */
  SDIO0_CAPABILITIES0_TOCLKFREQ_63KHZMHZ = 63,  /*!< 63KHZMHZ : 63KHZ or 63MHZ                                                 */
  SDIO0_CAPABILITIES0_TOCLKFREQ_OTHER  = 0,     /*!< OTHER : Get Information via another method.                               */
} SDIO0_CAPABILITIES0_TOCLKFREQ_Enum;

/* =====================================================  CAPABILITIES1  ===================================================== */
/* =======================================  SDIO0 CAPABILITIES1 SPIBLOCKMODE [25..25]  ======================================= */
typedef enum {                                  /*!< SDIO0_CAPABILITIES1_SPIBLOCKMODE                                          */
  SDIO0_CAPABILITIES1_SPIBLOCKMODE_NOTSUPPORTED = 0,/*!< NOTSUPPORTED : Not Supported                                          */
  SDIO0_CAPABILITIES1_SPIBLOCKMODE_SUPPORTED = 1,/*!< SUPPORTED : Supported                                                    */
} SDIO0_CAPABILITIES1_SPIBLOCKMODE_Enum;

/* =========================================  SDIO0 CAPABILITIES1 SPIMODE [24..24]  ========================================== */
typedef enum {                                  /*!< SDIO0_CAPABILITIES1_SPIMODE                                               */
  SDIO0_CAPABILITIES1_SPIMODE_NOTSUPPORTED = 0, /*!< NOTSUPPORTED : Not Supported                                              */
  SDIO0_CAPABILITIES1_SPIMODE_SUPPORTED = 1,    /*!< SUPPORTED : Supported                                                     */
} SDIO0_CAPABILITIES1_SPIMODE_Enum;

/* =========================================  SDIO0 CAPABILITIES1 CLKMULT [16..23]  ========================================== */
typedef enum {                                  /*!< SDIO0_CAPABILITIES1_CLKMULT                                               */
  SDIO0_CAPABILITIES1_CLKMULT_MULTX256 = 255,   /*!< MULTX256 : Clock Multiplier M = 256                                       */
  SDIO0_CAPABILITIES1_CLKMULT_MULTX3   = 2,     /*!< MULTX3 : Clock Multiplier M = 3                                           */
  SDIO0_CAPABILITIES1_CLKMULT_MULTX2   = 1,     /*!< MULTX2 : Clock Multiplier M = 2                                           */
  SDIO0_CAPABILITIES1_CLKMULT_NOTSUPPORTED = 0, /*!< NOTSUPPORTED : Clock Multiplier is Not Supported                          */
} SDIO0_CAPABILITIES1_CLKMULT_Enum;

/* ======================================  SDIO0 CAPABILITIES1 RETUNINGMODES [14..15]  ======================================= */
typedef enum {                                  /*!< SDIO0_CAPABILITIES1_RETUNINGMODES                                         */
  SDIO0_CAPABILITIES1_RETUNINGMODES_MODE1 = 0,  /*!< MODE1 : Mode1                                                             */
  SDIO0_CAPABILITIES1_RETUNINGMODES_MODE2 = 1,  /*!< MODE2 : Mode2                                                             */
  SDIO0_CAPABILITIES1_RETUNINGMODES_MODE3 = 2,  /*!< MODE3 : Mode3                                                             */
  SDIO0_CAPABILITIES1_RETUNINGMODES_NOTSUPPORTED = 3,/*!< NOTSUPPORTED : Clock Multiplier is not supported.                    */
} SDIO0_CAPABILITIES1_RETUNINGMODES_Enum;

/* =======================================  SDIO0 CAPABILITIES1 TUNINGSDR50 [13..13]  ======================================== */
typedef enum {                                  /*!< SDIO0_CAPABILITIES1_TUNINGSDR50                                           */
  SDIO0_CAPABILITIES1_TUNINGSDR50_TUNINGREQD = 1,/*!< TUNINGREQD : SDR50 requires tuning                                       */
  SDIO0_CAPABILITIES1_TUNINGSDR50_NOTUNINGREQD = 0,/*!< NOTUNINGREQD : SDR50 does not require tuning                           */
} SDIO0_CAPABILITIES1_TUNINGSDR50_Enum;

/* ======================================  SDIO0 CAPABILITIES1 RETUNINGTMRCNT [8..11]  ======================================= */
typedef enum {                                  /*!< SDIO0_CAPABILITIES1_RETUNINGTMRCNT                                        */
  SDIO0_CAPABILITIES1_RETUNINGTMRCNT_OTHER = 0, /*!< OTHER : 0h Get information via other source.                              */
  SDIO0_CAPABILITIES1_RETUNINGTMRCNT_1SEC = 1,  /*!< 1SEC : 1 seconds                                                          */
  SDIO0_CAPABILITIES1_RETUNINGTMRCNT_2SEC = 2,  /*!< 2SEC : 2 seconds                                                          */
  SDIO0_CAPABILITIES1_RETUNINGTMRCNT_4SEC = 3,  /*!< 4SEC : 4 seconds                                                          */
  SDIO0_CAPABILITIES1_RETUNINGTMRCNT_8S = 4,    /*!< 8S : 8 seconds                                                            */
  SDIO0_CAPABILITIES1_RETUNINGTMRCNT_16S = 5,   /*!< 16S : 16 seconds                                                          */
  SDIO0_CAPABILITIES1_RETUNINGTMRCNT_32S = 6,   /*!< 32S : 32 seconds                                                          */
  SDIO0_CAPABILITIES1_RETUNINGTMRCNT_64S = 7,   /*!< 64S : 64 seconds                                                          */
  SDIO0_CAPABILITIES1_RETUNINGTMRCNT_128S = 8,  /*!< 128S : 128 seconds                                                        */
  SDIO0_CAPABILITIES1_RETUNINGTMRCNT_256S = 9,  /*!< 256S : 256 seconds                                                        */
  SDIO0_CAPABILITIES1_RETUNINGTMRCNT_512S = 10, /*!< 512S : 512 seconds                                                        */
  SDIO0_CAPABILITIES1_RETUNINGTMRCNT_1024S = 11,/*!< 1024S : 1024 seconds                                                      */
} SDIO0_CAPABILITIES1_RETUNINGTMRCNT_Enum;

