AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ========================================  SDIO0 FORCE FORCECURRLIMITERR [23..23]  ========================================= */
typedef enum {                                  /*!< SDIO0_FORCE_FORCECURRLIMITERR                                             */
  SDIO0_FORCE_FORCECURRLIMITERR_INT    = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCECURRLIMITERR_NOINT  = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO0_FORCE_FORCECURRLIMITERR_Enum;

/* =========================================  SDIO0 FORCE FORCEDATAENDERR [22..22]  ========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCEDATAENDERR                                               */
  SDIO0_FORCE_FORCEDATAENDERR_INT      = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCEDATAENDERR_NOINT    = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO0_FORCE_FORCEDATAENDERR_Enum;

/* =========================================  SDIO0 FORCE FORCEDATACRCERR [21..21]  ========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCEDATACRCERR                                               */
  SDIO0_FORCE_FORCEDATACRCERR_INT      = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCEDATACRCERR_NOINT    = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO0_FORCE_FORCEDATACRCERR_Enum;

/* ==========================================  SDIO0 FORCE FORCEDATATOERR [20..20]  ========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCEDATATOERR                                                */
  SDIO0_FORCE_FORCEDATATOERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCEDATATOERR_NOINT     = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO0_FORCE_FORCEDATATOERR_Enum;

/* ==========================================  SDIO0 FORCE FORCECMDIDXERR [19..19]  ========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCECMDIDXERR                                                */
  SDIO0_FORCE_FORCECMDIDXERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCECMDIDXERR_NOINT     = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO0_FORCE_FORCECMDIDXERR_Enum;

/* ==========================================  SDIO0 FORCE FORCECMDENDERR [18..18]  ========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCECMDENDERR                                                */
  SDIO0_FORCE_FORCECMDENDERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCECMDENDERR_NOINT     = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO0_FORCE_FORCECMDENDERR_Enum;

/* ==========================================  SDIO0 FORCE FORCECMDCRCERR [17..17]  ========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCECMDCRCERR                                                */
  SDIO0_FORCE_FORCECMDCRCERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCECMDCRCERR_NOINT     = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO0_FORCE_FORCECMDCRCERR_Enum;

/* ==========================================  SDIO0 FORCE FORCECMDTOERR [16..16]  =========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCECMDTOERR                                                 */
  SDIO0_FORCE_FORCECMDTOERR_INT        = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCECMDTOERR_NOINT      = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO0_FORCE_FORCECMDTOERR_Enum;

/* =========================================  SDIO0 FORCE FORCEACMDISSUEDERR [7..7]  ========================================= */
typedef enum {                                  /*!< SDIO0_FORCE_FORCEACMDISSUEDERR                                            */
  SDIO0_FORCE_FORCEACMDISSUEDERR_INT   = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCEACMDISSUEDERR_NOINT = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO0_FORCE_FORCEACMDISSUEDERR_Enum;

/* ==========================================  SDIO0 FORCE FORCEACMDIDXERR [4..4]  =========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCEACMDIDXERR                                               */
  SDIO0_FORCE_FORCEACMDIDXERR_INT      = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCEACMDIDXERR_NOINT    = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO0_FORCE_FORCEACMDIDXERR_Enum;

/* ==========================================  SDIO0 FORCE FORCEACMDENDERR [3..3]  =========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCEACMDENDERR                                               */
  SDIO0_FORCE_FORCEACMDENDERR_INT      = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCEACMDENDERR_NOINT    = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO0_FORCE_FORCEACMDENDERR_Enum;

/* ==========================================  SDIO0 FORCE FORCEACMDCRCERR [2..2]  =========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCEACMDCRCERR                                               */
  SDIO0_FORCE_FORCEACMDCRCERR_INT      = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCEACMDCRCERR_NOINT    = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO0_FORCE_FORCEACMDCRCERR_Enum;

/* ===========================================  SDIO0 FORCE FORCEACMDTOERR [1..1]  =========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCEACMDTOERR                                                */
  SDIO0_FORCE_FORCEACMDTOERR_INT       = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCEACMDTOERR_NOINT     = 0,     /*!< NOINT : no interrupt                                                      */
} SDIO0_FORCE_FORCEACMDTOERR_Enum;

