AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite-r2/sdk/CMSIS/AmbiqMicro/Include/apollo510_generic.h
/* ============================================  SDIO0 VENDOR GATESDCLKEN [0..0]  ============================================ */
typedef enum {                                  /*!< SDIO0_VENDOR_GATESDCLKEN                                                  */
  SDIO0_VENDOR_GATESDCLKEN_GATE        = 1,     /*!< GATE : SD_CLK to card will be gated automatically when there
                                                     is no transfer.                                                           */
  SDIO0_VENDOR_GATESDCLKEN_NOGATE      = 0,     /*!< NOGATE : SD_CLK to card will NOT be gated automatically when
                                                     there is no transfer.                                                     */
} SDIO0_VENDOR_GATESDCLKEN_Enum;

/* =======================================================  SLOTSTAT  ======================================================== */
/* =======================================================  CLKOUTCFG  ======================================================= */
/* =============================================  SDIO0 CLKOUTCFG WIDEN [4..4]  ============================================== */
typedef enum {                                  /*!< SDIO0_CLKOUTCFG_WIDEN                                                     */
  SDIO0_CLKOUTCFG_WIDEN_W              = 1,     /*!< W : widen                                                                 */
  SDIO0_CLKOUTCFG_WIDEN_N              = 0,     /*!< N : narrow                                                                */
} SDIO0_CLKOUTCFG_WIDEN_Enum;

/* ==============================================  SDIO0 CLKOUTCFG STEP [0..3]  ============================================== */
typedef enum {                                  /*!< SDIO0_CLKOUTCFG_STEP                                                      */
  SDIO0_CLKOUTCFG_STEP_DIS             = 0,     /*!< DIS : disable clock duty cycle tuning                                     */
  SDIO0_CLKOUTCFG_STEP_1STEP           = 1,     /*!< 1STEP : clock duty cycle tuning with amount of 1 step                     */
  SDIO0_CLKOUTCFG_STEP_2STEP           = 2,     /*!< 2STEP : clock duty cycle tuning with amount of 2 steps                    */
  SDIO0_CLKOUTCFG_STEP_3STEP           = 3,     /*!< 3STEP : clock duty cycle tuning with amount of 3 steps                    */
  SDIO0_CLKOUTCFG_STEP_4STEP           = 4,     /*!< 4STEP : clock duty cycle tuning with amount of 4 steps                    */
  SDIO0_CLKOUTCFG_STEP_5STEP           = 5,     /*!< 5STEP : clock duty cycle tuning with amount of 5 steps                    */
  SDIO0_CLKOUTCFG_STEP_6STEP           = 6,     /*!< 6STEP : clock duty cycle tuning with amount of 6 steps                    */
  SDIO0_CLKOUTCFG_STEP_7STEP           = 7,     /*!< 7STEP : clock duty cycle tuning with amount of 7 steps                    */
  SDIO0_CLKOUTCFG_STEP_8STEP           = 8,     /*!< 8STEP : clock duty cycle tuning with amount of 8 steps                    */
  SDIO0_CLKOUTCFG_STEP_9STEP           = 9,     /*!< 9STEP : clock duty cycle tuning with amount of 9 steps                    */
  SDIO0_CLKOUTCFG_STEP_10STEP          = 10,    /*!< 10STEP : clock duty cycle tuning with amount of 10 steps                  */
  SDIO0_CLKOUTCFG_STEP_11STEP          = 11,    /*!< 11STEP : clock duty cycle tuning with amount of 11 steps                  */
  SDIO0_CLKOUTCFG_STEP_12STEP          = 12,    /*!< 12STEP : clock duty cycle tuning with amount of 12 steps                  */
  SDIO0_CLKOUTCFG_STEP_13STEP          = 13,    /*!< 13STEP : clock duty cycle tuning with amount of 13 steps                  */
  SDIO0_CLKOUTCFG_STEP_14STEP          = 14,    /*!< 14STEP : clock duty cycle tuning with amount of 14 steps                  */
  SDIO0_CLKOUTCFG_STEP_15STEP          = 15,    /*!< 15STEP : clock duty cycle tuning with amount of 15 steps                  */
} SDIO0_CLKOUTCFG_STEP_Enum;



/* =========================================================================================================================== */
/* ================                                         SECURITY                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  CTRL  ========================================================== */
/* =============================================  SECURITY CTRL FUNCTION [4..7]  ============================================= */
typedef enum {                                  /*!< SECURITY_CTRL_FUNCTION                                                    */
  SECURITY_CTRL_FUNCTION_CRC32         = 0,     /*!< CRC32 : Perform CRC32 operation                                           */
  SECURITY_CTRL_FUNCTION_RAND          = 1,     /*!< RAND : DMA pseudo-random number stream based on CRC value                 */
  SECURITY_CTRL_FUNCTION_GENADDR       = 2,     /*!< GENADDR : Generate DMA stream based on address                            */
} SECURITY_CTRL_FUNCTION_Enum;

/* ========================================================  SRCADDR  ======================================================== */
/* ==========================================================  LEN  ========================================================== */
/* ========================================================  RESULT  ========================================================= */
/* =======================================================  LOCKCTRL  ======================================================== */
/* ============================================  SECURITY LOCKCTRL SELECT [0..7]  ============================================ */
typedef enum {                                  /*!< SECURITY_LOCKCTRL_SELECT                                                  */
  SECURITY_LOCKCTRL_SELECT_LOCK01      = 1,     /*!< LOCK01 : Enable customer OTP program.                                     */
  SECURITY_LOCKCTRL_SELECT_LOCK02      = 2,     /*!< LOCK02 : Enable customer OTP read.                                        */
  SECURITY_LOCKCTRL_SELECT_LOCK11      = 17,    /*!< LOCK11 : Enable Ambiq OTP program.                                        */
  SECURITY_LOCKCTRL_SELECT_LOCK12      = 18,    /*!< LOCK12 : Enable Ambiq OTP read.                                           */
  SECURITY_LOCKCTRL_SELECT_LOCK9D      = 157,   /*!< LOCK9D : Enable Bootloader Recovery.                                      */
  SECURITY_LOCKCTRL_SELECT_LOCK9E      = 158,   /*!< LOCK9E : Enable Bootloader info1.                                         */
  SECURITY_LOCKCTRL_SELECT_RESET       = 0,     /*!< RESET : Reset all.                                                        */
} SECURITY_LOCKCTRL_SELECT_Enum;

